&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	Рез = ЗагрузитьИзJsonНаСервере();
	//Сообщить(НСтр("ru = '"+строка(ссылка)+КодНом(Ссылка)+"'"), СтатусСообщения.БезСтатуса);
	Сообщить(НСтр("ru = '" + "Записано " + строка(Рез) + "'"), СтатусСообщения.БезСтатуса);
КонецПроцедуры

&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	Ссылка = РеквизитФормыВЗначение("Объект").ЗагрузитьИзJsonНаСервере(JsonText);
    Возврат Ссылка;
КонецФункции

&НаСервереБезКонтекста
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция КодНом(Ном)
		
	Возврат Ном.Код;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	JsonText = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Пример").ПолучитьТекст();
КонецПроцедуры
