
&НаСервере
Функция ВыгрузитьОбъектНаСервере()
	
	json = РеквизитФормыВЗначение("Объект").ВыгрузитьОбъект(СсылочныйТип.ПолучитьОбъект());	
	return json;
	// Версия 2
	
	//Отказ = Ложь;
	//ксп_ПодпискиНаСобытия.ксп_ПриЗаписиСправочникаПриЗаписи(СсылочныйТип.ПолучитьОбъект(), Отказ);          
	//
	//Узел = Константы.ксп_УзелОбменаRabbit.Получить();
	//РезЗап = РеквизитФормыВЗначение("Объект").ПолучитьОбъектыДляВыгрузки(Узел);
	//Выборка = РезЗап.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	json = РеквизитФормыВЗначение("Объект").ВыгрузитьОбъект(Выборка);
	//	return json;
	//		
	//КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьОбъект(Команда)
	json = ВыгрузитьОбъектНаСервере();
	message(json);
КонецПроцедуры



&НаСервере
Процедура создатьТестовыйОбъектНаСервере()
	НачатьТранзакцию();
	
	ТестовыйОбъект = Справочники.склады.СоздатьЭлемент();
	
	ТестовыйОбъект.КонтактнаяИнформация.Добавить();
	ТестовыйОбъект.ДополнительныеРеквизиты.Добавить();

	ТестовыйОбъект.ОбменДанными.Загрузка = Истина;
	ТестовыйОбъект.Записать();
	
	СсылочныйТип = ТестовыйОбъект.Ссылка;
	
	сообщить(ВыгрузитьОбъектНаСервере());
	
	ОтменитьТранзакцию();
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура создатьТестовыйОбъект(Команда)
	создатьТестовыйОбъектНаСервере();
КонецПроцедуры
