
&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначения)Экспорт 
	// Сообщить(ВладелецФормы.Элементы.Товары.ТекущиеДанные.НомерСтроки);
	Для каждого стрк Из ВладелецФормы.Объект.Товары Цикл
		Если ЗначениеЗаполнено(стрк.КСП_ПроверочнаяВедомость) Тогда  
				//ПоказатьЗначение(,стрк.КСП_ПроверочнаяВедомость);
			Иначе    
				стрк.КСП_ПроверочнаяВедомость = СоздатьПроверочнуюВедомость(ВладелецФормы.Объект.Ссылка,ВладелецФормы.Объект.Распоряжение,
				стрк.Номенклатура, стрк.Количество, стрк.Упаковка, стрк.Характеристика, стрк.Серия, стрк.СтатусУказанияСерий);		
				ВладелецФормы.Модифицированность = Истина;  
			КонецЕсли;
	КонецЦикла;
     
   

КонецПроцедуры
 
&НаКлиенте
Процедура Сформировать(Команда) 
	
	ВыполнитьКоманду("", Объект.Документ); 
	
КонецПроцедуры 


&НаСервере
Функция СоздатьПроверочнуюВедомость(Ордер, Распоряжение, Номенклатура, Количество, Упаковка, Характеристика, Серия, СтатусУказанияСерий) 
	
	НоваяПроверочнаяВедомость = Документы.Ксп_ПроверочнаяВедомость.СоздатьДокумент();
    НоваяПроверочнаяВедомость.ДокументОснование = Ордер;
	НоваяПроверочнаяВедомость.Номенклатура = Номенклатура;
	НоваяПроверочнаяВедомость.ОбщееКоличество   = Количество;
	НоваяПроверочнаяВедомость.Организация   = Распоряжение.Организация;
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		 НоваяПроверочнаяВедомость.Контрагент   = Распоряжение.Контрагент; 
	КонецЕсли;
	НоваяПроверочнаяВедомость.ЕдиницаИзмерения   = ?(ЗначениеЗаполнено(Упаковка),Упаковка, Номенклатура.ЕдиницаИзмерения);
	НоваяПроверочнаяВедомость.Характеристика   = Характеристика; 
	НоваяПроверочнаяВедомость.Дата = ТекущаяДата();
	НоваяПроверочнаяВедомость.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НоваяПроверочнаяВедомость.Комментарий = ПараметрыСеанса.ТекущийПользователь;
	НовСтр=НоваяПроверочнаяВедомость.Товары.Добавить();
	Новстр.Номенклатура=Номенклатура;
	Новстр.Характеристика=Характеристика;
	Новстр.ЕдиницаИзмерения=Упаковка;
	НовСтр.ЕдиницаИзмеренияМест=Упаковка;
	Новстр.КоличествоПоставщика=Количество;
	Новстр.Количество=Количество;
	НовСтр.Качество=Справочники.КСП_Качество.Новый;
	НовСтр.ЕдиницаИзмеренияЗаказа=Упаковка;
	НовСтр.Серия=Серия;
	НовСтр.СтатусУказанияСерий=СтатусУказанияСерий;
	НовСтр.КоличествоВЕдиницеИзмеренияЗаказ=Количество;
	НовСтр.Коэффициент=?(Упаковка.Знаменатель=0,1,Упаковка.Числитель/Упаковка.Знаменатель);
	НовСтр.КлючСтроки=Новый УникальныйИдентификатор();
	НоваяПроверочнаяВедомость.Записать(); 
	Возврат НоваяПроверочнаяВедомость.Ссылка;

КонецФункции
