
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Добавление реквизита
	
	МассивРеквизитов = Новый Массив;	
	ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.КСП_ЛогикаОбработкиДвиженияПоСкладуУПП");
	Логика = Новый РеквизитФормы("Логика", ОписаниеТипа);
	МассивРеквизитов.Добавить(Логика); 
	ИзменитьРеквизиты(МассивРеквизитов);
	
	//Добавление поля ввода
	
	//Элемент1 = ЭтаФорма.Элементы.Добавить("Логика", Тип("ПолеФормы"), ЭтаФорма);
	//Элемент1.Вид = ВидПоляФормы.ПолеВвода;
	//Элемент1.ПутьКДанным = "Логика";
	
	ЛогикаСклада = Справочники.КСП_ЛогикаОбработкиДвиженияПоСкладуУПП.ПустаяСсылка();
	
КонецПроцедуры

&НаСервере
Процедура СкладыПриИзмененииНаСервере()
	
	
	ВыбраннаяЛогика = ЛогикаСклада;
	
	
	ТабДок = Объект.Склады;
	
	Для сч = 1 По ТабДок.ВысотаТаблицы Цикл
		//Сообщить(ТабДок.Область("R"+сч+"C1:R"+сч+"C1").Текст);
		ИмяСклада = ТабДок.Область("R"+сч+"C1:R"+сч+"C1").Текст;
		
		ВидОперацииСсылка = Справочники.КСП_ВидыОперацийПоСкладамУПП.НАйтиПоНаименованию(ИмяСклада, Истина);
		Если НЕ ЗначениеЗаполнено(ВидОперацииСсылка) Тогда
			Сообщить("Не нашли вид операции по наименованию склада <"+ИмяСклада+">!");
			Продолжить;
		КонецЕсли; 
		
		СкладУПП = Справочники.КСП_СкладыУПП.НАйтиПоНаименованию(ИмяСклада, Истина);
		Если НЕ ЗначениеЗаполнено(ВидОперацииСсылка) Тогда
			Сообщить("Не нашли СкладУПП по наименованию склада <"+ИмяСклада+">!");
			Продолжить;
		КонецЕсли; 
		
		НашлиСтроку = Ложь;
		
		ВидОперацииОбъект = ВидОперацииСсылка.ПолучитьОбъект();
		Для каждого стркТЧ Из ВидОперацииОбъект[Объект.ВыборТабЧасти] Цикл
			
			Если стркТЧ.Склад = СкладУПП И СтркТЧ.ЛогикаОбработкиВТЧ = ВыбраннаяЛогика Тогда
				НашлиСтроку = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;     
		
		Если НашлиСтроку = Ложь Тогда
			НовСтрока = ВидОперацииОбъект[Объект.ВыборТабЧасти].Добавить();
			НовСтрока.Склад = СкладУПП;
			НовСтрока.ЛогикаОбработкиВТЧ = ВыбраннаяЛогика; 
			ВидОперацииОбъект.ЗАписать();
			Сообщить("Добавили логику в склад <"+ИмяСклада+">!");
		Иначе 
			Сообщить("Пропустили, т.к. уже есть логика в складе <"+ИмяСклада+">!");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры





&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	СкладыПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры
