&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДвиженияКМФулфилмент = ПредопределенноеЗначение("Документ.ДвиженияКМФулфилмент.пустаяСсылка");
КонецПроцедуры




&НаСервере
Процедура СформироватьВыводИзОборотаИСМПНаСервере()
	РеквизитФормыВЗначение("Объект").СформироватьДокументыВыводИзОборотаИСМП(ДвиженияКМФулфилмент);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВыводИзОборотаИСМП(Команда)
	СформироватьВыводИзОборотаИСМПНаСервере();
КонецПроцедуры


                      