&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДвиженияКМФулфилмент = ПредопределенноеЗначение("Документ.ДвиженияКМФулфилмент.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВыводИзОборотаИСМП(Команда)
	СформироватьВыводИзОборотаИСМПНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьВыводИзОборотаИСМПНаСервере()
	Документ = РеквизитФормыВЗначение("Объект").СформироватьДокументыИСМП(ДвиженияКМФулфилмент);  
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВозвратВОборот(Команда)
	СформироватьВозвратВОборотИСМПНаСервере()
КонецПроцедуры

&НаСервере
Процедура СформироватьВозвратВОборотИСМПНаСервере()
	Документ = РеквизитФормыВЗначение("Объект").СформироватьДокументыИСМП(ДвиженияКМФулфилмент);  
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияКМФулфилментОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВидОперации = ДвиженияКМФулфилментОбработкаВыбораНаСервере(ВыбранноеЗначение);
	Если ВидОперации = 1 Тогда
		ЭтаФорма.Элементы.СформироватьВыводИзОборотаИСМП.Доступность = Истина;
		ЭтаФорма.Элементы.СформироватьВозвратВОборот.Доступность = Ложь;
	ИначеЕсли ВидОперации = 0 Тогда
		ЭтаФорма.Элементы.СформироватьВыводИзОборотаИСМП.Доступность = Ложь;
		ЭтаФорма.Элементы.СформироватьВозвратВОборот.Доступность = Истина;
	КонецЕсли;	
		
КонецПроцедуры
&НаСервере
Функция ДвиженияКМФулфилментОбработкаВыбораНаСервере(ДвиженияКМФулфилмент)
	Если ЗначениеЗаполнено(ДвиженияКМФулфилмент) Тогда
		Рез = ДвиженияКМФулфилмент.ВидОперации; 
		Если Рез = Перечисления.ВидыДвиженийКМФулфилмент.ВыводИзОборота Тогда
			Возврат 1;
		ИначеЕсли Рез = Перечисления.ВидыДвиженийКМФулфилмент.ВозвратВОборот Тогда	
			Возврат 0;
		КонецЕсли;
	КонецЕсли;
КонецФункции






                      