
&НаСервере
Процедура СоздатьВсеРеализацииНаСервере()
	Обк = РеквизитФормыВЗначение("Объект");
	Обк.СоздатьРеализацииНаОснованииЗаказовКлиентов(ПериодВсеРеализации.ДатаНачала, 
		ПериодВсеРеализации.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВсеРеализации(Команда)
	СоздатьВсеРеализацииНаСервере();
	ПоказатьПредупреждение(,"Создание реализаций завершено!");
КонецПроцедуры

&НаСервере
Процедура СоздатьОднуРеализациюНаСервере()
	
	Обк = РеквизитФормыВЗначение("Объект");
	
	ДанныеЗаказа = НайтиЗаказВРегистре_crm_ИсходныеДанныеЗаказов(ЗаказКлиента);
	
	Если ДанныеЗаказа.Успешно <> Истина Тогда
		ВызватьИсключение "Не найден заказ в РС.ксп_ИсходныеДанныеЗаказов!";
	КонецЕсли;
	
	Рез = Обк.СоздатьОднуРеализацию(ЗаказКлиента, ДанныеЗаказа.id, ДанныеЗаказа.site, ДанныеЗаказа.status);
	
	Реализация = Рез;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОднуРеализацию(Команда)
	Если НЕ ЗначениеЗаполнено(ЗаказКлиента) Тогда
		ВызватьИсключение "Не выбран заказ клиента!";
	КонецЕсли;
	СоздатьОднуРеализациюНаСервере();
КонецПроцедуры


&НаСервере
Функция НайтиЗаказВРегистре_crm_ИсходныеДанныеЗаказов(ЗаказКлиентаСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рег.id КАК id,
		|	рег.site КАК site,
		|	рег.status
		|ИЗ
		|	РегистрСведений.ксп_ИсходныеДанныеЗаказов КАК рег
		|ГДЕ
		|	рег.ЗаказКлиента = &ЗаказКлиента";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиентаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Рез = Новый Структура;
	Рез.Вставить("Успешно", Ложь);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Рез.Вставить("Успешно", Истина);
		Рез.Вставить("id", ВыборкаДетальныеЗаписи.id);
		Рез.Вставить("site", ВыборкаДетальныеЗаписи.site);
		Рез.Вставить("status", ВыборкаДетальныеЗаписи.status);
	КонецЦикла;
	
	Возврат Рез;
                	
КонецФункции

