
#Область ПодключениеОбработкиКБСП

Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();

	ПараметрыРегистрации.Вставить("Вид",ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	ПараметрыРегистрации.Вставить("Версия","1.3");
	//ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование","Обмен с Фулфилмент");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация","Обмен с Фулфилмент");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "3.1.7.306"); // ОБЯЗАТЕЛЬНО!!! //(https://forum.infostart.ru/forum9/topic179193/)
	//ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	
	ТипКоманды = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	ДобавитьКоманду(ПараметрыРегистрации.Команды, "Открыть форму : Обмен с Фулфилмент","СозданиеДвиженийКМФулфилментИнтерактивно",ТипКоманды, Ложь) ;
	
	ТипКоманды = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	ДобавитьКоманду(ПараметрыРегистрации.Команды, "Обмен с Фулфилмент","СозданиеДвиженийКМФулфилментРегламент",ТипКоманды, Ложь) ;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

	НоваяКоманда = ТаблицаКоманд.Добавить() ;
	НоваяКоманда.Представление = Представление ;
	НоваяКоманда.Идентификатор = Идентификатор ;
	НоваяКоманда.Использование = Использование ;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение ;
	НоваяКоманда.Модификатор = Модификатор ;
КонецПроцедуры

// Интерфейс для запуска логики обработки.
Процедура ВыполнитьКоманду(ИмяКоманды, ПараметрыВыполнения) Экспорт
	
	Если ИмяКоманды = "СозданиеДвиженийКМФулфилментРегламент" Тогда
		ВыполнитьСозданиеДокументовДвиженияКМ();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 	






// Точка входа
//
// Параметры:
//	НастройкиПараметр  	- ПВХ ссылка КСП_НастройкиФулфилмент - 
//
Процедура ВыполнитьСозданиеДокументовДвиженияКМ(Знач НастройкиПараметр = Неопределено) Экспорт
	
	Если НастройкиПараметр = Неопределено Тогда
		НастройкиПараметр = Константы.ксп_АктивныеНастройкиОбменаФулфилмент.Получить();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено( НастройкиПараметр )Тогда
		ВызватьИсключение "Обмен с фулфилментом не выполнен, т.к. не заполнена константа <Активные настройки обмена с Фулфилментом>";
	КонецЕсли;
	
	ВыводитьСообщения = Ложь;//иначе слишком долго приходится ждать вывода после завершения импорта
	ОбменСФулфилментСервер.ЗагрузкаДанныхКМ(ВыводитьСообщения, НастройкиПараметр);
	
	
КонецПроцедуры


