

&НаСервере
Функция ЗагрузитьИзJsonНаСервере()     
	ИдВызова = Вычислить("мис_ЛоггерСервер.СоздатьИдВызова(, ""Импорт регистра нак ТоварыПереданные из УПП"", ТекущаяДатаСеанса(),"""", Неопределено, Неопределено)");
	
	обк = РеквизитФормыВЗначение("Объект");
	
	обк.сетИдВызова(ИдВызова);
	рез = обк.ЗагрузитьИзJsonНаСервере(JsonText);
	СсылочныйТип = Рез.Документ_;
    Возврат Рез;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	Рез = ЗагрузитьИзJsonНаСервере();
	
	
	Сообщить(НСтр("ru = '"+строка(Рез.Документ_)+"'"), СтатусСообщения.БезСтатуса);
	
	НеНайденнаяНоменклатураМассив = Рез.НеНайденнаяНоменклатураМассив;
	Если НеНайденнаяНоменклатураМассив.количество() > 0 Тогда
		тДок = Новый ТекстовыйДокумент;
		Для каждого эл Из НеНайденнаяНоменклатураМассив Цикл
			тДок.ДобавитьСтроку(эл);
		КонецЦикла;
		тДок.Показать("Ненайденная в ЕРП номенклатура");
	КонецЕсли;     
	
	Выполнить("мис_ЛоггерКлиент.ОткрытьОтчетПоЛогу(ИдВызова, Ложь, Неопределено)");
	
КонецПроцедуры

