&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
		тДок = ЗагрузитьИзJsonНаСервере();     
	
		
	//Сарычев
	Если тДок = Неопределено Тогда  
		Сообщить(НСтр("ru = '"+строка("Возможно, загрузка НЕ выполнена!")+"'"), СтатусСообщения.БезСтатуса);		
		//Возврат; 
	Иначе
		Сообщить(НСтр("ru = '"+строка("Загрузка выполнена!")+"'"), СтатусСообщения.БезСтатуса);		
	КонецЕсли;	
	
	Если ТипЗнч(тДок) = Тип("ТекстовыйДокумент") Тогда
		тДок.Показать("Ненайденная в ЕРП номенклатура");
	КонецЕсли;
	//---
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьИзJsonНаСервере()        
	
	ИдВызоваРодитель=Неопределено;
	Наименование = "Импорт Установка цен из УПП интерактивный "+строка(ТекущаяДатаСеанса());
	ВремяВызова = ТекущаяДатаСеанса();
	МодульПроцедура="";
	ПараметрыВызова=Неопределено;
	Задание = Неопределено;
	
	ИдВызова = мис_логгерСервер.СоздатьИдВызова(ИдВызоваРодитель, Наименование, ВремяВызова,
		МодульПроцедура, ПараметрыВызова, Задание);
	
	Об = РеквизитФормыВЗначение("Объект");
	об.сетИдВызова(ИдВызова);
	СтруктураОтвета = Об.ЗагрузитьИзJsonНаСервере(JsonText);

	//Сарычев
	Если СтруктураОтвета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	
   	СсылочныйТип = СтруктураОтвета.УстановкаЦенНоменклатуры.Ссылка;
	//---
	
	ТЗДокументов.Очистить();
	
	Если ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда  
		Если СтруктураОтвета.Свойство("УстановкаЦенНоменклатуры") Тогда  
			// схема 1
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.УстановкаЦенНоменклатуры;
		Иначе
			Сообщить("Не тот документ");
			Возврат Неопределено;
		КонецЕсли;    
		
		Если СтруктураОтвета.Свойство ("НеНайденнаяНоменклатураМассив") Тогда   
			НеНайденнаяНоменклатураМассив = СтруктураОтвета.НеНайденнаяНоменклатураМассив;
			Если НеНайденнаяНоменклатураМассив.Количество() > 0 Тогда
				Сообщить("Не найдена Номенклатура: " + НеНайденнаяНоменклатураМассив.Количество());
				тДок = Новый ТекстовыйДокумент;
				Для каждого эл Из НеНайденнаяНоменклатураМассив Цикл
					тДок.ДобавитьСтроку(эл);
				КонецЦикла;
				
				Возврат тДок; 
			Иначе 	
				Сообщить("Ненайденой Номенклатуры не было");
				Возврат 0;				
			КонецЕсли; 
		Иначе
			Сообщить("Ненайденой Номенклатуры не было");
			Возврат 0;
		КонецЕсли;
		
	КонецЕсли;  
	
    Возврат СтруктураОтвета;
КонецФункции

&НаКлиенте
Процедура ОтчетПоЛогу(Команда)
	ТолькоОшибки = Ложь;
	мис_ЛоггерКлиент.ОткрытьОтчетПоЛогу(ИдВызова, ТолькоОшибки, ЭтаФорма);
КонецПроцедуры


