&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	
	идВызова = мис_ЛоггерСервер.СоздатьИдВызова(Неопределено, "Импорт перемещения товаров. Интерактивно", ТекущаяДатаСеанса(),"", Неопределено, Неопределено);
	Об = РеквизитФормыВЗначение("Объект");
	об.сетИдВызова(ИдВызова);
	Результат = Об.ЗагрузитьИзJsonНаСервере(JsonText);
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
	
		НайденноеЗначение = "";
		
		Если Результат.Свойство("Перемещение", НайденноеЗначение) Тогда
			СсылочныйТип = НайденноеЗначение;
		КонецЕсли;
		
		Если Результат.Свойство("ПО", НайденноеЗначение) Тогда
			СсылочныйТип = НайденноеЗначение;
		КонецЕсли;
		
		Если Результат.Свойство("ЗаказНаВнутреннееПотреблениеСсылка", НайденноеЗначение) Тогда
			СсылочныйТип = НайденноеЗначение;
		КонецЕсли;
		
	Иначе
		
		СсылочныйТип = Неопределено;
		
	КонецЕсли;
	
	
	Возврат СсылочныйТип;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	
	Ссылка = ЗагрузитьИзJsonНаСервере();
	Сообщить(НСтр("ru = '"+строка(Ссылка)+"'"), СтатусСообщения.БезСтатуса);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Версия.Заголовок = "Версия :"+Строка(
		РеквизитФормыВЗначение("Объект").СведенияОВнешнейОбработке().Версия
	);
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьЛог(Команда)
	мис_ЛоггерКлиент.ОткрытьОтчетПоЛогу(ИдВызова, Ложь, ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура ИдВызоваНажатие(Элемент, СтандартнаяОбработка)
	//ПоказатьЗначение(,идвызова);
КонецПроцедуры

