&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	Рез = ЗагрузитьИзJsonНаСервере();
	Сообщить(НСтр("ru = '" + "Записано записей в спр-к: (в т.ч. новых) " + строка(Рез) + "'"), СтатусСообщения.БезСтатуса);
КонецПроцедуры

&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	Рез = РеквизитФормыВЗначение("Объект").ЗагрузитьИзJsonНаСервере(JsonText);
    Возврат Рез;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	JsonText = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Пример").ПолучитьТекст();
КонецПроцедуры

&НаСервереБезКонтекста
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция КодНом(Ном)
		
	Возврат Ном.Код;
	
КонецФункции

