
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры





&НаСервере
Процедура ТестПрочитатьПервые10ШКНаСервере()
	
	
	обк = РеквизитФормыВЗначение("Объект"); 
	ИдВызова = мис_логгерСервер.СоздатьИдВызова(Неопределено, "ТЕСТ - ПЕРВЫЕ 10 - ПРОЧИТАТЬ ШК из УПП через АДО", ТекущаяДата(),"", Неопределено, Неопределено);
	обк.ТестПрочитатьПервые10ШКНаСервере(ИдВызова, Сервер,ИмяБазы,
		Пользователь,Пароль,РазмерПакета,Обновлять,МестоЗапуска,Драйвер);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестПрочитатьПервые10ШК(Команда)
	ТестПрочитатьПервые10ШКНаСервере();
КонецПроцедуры  






&НаСервере
Процедура ЗагрузитьВсеНаСервере()
	обк = РеквизитФормыВЗначение("Объект"); 
	ИдВызова = мис_логгерСервер.СоздатьИдВызова(Неопределено, "Импорт ШК из УПП через АДО", ТекущаяДата(),"", Неопределено, Неопределено);
	обк.ЗагрузитьВсеНаСервере(ИдВызова, Сервер,ИмяБазы,
		Пользователь,Пароль,РазмерПакета,Обновлять,МестоЗапуска,Драйвер);
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьВсе(Команда)

	ЗагрузитьВсеНаСервере();
	мис_логгерКлиент.ОткрытьОтчетПоЛогу(ИдВызова, Ложь, ЭтаФорма);
	
КонецПроцедуры      





&НаСервере
Процедура Тест01_ОбработатьОдинПакетНаСервере()
	ИдВызова = мис_логгерСервер.СоздатьИдВызова(Неопределено, "Тест01_ОбработатьОдинПакетНаСервере", ТекущаяДата(),"", Неопределено, Неопределено);
	обк = РеквизитФормыВЗначение("Объект"); 
	обк.Тест01_ОбработатьОдинПакет(ИдВызова);
КонецПроцедуры

&НаКлиенте
Процедура Тест01_ОбработатьОдинПакет(Команда)
	Тест01_ОбработатьОдинПакетНаСервере();
	мис_логгерКлиент.ОткрытьОтчетПоЛогу(ИдВызова, Ложь, ЭтаФорма);
КонецПроцедуры

