
&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)   
	
	Адрес = "";
	Если ИмяФАйла <> "" Тогда        
		Колбэк = Новый ОписаниеОповещения("НачатьИмпорт", ЭтотОбъект);
		НачатьПомещениеФайлаНаСервер(Колбэк,,,Адрес,ИмяФайла,ЭтаФорма.УникальныйИдентификатор);
		
	Иначе 
		
		ЗагрузитьИзJsonНаСервере();
		
	КонецЕсли;
	
	
	
КонецПроцедуры   

&НаКлиенте
Процедура НачатьИмпорт(ОписаниеПомещенногоФайла, Доп)  Экспорт 
	

 
Если ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
	Возврат;
КонецЕсли;    

//ОписаниеПомещенногоФайла.Адрес
//ОписаниеПомещенногоФайла.СсылкаНаФайл
//	ИдентификаторФайла (FileID)
//	Имя (Name)
//	Расширение (Extension)
//	Файл (File)

	
	ЗагрузитьИзJsonНаСервереИзФайла(ОписаниеПомещенногоФайла.Адрес);
	
КонецПроцедуры   

&НаСервере
Процедура ЗагрузитьИзJsonНаСервереИзФайла(Адрес)

	Ссылка = РеквизитФормыВЗначение("Объект").ЗагрузитьИзJsonНаСервереИзФайла(Адрес, ВидНоменклатуры);
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		Сообщить(НСтр("ru = '"+строка(ссылка)+КодНом(Ссылка)+"'"), СтатусСообщения.БезСтатуса);
	КонецЕсли;
	

КонецПроцедуры


&НаСервере
Процедура ЗагрузитьИзJsonНаСервере()

	Ссылка = РеквизитФормыВЗначение("Объект").ЗагрузитьИзJsonНаСервере(JsonText, ВидНоменклатуры);
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		Сообщить(НСтр("ru = '"+строка(ссылка)+КодНом(Ссылка)+"'"), СтатусСообщения.БезСтатуса);
	КонецЕсли;
	

КонецПроцедуры

&НаСервереБезКонтекста
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция КодНом(Ном)
		
	Возврат Ном.Код;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьГуид(Команда)
	  Гуид = сред(БитаяСсылка,25,8) + "-" +
  сред(БитаяСсылка,21,4) + "-" +
  сред(БитаяСсылка,17,4) + "-" +
  сред(БитаяСсылка,1,4) + "-" +
  сред(БитаяСсылка,5,12);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИмяФайла = "C:\1C\НоменклатураИзУПП.json";
КонецПроцедуры


