
&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	
	ЗагрузитьИзJsonНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзJsonНаСервере()

	Ссылка = РеквизитФормыВЗначение("Объект").ЗагрузитьИзJsonНаСервере(JsonText);
	Сообщить(НСтр("ru = '"+строка(ссылка)+КодНом(Ссылка)+"'"), СтатусСообщения.БезСтатуса);

КонецПроцедуры

&НаСервереБезКонтекста
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция КодНом(Ном)
		
	Возврат Ном.Код;
	
КонецФункции
