
&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)   
	
		
	Если ИмяКаталога <> "" Тогда        
		Колбэк = Новый ОписаниеОповещения("НачатьИмпорт", ЭтотОбъект);
		
		ОписанияПередаваемыхФайлов = Новый Массив;             
		
		массивФайлов = НайтиФАйлы(ИмяКаталога, "*.json", Ложь);
		Для каждого одинФайл Из массивФайлов Цикл
			ОдноОписание = Новый ОписаниеПередаваемогоФайла(одинФайл.ПолноеИмя);
			ОписанияПередаваемыхФайлов.Добавить(ОдноОписание);
		КонецЦикла;
		
		
		НачатьПомещениеФайловНаСервер(Колбэк,,,ОписанияПередаваемыхФайлов,ЭтаФорма.УникальныйИдентификатор);
		
	
	Иначе 
		
		ЗагрузитьИзJsonНаСервере();
		
		
	КонецЕсли;

	
	
КонецПроцедуры   

&НаКлиенте
Процедура НачатьИмпорт(МассивФайлов, Доп)  Экспорт 
	

	 
	Если МассивФайлов = Неопределено Тогда
		Возврат;
	КонецЕсли;    

 

//ОписаниеПомещенногоФайла.Адрес
//ОписаниеПомещенногоФайла.СсылкаНаФайл
//	ИдентификаторФайла (FileID)
//	Имя (Name)
//	Расширение (Extension)
//	Файл (File)

МассивАдресов = Новый Массив;
	Для каждого ОписаниеПомещенногоФайла Из МассивФайлов Цикл
		
		
		МассивАдресов.Добавить(ОписаниеПомещенногоФайла.Адрес);
	КонецЦикла;        
	
	ЗагрузитьИзJsonНаСервереИзКаталога(МассивАдресов);
	
КонецПроцедуры   

&НаСервере
Процедура ЗагрузитьИзJsonНаСервереИзКаталога(МассивАдресов)
	
	ПараметрыВызова = Неопределено;
	идВызова = мис_ЛоггерСервер.СоздатьИдВызова(Неопределено, "Импорт номенклатуры. Интерактивный", ТекущаяДатаСеанса(),"Плагин", , Неопределено);
	обк=РеквизитФормыВЗначение("Объект");	
	Попытка
		обк.сетИдВызова(идВызова);
	Исключение
	    //Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	КонецПопытки;
	

	Для каждого Адрес Из МассивАдресов Цикл
		обк.ЗагрузитьИзJsonНаСервереИзФайла(Адрес, ВидНоменклатуры, Обновлять);
	КонецЦикла;
	
	

КонецПроцедуры




&НаСервере
Процедура ЗагрузитьИзJsonНаСервере()

	Ссылка = РеквизитФормыВЗначение("Объект").ЗагрузитьИзJsonНаСервере(JsonText, ВидНоменклатуры);
	

КонецПроцедуры

&НаСервереБезКонтекста
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция КодНом(Ном)
		
	Возврат Ном.Код;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьГуид(Команда)
	  Гуид = сред(БитаяСсылка,25,8) + "-" +
  сред(БитаяСсылка,21,4) + "-" +
  сред(БитаяСсылка,17,4) + "-" +
  сред(БитаяСсылка,1,4) + "-" +
  сред(БитаяСсылка,5,12);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ИмяФайла = "C:\1C\НоменклатураИзУПП.json";
	ИмяКаталога = "c:\1c\УПП_Выгрузка_Номенклатура\";
КонецПроцедуры


