&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	обк = РеквизитФормыВЗначение("Объект");
	обк.СобиратьНенайденнуюНоменклатуру = Истина;
	СтруктураОтвета = обк.ЗагрузитьИзJsonНаСервере(JsonText);
	
	
	
	ТЗДокументов.Очистить();
	
	Если ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда
		Если СтруктураОтвета.Свойство ("ЗаказНаПеремещение") Тогда 
			// схема 1
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.ЗаказНаПеремещение;
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.РО;
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.Перемещение;
		ИначеЕсли СтруктураОтвета.Свойство ("ЗаказКлиента") Тогда 
			//Схема 2
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.ЗаказКлиента;
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.РО;
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.РеализацияТоваровУслуг;
		КонецЕсли;    
		
		
		Если СтруктураОтвета.Свойство ("НеНайденнаяНоменклатураМассив") Тогда 
			НеНайденнаяНоменклатураМассив = СтруктураОтвета.НеНайденнаяНоменклатураМассив;
			Если НеНайденнаяНоменклатураМассив.количество() > 0 Тогда
				тДок = Новый ТекстовыйДокумент;
				Для каждого эл Из НеНайденнаяНоменклатураМассив Цикл
					тДок.ДобавитьСтроку(эл);
				КонецЦикла;
				тДок.Показать("Ненайденная в ЕРП номенклатура");
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЕсли;  
	
	

КонецФункции


&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	ЗагрузитьИзJsonНаСервере();
	Сообщить(НСтр("ru = '"+строка("Загрузка выполнена! Созданные документы помещены в таблицу на форме.")+"'"), СтатусСообщения.БезСтатуса);
КонецПроцедуры

&НаСервере
Процедура Тест_Схема_1_ПеремещениеНаФулфилментНаСервере()
	СтруктураОтвета = РеквизитФормыВЗначение("Объект").Тест_Схема_1_ПеремещениеНаФулфилмент(JsonText);
	ТЗДокументов.Очистить();
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.ЗаказНаПеремещение;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.РО;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.Перемещение;
КонецПроцедуры

&НаКлиенте
Процедура Тест_Схема_1_ПеремещениеНаФулфилмент(Команда)
	Тест_Схема_1_ПеремещениеНаФулфилментНаСервере();
КонецПроцедуры

&НаСервере
Процедура Тест_Схема_2_ПередачаНаКомиссиюНаСервере()
	СтруктураОтвета = РеквизитФормыВЗначение("Объект").Тест_Схема_2_ПередачаНаКомиссию(JsonText);
	ТЗДокументов.Очистить();
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.ЗаказКлиента;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.РО;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.РеализацияТоваровУслуг;
КонецПроцедуры

&НаКлиенте
Процедура Тест_Схема_2_ПередачаНаКомиссию(Команда)
	Тест_Схема_2_ПередачаНаКомиссиюНаСервере();
КонецПроцедуры






