

&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	СтруктураОтвета = РеквизитФормыВЗначение("Объект").ЗагрузитьИзJsonНаСервере(JsonText);
	ТЗДокументов.Очистить();
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.ЗаказНаПеремещение;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.РО;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.Перемещение;


КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	ЗагрузитьИзJsonНаСервере();
	Сообщить(НСтр("ru = '"+строка("Загрузка выполнена! Созданные документы помещены в таблицу на форме.")+"'"), СтатусСообщения.БезСтатуса);
КонецПроцедуры

&НаСервере
Процедура Тест_Схема_1_ПеремещениеНаФулфилментНаСервере()
	СтруктураОтвета = РеквизитФормыВЗначение("Объект").Тест_Схема_1_ПеремещениеНаФулфилмент(JsonText);
	ТЗДокументов.Очистить();
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.ЗаказНаПеремещение;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.РО;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.Перемещение;
КонецПроцедуры

&НаКлиенте
Процедура Тест_Схема_1_ПеремещениеНаФулфилмент(Команда)
	Тест_Схема_1_ПеремещениеНаФулфилментНаСервере();
КонецПроцедуры






