// ЕНС. Заполнение происходит в форме, без записи объекта. Включается флаг Модифицированность у формы.

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполнитьКоманду("", Объект.Документ);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив)Экспорт
	
	ВидЗапасов = ВидЗапасов(ВладелецФормы.Объект.Организация);
	
	Для каждого стрк Из ВладелецФормы.Объект.Товары Цикл
		стрк.ВидЗапасов = ВидЗапасов;
	КонецЦикла;
	
    ВладелецФормы.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
функция ВидЗапасов(Организация)
   
	ВидЗапасов = ксп_ИмпортСлужебный.НайтиВидЗапасовСобственныйТовар(Организация);

	Возврат ВидЗапасов;
	
КонецФункции

