&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	тДок = ЗагрузитьИзJsonНаСервере();   
	
	//Сарычев
	Если тДок = Неопределено Тогда  
		Сообщить(НСтр("ru = '"+строка("Загрузка НЕ выполнена! Ошибка в JSON.")+"'"), СтатусСообщения.БезСтатуса);		
		Возврат; 
	ИначеЕсли тДок = 0 Тогда
		
	КонецЕсли;	
	//---
	
	Сообщить(НСтр("ru = '"+строка("Загрузка выполнена! Созданные документы помещены в таблицу на форме.")+"'"), СтатусСообщения.БезСтатуса);
	Если ТипЗнч(тДок) = Тип("ТекстовыйДокумент") Тогда
		тДок.Показать("Ненайденная в ЕРП номенклатура");
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	обк = РеквизитФормыВЗначение("Объект");
	обк.СобиратьНеНайденнуюНоменклатуру = Истина;
	СтруктураОтвета = обк.ЗагрузитьИзJsonНаСервере(JsonText);
	
	//Сарычев
	Если СтруктураОтвета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	
	//---
	
	ТЗДокументов.Очистить();
	
	Если ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда  
		Если СтруктураОтвета.Свойство("ЗаказНаПеремещение") Тогда  
			Сообщить("Заказ На Перемещение");
			// схема 1
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.ЗаказНаПеремещение;
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.РО;  //Расходный ордер
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.Перемещение;
			//Сообщить("Заказ На Перемещение - подготовлен");			
		ИначеЕсли СтруктураОтвета.Свойство("ЗаказКлиента") Тогда 
			Сообщить("Реализация по Заказу Клиента ");
			//Схема 2
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.ЗаказКлиента;
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.РО;    //Расходный ордер
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.РеализацияТоваровУслуг;   
			//Сообщить("Реализация - подготовлена");
		//ИначеЕсли СтруктураОтвета.Свойство("РО") Тогда 
		//	Сообщить("Реализация - Расходный ордер");
		//	//Схема 2
		//	НовСтр = ТЗДокументов.Добавить();
		//	НовСтр.Документ = СтруктураОтвета.ЗаказКлиента;
		//	НовСтр = ТЗДокументов.Добавить();
		//	НовСтр.Документ = СтруктураОтвета.РО;    //Расходный ордер
		//	НовСтр = ТЗДокументов.Добавить();
		//	НовСтр.Документ = СтруктураОтвета.РеализацияТоваровУслуг;   
			//Сообщить("Расходный ордер - подготовлен");
		Иначе
			Сообщить("Не тот документ");
			Возврат Неопределено;
		КонецЕсли;    
		
		Если СтруктураОтвета.Свойство ("НеНайденнаяНоменклатураМассив") Тогда   
			НеНайденнаяНоменклатураМассив = СтруктураОтвета.НеНайденнаяНоменклатураМассив;
			Если НеНайденнаяНоменклатураМассив.Количество() > 0 Тогда
				Сообщить("Не найдена Номенклатура");
				тДок = Новый ТекстовыйДокумент;
				Для каждого эл Из НеНайденнаяНоменклатураМассив Цикл
					тДок.ДобавитьСтроку(эл);
				КонецЦикла;
				
				Возврат тДок;     
			Иначе 	
				Сообщить("Ненайденой Номенклатуры не было");
				Возврат 0;				
			КонецЕсли; 
		Иначе
			Сообщить("Ненайденой Номенклатуры не было");
			Возврат 0;
		КонецЕсли;
		
	КонецЕсли;  
	
КонецФункции


&НаКлиенте
Процедура Тест_Схема_1_ПеремещениеНаФулфилмент(Команда)
	Тест_Схема_1_ПеремещениеНаФулфилментНаСервере();
КонецПроцедуры
&НаСервере
Процедура Тест_Схема_1_ПеремещениеНаФулфилментНаСервере()
	СтруктураОтвета = РеквизитФормыВЗначение("Объект").Тест_Схема_1_ПеремещениеНаФулфилмент(JsonText);
	ТЗДокументов.Очистить();
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.ЗаказНаПеремещение;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.РО;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.Перемещение;
КонецПроцедуры

&НаКлиенте
Процедура Тест_Схема_2_ПередачаНаКомиссию(Команда)
	Тест_Схема_2_ПередачаНаКомиссиюНаСервере();
КонецПроцедуры
&НаСервере
Процедура Тест_Схема_2_ПередачаНаКомиссиюНаСервере()
	СтруктураОтвета = РеквизитФормыВЗначение("Объект").Тест_Схема_2_ПередачаНаКомиссию(JsonText);
	ТЗДокументов.Очистить();
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.ЗаказКлиента;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.РО;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.РеализацияТоваровУслуг;
КонецПроцедуры






                          
