
Перем мВнешняяСистема;
Перем ИмяСобытияЖР;

#Область ПодключениеОбработкиКБСП

Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();

	ПараметрыРегистрации.Вставить("Вид",ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	ПараметрыРегистрации.Вставить("Версия","1.5");
	//ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование","Плагин_RabbitMQ_импорт_из_УПП_РегистрСведений_Штрихкоды");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация","Плагин_RabbitMQ_импорт_из_УПП_РегистрСведений_Штрихкоды");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "3.1.5.180");
	//ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	
	ТипКоманды = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	ДобавитьКоманду(ПараметрыРегистрации.Команды, 
		"Открыть форму : Плагин_RabbitMQ_импорт_из_УПП_РегистрСведений_Штрихкоды",
		"Форма_Плагин_RabbitMQ_импорт_из_УПП_РегистрСведений_Штрихкоды",
		ТипКоманды, 
		Ложь) ;
	
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

	//ТаблицаКоманд.Колонки.Добавить("Представление", РеквизитыТабличнойЧасти.Представление.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Идентификатор", РеквизитыТабличнойЧасти.Идентификатор.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	//ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", РеквизитыТабличнойЧасти.ПоказыватьОповещение.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Модификатор", РеквизитыТабличнойЧасти.Модификатор.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Скрыть",      РеквизитыТабличнойЧасти.Скрыть.Тип);
	//ТаблицаКоманд.Колонки.Добавить("ЗаменяемыеКоманды", РеквизитыТабличнойЧасти.ЗаменяемыеКоманды.Тип);
	
//           ** Использование - Строка - тип команды:
//               "ВызовКлиентскогоМетода",
//               "ВызовСерверногоМетода",
//               "ЗаполнениеФормы",
//               "ОткрытиеФормы" или
//               "СценарийВБезопасномРежиме".
//               Для получения типов команд рекомендуется использовать функции
//               ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКоманды<ИмяТипа>.
//               В комментариях к этим функциям также даны шаблоны процедур-обработчиков команд.

	НоваяКоманда = ТаблицаКоманд.Добавить() ;
	НоваяКоманда.Представление = Представление ;
	НоваяКоманда.Идентификатор = Идентификатор ;
	НоваяКоманда.Использование = Использование ;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение ;
	НоваяКоманда.Модификатор = Модификатор ;
КонецПроцедуры


#КонецОбласти 	


#Область Загрузка

Функция ЗагрузитьОбъект(СтруктураОбъекта, jsonText = "") Экспорт
	
	Если НЕ НРег(СтруктураОбъекта.type) = НРег("РегистрСведений.Штрихкоды") Тогда
		Возврат Неопределено;
	КонецЕсли;

	

	id 	= СтруктураОбъекта.identification;
	деф = СтруктураОбъекта.definition;

	//------------------------------------- Заполнение реквизитов
	Попытка			    
		
		НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Штрихкод.Установить(деф.Штрихкод);
		
		//ЕНС. пока не перезаписываем существующие
		НаборЗаписей.Прочитать();                 
		Если НаборЗаписей.количество() > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		НовСтр = НаборЗаписей.Добавить();
		
		НовСтр.Штрихкод = деф.Штрихкод;
		НовСтр.Номенклатура = ксп_импортСлужебный.найтиНоменклатуру(деф.Владелец);
		НовСтр.Характеристика = ксп_импортСлужебный.НайтиХарактеристику(деф.ХарактеристикаНоменклатуры);
		НовСтр.Упаковка = ксп_импортСлужебный.НайтиЕдиницуИзмерения(деф.ЕдиницаИзмерения);
		
		НаборЗаписей.Записать();
		
		
	Исключение
		т=ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,id.Код,
			"Штрихкод не загружен! Ошибка в процессе загрузки: <"+id.Код+">. Подробности: "+т);
	КонецПопытки;	
			
КонецФункции

#КонецОбласти 	


#Область Тестирование

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ЗагрузитьИзJsonНаСервере(Json) export


	мЧтениеJSON = Новый ЧтениеJSON;

	
	мЧтениеJSON.УстановитьСтроку(Json);
		
	СтруктураОбъекта = ПрочитатьJSON(мЧтениеJSON,,,,"ФункцияВосстановленияJSON",ЭтотОбъект);//структура

	
	
	Возврат ЗагрузитьОбъект(СтруктураОбъекта, json);
	
КонецФункции

Функция ФункцияВосстановленияJSON(Свойство, Значение, ДопПараметры) Экспорт
	
	Если Свойство = "Date"Тогда
		Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
	КонецЕсли;
	Если Свойство = "Период"Тогда
		Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
	КонецЕсли;
	Если Свойство = "Сумма" Тогда
		Возврат XMLЗначение(Тип("Число"),Значение);
	КонецЕсли;
	Если Свойство = "Валюта" Тогда
		Возврат Справочники.Валюты.НайтиПоКоду(Значение);
	КонецЕсли;
	
КонецФункции


#КонецОбласти 	

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция МассивРеквизитовШапкиДляПроверки() Экспорт
	
	мРеквизиты = Новый Массив;
	//мРеквизиты.Добавить("Склад");
	//мРеквизиты.Добавить("Организация");
	Возврат мРеквизиты;
	
КонецФункции


Процедура ЗагрузитьНаСервереИзМассиваАдресов_CSV(МассивАдресов)  Экспорт
    

	сч_обработано = 0;       
	сч_ошибок = 0;
	
	ЧтениеТекста = Новый ЧтениеТекста;
	
	НаборЗаписейШК = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписейДС = РегистрыСведений.КСП_ШтрихкодыПоУмолчанию.СоздатьНаборЗаписей();
	
	Для каждого Адрес Из МассивАдресов Цикл

		ДвоичныеДанные  = ПолучитьИзВременногоХранилища(Адрес);
		Если 1=0 Тогда
			ДвоичныеДанные = новый ДвоичныеДанные("");
		КонецЕсли;                                
		
		ИмяФайла = ПолучитьИмяВременногоФайла("csv");
		ДвоичныеДанные.Записать(ИмяФайла);
		
		
		ЧтениеТекста.Открыть(ИмяФайла);
		
		
		ТипСтрока = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(200));
		ТипГУИД = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36));
		Тип1 = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1));
		

		ТЗРекордсет = Новый ТаблицаЗначений;

		ТЗРекордсет.Колонки.Добавить("Штрихкод", ТипСтрока);
		ТЗРекордсет.Колонки.Добавить("Номенклатура", ТипГУИД);
		ТЗРекордсет.Колонки.Добавить("Характеристика", ТипГУИД);
		ТЗРекордсет.Колонки.Добавить("ПоУмолчанию", Тип1);
		
		ТекСтрк = ЧтениеТекста.ПрочитатьСтроку();
		Пока ТекСтрк <> Неопределено Цикл
			
			//Загрузить_ШК_из_CSV(ТекСтрк, НаборЗаписейШК, НаборЗаписейДС);
			
			
			Поля = СтрРазделить(ТекСтрк, "|", Истина);	
			                                               
     		новСтр = ТЗРекордсет.Добавить();
			новСтр.Штрихкод = Поля[0];
			новСтр.Номенклатура = Поля[1];
			новСтр.Характеристика = Поля[2];
			новСтр.ПоУмолчанию = Поля[3];    
			
			
			
			ТекСтрк = ЧтениеТекста.ПрочитатьСтроку();			
		КонецЦикла;

		Загрузить_ШК_из_CSV_Запрос_к_ТЗ(ТЗРекордсет, НаборЗаписейШК, НаборЗаписейДС);
		
	КонецЦикла;
	
	
	
КонецПроцедуры



// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура Загрузить_ШК_из_CSV(ТекСтрк, НаборЗаписейШК, НаборЗаписейДС)

	
	Поля = СтрРазделить(ТекСтрк, "|", Истина);	
	                                               

	ШК = Поля[0];
	Номенклатура = Поля[1];
	Характ = Поля[2];
	ПоУмолчанию = Поля[3];                  
	
		
		НаборЗаписейШК.Отбор.Штрихкод.Установить(ШК);
		
		////ЕНС. пока не перезаписываем существующие
		НаборЗаписейШК.Прочитать();                 
		НаборЗаписейШК.очистить();
		//Если НаборЗаписей.количество() > 0 Тогда
		//	Возврат Неопределено;
		//КонецЕсли;
		
		НовСтр = НаборЗаписейШК.Добавить();
		
		НовСтр.Штрихкод = ШК;               
		Если Номенклатура <> "" Тогда        
			Попытка
				уид = Новый УникальныйИдентификатор(Номенклатура);
				НовСтр.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(уид);
			Исключение
			    Возврат;
			КонецПопытки;
		КонецЕсли;
		Если Характ <> "" Тогда
			Попытка
				уид = Новый УникальныйИдентификатор(Характ);
				НовСтр.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(уид);
			Исключение
			    Возврат;
			КонецПопытки;
		КонецЕсли;

		Если ТипЗнч(НовСтр.Номенклатура) = Тип("СправочникСсылка.Номенклатура") и ЗначениеЗаполнено(НовСтр.Номенклатура.ВерсияДанных) Тогда
			НовСтр.Упаковка = НовСтр.Номенклатура.ЕдиницаИзмерения;
		КонецЕсли;
		
		
		
		НаборЗаписейШК.Записать();                   
		
		
		
		//-------------------------
		
		
		НаборЗаписейДС.Отбор.Штрихкод.Установить(ШК);
		
		НаборЗаписейДС.Прочитать();                 
		НаборЗаписейДС.очистить();
		
		НовСтр = НаборЗаписейДС.Добавить();
		
		НовСтр.Штрихкод = ШК;
		НовСтр.ПоУмолчанию = ?(ПоУмолчанию = "1", Истина, Ложь);
		
		
		НаборЗаписейДС.Записать();
		
		
												   
КонецПроцедуры


Процедура Загрузить_ШК_из_CSV_Запрос_к_ТЗ(ТЗРекордсет, НаборЗаписейШК, НаборЗаписейДС)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Штрихкод КАК Штрихкод,
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.Характеристика КАК Характеристика,
		|	ТЗ.ПоУмолчанию КАК ПоУмолчанию
		|ПОМЕСТИТЬ ВТ1
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ1.Штрихкод КАК Штрихкод,
		|	ВТ1.Номенклатура КАК Номенклатура,
		|	ВТ1.Характеристика КАК Характеристика,
		|	ВТ1.ПоУмолчанию КАК ПоУмолчанию
		|ИЗ
		|	ВТ1 КАК ВТ1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО (ШтрихкодыНоменклатуры.Штрихкод = ВТ1.Штрихкод)
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗРекордсет);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();       //     РезультатЗапроса.выгрузить()
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	
		
		НаборЗаписейШК.Отбор.Штрихкод.Установить(ВыборкаДетальныеЗаписи.Штрихкод);

		НовСтр = НаборЗаписейШК.Добавить();
		
		НовСтр.Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;               
		Если ВыборкаДетальныеЗаписи.Номенклатура <> "" Тогда        
			Попытка
				уид = Новый УникальныйИдентификатор(ВыборкаДетальныеЗаписи.Номенклатура);
				НовСтр.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(уид);
			Исключение
			    Возврат;
			КонецПопытки;
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.Характеристика <> "" Тогда
			Попытка
				уид = Новый УникальныйИдентификатор(ВыборкаДетальныеЗаписи.Характеристика);
				НовСтр.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(уид);
			Исключение
			    Возврат;
			КонецПопытки;
		КонецЕсли;

		Если ТипЗнч(НовСтр.Номенклатура) = Тип("СправочникСсылка.Номенклатура") и ЗначениеЗаполнено(НовСтр.Номенклатура.ВерсияДанных) Тогда
			НовСтр.Упаковка = НовСтр.Номенклатура.ЕдиницаИзмерения;
		КонецЕсли;
		
		
		
		НаборЗаписейШК.Записать(Истина);                   
		НаборЗаписейШК.очистить();
		
		
		//-------------------------
		
		
		НаборЗаписейДС.Отбор.Штрихкод.Установить(ВыборкаДетальныеЗаписи.Штрихкод);

		НовСтр = НаборЗаписейДС.Добавить();
		
		НовСтр.Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;
		НовСтр.ПоУмолчанию = ?(ВыборкаДетальныеЗаписи.ПоУмолчанию = "1", Истина, Ложь);
		
		
		НаборЗаписейДС.Записать();
		НаборЗаписейДС.очистить();
		
	КонецЦикла;
	
												   
КонецПроцедуры



Процедура ЗагрузитьНаСервере_CSV_В_Спр_ШтрихкодыУпаковокТоваров(МассивАдресов)  Экспорт
    

	сч_обработано = 0;       
	сч_ошибок = 0;
	
	ЧтениеТекста = Новый ЧтениеТекста;
	
	Для каждого Адрес Из МассивАдресов Цикл

		ДвоичныеДанные  = ПолучитьИзВременногоХранилища(Адрес);
		Если 1=0 Тогда
			ДвоичныеДанные = новый ДвоичныеДанные("");
		КонецЕсли;                                
		
		ИмяФайла = ПолучитьИмяВременногоФайла("csv");
		ДвоичныеДанные.Записать(ИмяФайла);
		
		
		ЧтениеТекста.Открыть(ИмяФайла);
		
		ТекСтрк = ЧтениеТекста.ПрочитатьСтроку();
		Пока ТекСтрк <> Неопределено Цикл
			
			Загрузить_ШК_из_CSV_В_СПР_ШтрихкодыУпаковокТоваров(ТекСтрк);
			
			ТекСтрк = ЧтениеТекста.ПрочитатьСтроку();			
		КонецЦикла;

	КонецЦикла;
	
	
	
КонецПроцедуры



// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура Загрузить_ШК_из_CSV_В_СПР_ШтрихкодыУпаковокТоваров(ТекСтрк)

	
	Поля = СтрРазделить(ТекСтрк, "|", Истина);	
	                                               

	ШК = Поля[0];
	Номенклатура = Поля[1];
	Характ = Поля[2];
	ПоУмолчанию = Поля[3];                  
	
 	Если Номенклатура <> "" Тогда        
		Попытка
			уид = Новый УникальныйИдентификатор(Номенклатура);
			_Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(уид);
		Исключение
		    Возврат;
		КонецПопытки;
	КонецЕсли;
	Если Характ <> "" Тогда
		Попытка
			уид = Новый УникальныйИдентификатор(Характ);
			_Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(уид);
		Исключение
		    Возврат;
		КонецПопытки;
	КонецЕсли;

	Если ТипЗнч(_Номенклатура) = Тип("СправочникСсылка.Номенклатура") и ЗначениеЗаполнено(_Номенклатура.ВерсияДанных) Тогда
		_Упаковка = _Номенклатура.ЕдиницаИзмерения;
	КонецЕсли;
			
	
	КодМаркировки0121 = КонвертироватьВКодМаркировки0121(ШК);
	
	ШтрихкодУпаковки = Справочники.ШтрихкодыУпаковокТоваров
		.НайтиПоРеквизиту("ЗначениеШтрихкода", КодМаркировки0121);
		
	Если Не ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда
			
		ШКОбъект = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();
		ШКОбъект.Номенклатура 			= _Номенклатура;
		ШКОбъект.Характеристика 		= _Характеристика;
		ШКОбъект.ЗначениеШтрихкода 		= КодМаркировки0121;
		ШКОбъект.ТипШтрихкода	 		= Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
		ШКОбъект.ТипУпаковки 			= Перечисления.ТипыУпаковок.МаркированныйТовар;
		ШКОбъект.Упаковка				= _Упаковка;
		ШКОбъект.Записать();      
		
	КонецЕсли;   
											   
КонецПроцедуры

Функция КонвертироватьВКодМаркировки0121(Знач КодМаркировки)
	
	КодМаркировки0121 = КодМаркировки;
	
	Если СтрДлина(КодМаркировки) >= 27 Тогда
		Если СтрНачинаетсяС(КодМаркировки, "(01)") Тогда
			КодМаркировки0121 = КодМаркировки;
		ИначеЕсли СтрНачинаетсяС(КодМаркировки, "01") Тогда
			КодМаркировки0121 = "(01)" + Сред(КодМаркировки, 3, 14) + "(21)" + Сред(КодМаркировки, 19);
		Иначе
			КодМаркировки0121 = "(01)" + Сред(КодМаркировки, 1, 14) + "(21)" + Сред(КодМаркировки, 15);
		КонецЕсли;	
		
   КонецЕсли;
		
	Возврат КодМаркировки0121;

КонецФункции


мВнешняяСистема = "upp";

ИмяСобытияЖР = "Импорт_из_RabbitMQ_УПП";


