
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура СоздатьКлючиДопНастроек() Экспорт
	
	// Розница            
	
	ВнешняяСистема = "retail";
	
	Ключи = Новый Массив;
	
	Ключи.Добавить("ДокументОтчетОРозничныхПродажах_ВидЦены");
	Ключи.Добавить("ДокументОтчетОРозничныхПродажах_НалогообложениеНДС");
	Ключи.Добавить("НаправлениеДеятельностиДляРеализацяТоваровУслугИзРозница");
	Ключи.Добавить("ПорядокРасчетовДляРеализацяТоваровУслугИзРозница");
	Ключи.Добавить("ПриоритетЗаказаНаПеремещение_ИмпортПеремещенияИзРозница");
	Ключи.Добавить("ПриоритетРасходногоОрдераНаТоварыИзРозница");
	Ключи.Добавить("СоглашениеСКлиентамиДляРеализацяТоваровУслугИзРозница");
	Ключи.Добавить("СтатьяДоходовДляОприходованияТоваров");
	Ключи.Добавить("СтатьяРасходовДляСписанияТоваров");

	Для каждого ключ Из Ключи Цикл
		
		НаборЗаписей = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Имя.Установить(Ключ);
		НаборЗаписей.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.количество() = 0 Тогда
			
			НЗ = НаборЗаписей.Добавить();
			НЗ.Имя = Ключ;
			НЗ.ВнешняяСистема = ВнешняяСистема;
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
