&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	Результат = Об.ЗагрузитьИзJsonНаСервере(JsonText);
	Если Результат = Неопределено Тогда
		Возврат Документы.СписаниеНедостачТоваров.ПустаяСсылка();
	Иначе
		Возврат Результат.СписаниеНедостачТоваров;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	
	ДокСсылка = ЗагрузитьИзJsonНаСервере();
	Если ЗначениеЗаполнено(ДокСсылка) Тогда
		Сообщить(НСтр("ru = '"+строка(ДокСсылка)+"'"), СтатусСообщения.БезСтатуса);
	Иначе
		Сообщить(НСтр("ru = 'Документ не загружен!'"), СтатусСообщения.БезСтатуса);
	КонецЕсли;
	
КонецПроцедуры

