

&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	Ссылка = РеквизитФормыВЗначение("Объект").ЗагрузитьИзJsonНаСервере(JsonText);
    Возврат Ссылка;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	Ссылка = ЗагрузитьИзJsonНаСервере();
	//Сообщить(НСтр("ru = '"+строка(ссылка)+КодНом(Ссылка)+"'"), СтатусСообщения.БезСтатуса);
КонецПроцедуры

&НаСервереБезКонтекста
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция КодНом(Ном)
		
	Возврат Ном.Код;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	JsonText = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Пример").ПолучитьТекст();
КонецПроцедуры





&НаКлиенте
Процедура ЗагрузитьИзКаталогаCSV(Команда)
//	ЗагрузитьИзКаталогаCSVНаСервере();


		
		
		
		ОписанияПередаваемыхФайлов = Новый Массив;   
		
		сч = 0;
		массивФайлов = НайтиФайлы(ИмяКаталога, "*.csv", Ложь);   
		
		Если массивФайлов.Количество() = 0 Тогда
			ПоказатьПредупреждение(, "Файлы закончились!");
			Возврат;
			
		КонецЕсли;  
		
		Для каждого одинФайл Из массивФайлов Цикл
			ОдноОписание = Новый ОписаниеПередаваемогоФайла(одинФайл.ПолноеИмя);
			ОписанияПередаваемыхФайлов.Добавить(ОдноОписание);
		КонецЦикла;
		
		Колбэк = Новый ОписаниеОповещения("НачатьИмпорт", ЭтотОбъект);
		НачатьПомещениеФайловНаСервер(Колбэк,,,ОписанияПередаваемыхФайлов,ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

// оповещение из ЗагрузитьИзJson()
&НаКлиенте
Процедура НачатьИмпорт(МассивФайлов, Доп)  Экспорт 
	

	 
	Если МассивФайлов = Неопределено Тогда
		Возврат;
	КонецЕсли;    

 

//ОписаниеПомещенногоФайла.Адрес
//ОписаниеПомещенногоФайла.СсылкаНаФайл
//	ИдентификаторФайла (FileID)
//	Имя (Name)
//	Расширение (Extension)
//	Файл (File)

	МассивАдресов = Новый Массив;
	Для каждого ОписаниеПомещенногоФайла Из МассивФайлов Цикл	
		МассивАдресов.Добавить(ОписаниеПомещенногоФайла.Адрес);
	КонецЦикла;        
	
	ЗагрузитьИзJsonНаСервереИзКаталога(МассивАдресов);
	
	
КонецПроцедуры   

&НаСервере
Процедура ЗагрузитьИзJsonНаСервереИзКаталога(МассивАдресов)

	
	обк=РеквизитФормыВЗначение("Объект");	
	

	//Для каждого Адрес Из МассивАдресов Цикл
	//	обк.ЗагрузитьИзJsonНаСервереИзФайла(Адрес, ВидНоменклатуры, Обновлять);
	//КонецЦикла;
	
	обк.ЗагрузитьНаСервереИзМассиваАдресов_CSV(МассивАдресов);
	

	// Вставить содержимое обработчика.
КонецПроцедуры






&НаСервере
Процедура ЗагрузитьвСправочникШтрихкодыУпаковокНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьвСправочникШтрихкодыУпаковок(Команда)
		ОписанияПередаваемыхФайлов = Новый Массив;   
		
		сч = 0;
		массивФайлов = НайтиФайлы(ИмяКаталога, "*.csv", Ложь);   
		
		Если массивФайлов.Количество() = 0 Тогда
			ПоказатьПредупреждение(, "Файлы закончились!");
			Возврат;
			
		КонецЕсли;  
		
		Для каждого одинФайл Из массивФайлов Цикл
			ОдноОписание = Новый ОписаниеПередаваемогоФайла(одинФайл.ПолноеИмя);
			ОписанияПередаваемыхФайлов.Добавить(ОдноОписание);
		КонецЦикла;
		
		Колбэк = Новый ОписаниеОповещения("НачатьИмпортВСправочник", ЭтотОбъект);
		НачатьПомещениеФайловНаСервер(Колбэк,,,ОписанияПередаваемыхФайлов,ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

// оповещение из ЗагрузитьИзJson()
&НаКлиенте
Процедура НачатьИмпортВСправочник(МассивФайлов, Доп)  Экспорт 
	 
	Если МассивФайлов = Неопределено Тогда
		Возврат;
	КонецЕсли;    

//ОписаниеПомещенногоФайла.Адрес
//ОписаниеПомещенногоФайла.СсылкаНаФайл
//	ИдентификаторФайла (FileID)
//	Имя (Name)
//	Расширение (Extension)
//	Файл (File)

	МассивАдресов = Новый Массив;
	Для каждого ОписаниеПомещенногоФайла Из МассивФайлов Цикл	
		МассивАдресов.Добавить(ОписаниеПомещенногоФайла.Адрес);
	КонецЦикла;        
	
	ЗагрузитьИзJsonНаСервереИзКаталогаВСправочникШК(МассивАдресов);
	
КонецПроцедуры   

&НаСервере
Процедура ЗагрузитьИзJsonНаСервереИзКаталогаВСправочникШК(МассивАдресов)
	
	обк=РеквизитФормыВЗначение("Объект");	

	обк.ЗагрузитьНаСервере_CSV_В_Спр_ШтрихкодыУпаковокТоваров(МассивАдресов);
	
КонецПроцедуры
