
&НаСервере
Процедура СоздатьЗаписиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	складыУПП.Ссылка КАК складУПП,
		|	ВидыДокументовУПП.Ссылка КАК ВидДокумента
		|ИЗ
		|	Справочник.ксп_СкладыУПП КАК складыУПП
		|   left join Справочник.КСП_ВидыДокументовУПП КАК ВидыДокументовУПП
		|	ПО ИСТИНА
		|
		|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	НаборЗаписей = РегистрыСведений.КСП_ОграниченияИмпортаДокументовУПП.СоздатьНаборЗаписей();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей.Отбор.ВидДокументаУПП.Установить(ВыборкаДетальныеЗаписи.ВидДокумента);
		НаборЗаписей.Отбор.СкладУПП.Установить(ВыборкаДетальныеЗаписи.СкладУПП);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		НЗ = НаборЗаписей.Добавить();
		НЗ.ВидДокументаУПП = ВыборкаДетальныеЗаписи.ВидДокумента;
		НЗ.СкладУПП = ВыборкаДетальныеЗаписи.СкладУПП;
		НЗ.РазрешитьИмпорт = Истина;
		НаборЗаписей.Записать();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаписи(Команда)
	СоздатьЗаписиНаСервере(); 
	ПоказатьПредупреждение(,"создание записей завершено!");
КонецПроцедуры
