
Перем мЛоггер;
Перем мИдВызова;
Перем мОбновлять;

#Область ПодключениеОбработкиКБСП

Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();

	ПараметрыРегистрации.Вставить("Вид",ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	ПараметрыРегистрации.Вставить("Версия","1.31.Поток");
	//ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование","Плагин_RabbitMQ_импорт_из_УПП_Справочник_Контрагенты");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация","Плагин_RabbitMQ_импорт_из_УПП_Справочник_Контрагенты");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "3.1.5.180");
	//ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	
	ТипКоманды = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	ДобавитьКоманду(ПараметрыРегистрации.Команды, 
		"Открыть форму : Плагин_RabbitMQ_импорт_из_УПП_Справочник_Контрагенты",
		"Форма_Плагин_RabbitMQ_импорт_из_УПП_Справочник_Контрагенты",
		ТипКоманды, 
		Ложь) ;
	
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

	НоваяКоманда = ТаблицаКоманд.Добавить() ;
	НоваяКоманда.Представление = Представление ;
	НоваяКоманда.Идентификатор = Идентификатор ;
	НоваяКоманда.Использование = Использование ;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение ;
	НоваяКоманда.Модификатор = Модификатор ;
КонецПроцедуры


#КонецОбласти 	

// Описание_метода
//
// Параметры:
//	СтруктураОбъекта	- структура - после метода тДанные = ПрочитатьJSON(мЧтениеJSON,,,,"ФункцияВосстановленияJSON",ЭтотОбъект);//структура
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ЗагрузитьОбъект(СтруктураОбъекта, ВидНоменклатуры = Неопределено) Экспорт 
	
	мЛоггер = Вычислить("мис_ЛоггерСервер.getLogger(мИдВызова, ""Импорт из УПП: Справочник.Контрагенты"")");
     
    Попытка
         
		Если НЕ СтруктураОбъекта.Свойство("type") Тогда // на случай, если передадут пустой объект
			млоггер.варн("Пропущено! Нет свойства type в сообщении");
			Возврат Неопределено;
		КонецЕсли;

		Если НЕ НРег(СтруктураОбъекта.type) = "справочник.контрагенты" Тогда  
			млоггер.варн("Пропущено! В type не Справочник.Контрагенты");
			Возврат Неопределено;
		КонецЕсли;
		
		id = СтруктураОбъекта.identification;
		def = СтруктураОбъекта.definition; 
		
		
		СуществующийОбъект = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(id.Ref));

		НачатьТранзакцию();
	
		
		Если НЕ ЗначениеЗаполнено(СуществующийОбъект.ВерсияДанных) Тогда
			ОбъектДанных = Справочники.Контрагенты.СоздатьЭлемент();
			ОбъектДанныхПартнер = Справочники.Партнеры.СоздатьЭлемент();
			ОбъектДанных.УстановитьНовыйКод();
			ОбъектДанныхПартнер.УстановитьНовыйКод();
			СсылкаНового = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(id.Ref));
			ОбъектДанных.УстановитьСсылкуНового(СсылкаНового);	
		Иначе 
			ОбъектДанных = СуществующийОбъект.ПолучитьОбъект();
			Если объектДанных.Партнер = Справочники.Партнеры.ПустаяСсылка() Тогда
				ОбъектДанныхПартнер = Справочники.Партнеры.СоздатьЭлемент(); 
			Иначе
				ОбъектДанныхПартнер = ОбъектДанных.Партнер.ПолучитьОбъект();
			КонецЕсли;	
		КонецЕсли;
			
		ОбъектДанных.Наименование = def.description;  
		
		Если ОбъектДанныхПартнер <> Справочники.Партнеры.ПустаяСсылка() Тогда
			ОбъектДанныхПартнер.Наименование = def.description;
		КонецЕсли;
		
		//ОбъектДанных.ксп_Иерархия_УПП = def.Группа;
		
		ОбъектДанных.ПометкаУдаления = def.DeletionMark;       	
		
		ОбъектДанных.НаименованиеПолное = def.НаименованиеПолное;
		
		
		Если ОбъектДанныхПартнер <> Справочники.Партнеры.ПустаяСсылка() Тогда
			ОбъектДанныхПартнер.НаименованиеПолное = def.НаименованиеПолное;
		КонецЕсли;
		
		ОбъектДанных.КПП = def.КПП;	
		
		ОбъектДанных.ИНН = def.ИНН;
		
		Если def.ОбособленноеПодразделение = true Тогда
			ОбъектДанных.ОбособленноеПодразделение = ИСТИНА;
		Иначе
			ОбъектДанных.ОбособленноеПодразделение = ЛОЖЬ;
		КонецЕсли;     
		
		ОбъектДанных.КодПоОКПО = def.КодПоОКПО;
		
		Попытка
			ОбъектДанных.СтранаРегистрации = Справочники.СтраныМира.НайтиПоКоду(def.Страна.code);
		Исключение
		КонецПопытки;
		
		Попытка
			ГоловнойКонтрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(def.ГоловнойКонтрагент.ref));
		Исключение
		КонецПопытки;
		
		Если ГоловнойКонтрагент <> Неопределено Тогда
			ОбъектДанных.ГоловнойКонтрагент = ГоловнойКонтрагент;
		КонецЕсли;  
		
		Попытка
			Менеджер = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(def.Менеджер.ref));
		Исключение
		КонецПопытки;

		
		ИП = Найти(def.description, "ИП");
		
		Если def.ЮрФизЛицо.Свойство("Значение") И def.ЮрФизЛицо.Значение = "ЮрЛицо" Тогда
			ОбъектДанных.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
			ОбъектДанных.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
			ОбъектДанныхПартнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания;
		ИначеЕсли def.НеРезидент = true Тогда
			ОбъектДанных.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
			ОбъектДанных.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент;
			ОбъектДанныхПартнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания;
		ИначеЕсли ИП > 0 Тогда
			ОбъектДанных.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			ОбъектДанных.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель;
			ОбъектДанныхПартнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо;
		Иначе
			ОбъектДанных.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			ОбъектДанныхПартнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо;
		КонецЕсли;
		
		ОбъектДанныхПартнер.Клиент = def.Покупатель;
		
		ОбъектДанныхПартнер.Поставщик = def.Поставщик;
		
		Попытка
			ОбъектДанныхПартнер.ДатаРегистрации = def.Date;
		Исключение
		КонецПопытки;

		ОбъектДанныхПартнер.ОбменДанными.Загрузка = Истина;
		
		ОбъектДанныхПартнер.Записать(); 
		
		ОбъектДанных.Партнер = ОбъектДанныхПартнер.Ссылка;
		
		ОбъектДанных.ОбменДанными.Загрузка = Истина;
		
		ОбъектДанных.Записать();     
		
		ЗафиксироватьТранзакцию();
		
		мЛоггер.инфо("Загружены: Контрагент : 1, Партнер : %2", ОбъектДанных, ОбъектДанныхПартнер);
		
		Возврат ОбъектДанных.Ссылка;
		
				
    Исключение
          т = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
          мЛоггер.ерр("Плагин импорта контрагентов УПП. Подробности: " + т);
           
          //    ОБЯЗАТЕЛЬНО!!! Потому что в оркестраторе вызов плагина в попытке. и если была ошибка, надо сделать BasicReject()
          ВызватьИсключение т;
 
    КонецПопытки;
	
	
КонецФункции






// ТОЧКА ВХОДА для ИНТЕРАКТИВНОГО ИМПОРТА
Функция ЗагрузитьИзJsonНаСервере(Json, ВидНоменклатуры = Неопределено) export
	
	Если не ЗначениеЗаполнено(json) Тогда
		ВызватьИсключение "Пустой json";
	КонецЕсли;

	мЧтениеJSON = Новый ЧтениеJSON;

	
	мЧтениеJSON.УстановитьСтроку(Json);
		
	СтруктураОбъекта = ПрочитатьJSON(мЧтениеJSON,,,,"ФункцияВосстановленияJSON",ЭтотОбъект);//структура
	
	Если ТипЗнч(СтруктураОбъекта) = Тип("Массив") Тогда
		Для Каждого эл из СтруктураОбъекта Цикл
			ЗагрузитьОбъект(эл, ВидНоменклатуры);
		КонецЦикла;
	Иначе
	    Возврат ЗагрузитьОбъект(СтруктураОбъекта, ВидНоменклатуры);
	КонецЕсли;
	
КонецФункции

Функция ФункцияВосстановленияJSON(Свойство, Значение, ДопПараметры) Экспорт
	
	Если Свойство = "Date"Тогда
		Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
	КонецЕсли;
	Если Свойство = "Период"Тогда
		Попытка
			Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
		Исключение
		    Возврат '00010101';
		КонецПопытки;
		
	КонецЕсли;
	Если Свойство = "Сумма" Тогда
		Возврат XMLЗначение(Тип("Число"),Значение);
	КонецЕсли;
	Если Свойство = "Валюта" Тогда
		Возврат Справочники.Валюты.НайтиПоКоду(Значение);
	КонецЕсли;
	
КонецФункции

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ЗагрузитьИзJsonНаСервереИзФайла(Адрес, ВидНоменклатуры, Обновлять = Истина) ЭКспорт
	
	мОбновлять = Обновлять;
	
	ДвоичныеДанные  = ПолучитьИзВременногоХранилища(Адрес);
	Если 1=0 Тогда
		ДвоичныеДанные = новый ДвоичныеДанные("");
	КонецЕсли;                                
	
	ИмяФайла = ПолучитьИмяВременногоФайла("json");
	ДвоичныеДанные.Записать(ИмяФайла);
	
	мЧтениеJSON = Новый ЧтениеJSON;
	мЧтениеJSON.ОткрытьФайл(ИмяФайла);
	
	СтруктураОбъекта = ПрочитатьJSON(мЧтениеJSON,,,,"ФункцияВосстановленияJSON",ЭтотОбъект);//структура
	
	Если ТипЗнч(СтруктураОбъекта) = Тип("Массив") Тогда
		Для Каждого эл из СтруктураОбъекта Цикл
			ЗагрузитьОбъект(эл, ВидНоменклатуры);
		КонецЦикла;
	Иначе
	    Возврат ЗагрузитьОбъект(СтруктураОбъекта, ВидНоменклатуры);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции   

// ТОЧКА ВХОДА для ИНТЕРАКТИВНОГО ИМПОРТА - по массиву файлов
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ЗагрузитьИзJsonНаСервереИзМассиваАдресов(МассивАдресов, ВидНоменклатуры, Обновлять = Истина) Экспорт
	
	Возврат ЗагрузитьИзJsonНаСервереИзМассиваАдресовЧерезПоток(МассивАдресов, ВидНоменклатуры, Обновлять);
	
КонецФункции


Функция ЗагрузитьИзJsonНаСервереИзМассиваАдресовЧерезПоток(МассивАдресов, ВидНоменклатуры, Обновлять = Истина) Экспорт
	
	мОбновлять = Обновлять;
	млоггер = мис_логгерСервер.getLogger(мИдВызова);
	
	млоггер.инфо("НАЧАЛИ пакет из "+строка(МассивАдресов.Количество())+" файлов");

	сч_обработано = 0;       
	сч_ошибок = 0;
	
	мЧтениеJSON = Новый ЧтениеJSON;
	
	Для каждого Адрес Из МассивАдресов Цикл

		
		ДвоичныеДанные  = ПолучитьИзВременногоХранилища(Адрес);
		Если 1=0 Тогда
			ДвоичныеДанные = новый ДвоичныеДанные("");
		КонецЕсли;                                
		
		
		// было так:
		//ИмяФайла = ПолучитьИмяВременногоФайла("json");
		//ДвоичныеДанные.Записать(ИмяФайла);
		//мЧтениеJSON.ОткрытьФайл(ИмяФайла);
		// стало так:
		мЧтениеJSON.ОткрытьПоток(ДвоичныеДанные.ОткрытьПотокДляЧтения());		
		
		СтруктураОбъекта = ПрочитатьJSON(мЧтениеJSON,,,,"ФункцияВосстановленияJSON",ЭтотОбъект);//структура
		
		Если ТипЗнч(СтруктураОбъекта) = Тип("Массив") Тогда
			Для Каждого эл из СтруктураОбъекта Цикл
				
				Попытка
					ЗагрузитьОбъект(эл, ВидНоменклатуры);
					сч_обработано = сч_обработано +1;
				Исключение
				    //Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
					сч_ошибок = сч_ошибок + 1;
				КонецПопытки;
				
			КонецЦикла;
		Иначе 
			// один элемент (а не массив)
			Попытка
				ЗагрузитьОбъект(СтруктураОбъекта, ВидНоменклатуры);
				сч_обработано = сч_обработано +1;
			Исключение
			    //Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
				сч_ошибок = сч_ошибок + 1;
			КонецПопытки;
		    			
		КонецЕсли;

	КонецЦикла;
	
	млоггер.инфо("ЗАВЕРШИЛИ пакет из "+строка(МассивАдресов.Количество())+" файлов. УСпешно обработано = "+строка(сч_обработано)
	+", ошибок = "+Строка(сч_ошибок));
	
	Возврат Неопределено;
	
КонецФункции


	

Функция сетИдВызова(пИдВызова) Экспорт
     
    мИдВызова = пИдВызова;
    Возврат ЭтотОбъект;
     
КонецФункции


мОбновлять = ИСтина;



	
	