
&НаСервере
Функция ВыгрузитьОбъектНаСервере()
	json = РеквизитФормыВЗначение("Объект").ВыгрузитьОбъект(СсылочныйТип);
	return json;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьОбъект(Команда)
	json = ВыгрузитьОбъектНаСервере();
	message(json);
КонецПроцедуры


&НаСервере
Процедура СоздатьТестовыйОбъектНаСервере()
	НачатьТранзакцию();
	
	ТестовыйОбъект = Справочники.Номенклатура.СоздатьЭлемент();
	
	ТестовыйОбъект.ДрагоценныеМатериалы.Добавить();
	ТестовыйОбъект.ДополнительныеРеквизиты.Добавить();
	ТестовыйОбъект.Представления.Добавить();

	ТестовыйОбъект.ОбменДанными.Загрузка = Истина;
	ТестовыйОбъект.Записать();
	
	СсылочныйТип = ТестовыйОбъект.Ссылка;
	
	сообщить(ВыгрузитьОбъектНаСервере());
	
	ОтменитьТранзакцию();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьТестовыйОбъект(Команда)
	СоздатьТестовыйОбъектНаСервере();
КонецПроцедуры

