&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Ссылка = Об.ЗагрузитьИзJsonНаСервере(JsonText, СкладЕРП);
	СсылочныйТип = Ссылка;
    Возврат Ссылка;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	Рез = ЗагрузитьИзJsonНаСервере();  
	
	ТаблицаДокументов.Очистить();
	
	Если ТипЗнч(Рез) = Тип("Структура") Тогда
		
		//Сообщить(НСтр("ru = ' Заказ на производство: "+строка(Рез.ЗаказНаПроизводство)+"'"), СтатусСообщения.БезСтатуса);
		//Сообщить(НСтр("ru = ' Заказ на перемещение: "+строка(Рез.ЗаказНаПеремещение)+"'"), СтатусСообщения.БезСтатуса);
		//Сообщить(НСтр("ru = ' Приходный ордер на товары: "+строка(Рез.ПО)+"'"), СтатусСообщения.БезСтатуса);
		//Сообщить(НСтр("ru = ' Перемещение товаров: "+строка(Рез.Перемещение)+"'"), СтатусСообщения.БезСтатуса);
		
		ТаблицаДокументов.Добавить().ДокСсылка = Рез.ЗаказНаПроизводство;
		ТаблицаДокументов.Добавить().ДокСсылка = Рез.ЭтапПроизводства;
		ТаблицаДокументов.Добавить().ДокСсылка = Рез.ДвиженияПродукции;
		
		ТаблицаДокументов.Добавить().ДокСсылка = Рез.ЗаказНаПеремещение;
		ТаблицаДокументов.Добавить().ДокСсылка = Рез.ПО;
		ТаблицаДокументов.Добавить().ДокСсылка = Рез.Перемещение;
		
		Если ПровестиПриЗаписи Тогда
			ПровестиДокументы(Неопределено);
		КонецЕсли;
		
		
	Иначе 
		Сообщить(НСтр("ru = '"+строка(Рез)+"'"), СтатусСообщения.БезСтатуса);
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ПоказатьЗначение(,Элемент.ТекущиеДанные.ДокСсылка);
КонецПроцедуры


&НаСервере
Процедура ПровестиДокументыНаСервере()
	
	
	Для сч = 0 По ТаблицаДокументов.Количество()-1 Цикл
		
		ПредставлениеДокумента = Строка(ТаблицаДокументов[сч].ДокСсылка
		);
		Попытка
			ДокОбъект = ТаблицаДокументов[сч].ДокСсылка.ПолучитьОбъект();
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		    т = ОписаниеОшибки();
			ТекстОшибки = "Ошибка проведения. Док: "+Строка(ПредставлениеДокумента)+", Подробности: "+т;
			ЗаписьЖурналаРегистрации("ПроведениеДокументовПриИмпорте" , УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
			
		КонецПопытки;
		
	КонецЦикла;
		
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПровестиДокументы(Команда)      
	ПровестиДокументыНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
	св = РеквизитФормыВЗначение("Объект").СведенияОВнешнейОбработке();
	
	Элементы.НадписьВерсия.Заголовок = "Версия: "+св.версия;
	
КонецПроцедуры

