&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Ссылка = Об.ЗагрузитьИзJsonНаСервере(JsonText);
	СсылочныйТип = Ссылка;
    Возврат Ссылка;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	Рез = ЗагрузитьИзJsonНаСервере();
	
	Если ТипЗнч(Рез) = Тип("Структура") Тогда
		
		Сообщить(НСтр("ru = ' Заказ на производство: "+строка(Рез.ЗаказНаПроизводство)+"'"), СтатусСообщения.БезСтатуса);
		Сообщить(НСтр("ru = ' Расходный ордер на товары: "+строка(Рез.РО)+"'"), СтатусСообщения.БезСтатуса);
		Сообщить(НСтр("ru = ' Перемещение товаров: "+строка(Рез.Перемещение)+"'"), СтатусСообщения.БезСтатуса);
	Иначе 
		Сообщить(НСтр("ru = '"+строка(Рез)+"'"), СтатусСообщения.БезСтатуса);
	КонецЕсли;

КонецПроцедуры

