
&НаСервере
Функция ВыгрузитьОбъектНаСервере()
	json = РеквизитФормыВЗначение("Объект").ВыгрузитьОбъект(СсылочныйТип);
	return json;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьОбъект(Команда)
	json = ВыгрузитьОбъектНаСервере();
	message(json);
КонецПроцедуры





&НаСервере
Процедура СоздатьТестовыйОтчетОРознПродажахНаСервере()
	ДокОбк = Документы.ИзменениеАссортимента.СоздатьДокумент();
	
	ДокОбк.Дата = ТекущаяДатаСеанса();
	
	//Докобк.Организация = справочники.Организации.ОрганизацияПоУмолчанию();
	
	// Табл части
	
	//товары
	новСтр = докОбк.Товары.Добавить();
	
	//НаборыЗначенийДоступа
	новСтр = докОбк.НаборыЗначенийДоступа.Добавить();

	

	// ФИНАЛ
	
	Докобк.ОбменДанными.Загрузка = Истина;
	ДокОбк.Записать();
	
	СсылочныйТип = ДокОбк.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТестовыйОтчетОРознПродажах(Команда)
	СоздатьТестовыйОтчетОРознПродажахНаСервере();
КонецПроцедуры
