
&НаСервере
Функция ВыгрузитьОбъектНаСервере()
	json = РеквизитФормыВЗначение("Объект").ВыгрузитьОбъект(СсылочныйТип);
	return json;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьОбъект(Команда)
	json = ВыгрузитьОбъектНаСервере();
	message(json);
КонецПроцедуры



&НаСервере
Процедура создатьТестовыйОбъектНаСервере()
	НачатьТранзакцию();
	
	НомОбк = Справочники.Номенклатура.СоздатьЭлемент();
	НомОбк.ОбменДанными.Загрузка = Истина;
	НомОбк.Записать();
	
	ТестовыйОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
	
	ТестовыйОбъект.Владелец = НомОбк.Ссылка;
	
	ТестовыйОбъект.Представления.Добавить();
	ТестовыйОбъект.ДополнительныеРеквизиты.Добавить();

	ТестовыйОбъект.ОбменДанными.Загрузка = Истина;
	ТестовыйОбъект.Записать();
	
	СсылочныйТип = ТестовыйОбъект.Ссылка;
	
	сообщить(ВыгрузитьОбъектНаСервере());
	
	ОтменитьТранзакцию();
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура создатьТестовыйОбъект(Команда)
	создатьТестовыйОбъектНаСервере();
КонецПроцедуры
