Перем мГруппаДействующие;
Перем мВнешняяСистема;
Перем мМассивКМ;
Перем КэшТНВЭД;

Перем мЛоггер;
Перем мИдВызова;
Перем мОбновлять;

Перем мГруппа_Гражданская_группа;
Перем мГруппа_Прочий_ассортимент;
Перем мГрупаа_Брак;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	мГруппа_Гражданская_группа = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("93b3f220-db52-11db-8a2c-00034732ecf3"));
	мГруппа_Прочий_ассортимент = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("5e55e3f1-ca86-4569-9622-9e117af6a6bb"));
	мГрупаа_Брак = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("72279534-2c00-4254-906c-bdabd0f1f31d"));



	мГруппаДействующие = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("83803fc7-d1f5-47a9-ba86-3233e22f4644"));
КонецПроцедуры





&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры


&НаСервере
Процедура ВыполнитьОбработкуНаСервере()

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Родитель КАК Родитель,
	|	Номенклатура.КодТНВЭД.Код КАК _КодТНВЭД,
	| 	ISNULL(ДР.Значение, Ложь) КАК ВестиУчетПоХарактеристикам
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура      
	|	
	|left join Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР по ДР.Свойство = &Свойство
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&МассивГрупп)";
	
	МассивГрупп = Новый Массив;
    
	МассивГрупп.Добавить(мГруппа_Гражданская_группа);
	МассивГрупп.Добавить(мГруппа_Прочий_ассортимент);
	МассивГрупп.Добавить(мГрупаа_Брак);
	Запрос.УстановитьПараметр("МассивГрупп", МассивГрупп);
	
	

	мСвойствоУчетПоХар = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ВестиУчетПоХарактеристикамУПП_5d26513afe87400295dd0df74a1f6aaf");
	Запрос.УстановитьПараметр("Свойство", мСвойствоУчетПоХар);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл
		
		обк = Выборка.Ссылка.ПолучитьОбъект();
		
		ВестиУчетПоХарактеристикам = Выборка.ВестиУчетПоХарактеристикам;
		
		обк.ВидНоменклатуры = ПолучитьВидНоменклатуры2(выборка.Ссылка, 
			Выборка.Родитель, 
			Выборка._КодТНВЭД,
			ВестиУчетПоХарактеристикам);
		
		
		обк.Записать();
		
	КонецЦикла;
	
КонецПроцедуры



// 2024-08-28. Новые правила определения вида номенклатуры
Функция ПолучитьВидНоменклатуры2(Ссылка, Родитель, _КодТНВЭД, ВестиУчетПоХарактеристикам)     
	
	Перем ВидНоменклатуры;
	
	Если Родитель = мГруппаДействующие Тогда
		
		ВидНоменклатуры = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка("ВидНоменклатурыПодарочныйСертификат", мВнешняяСистема);
		
		
	Иначе  
		
		
		Если ЭтоМаркируемаяПродукция(_КодТНВЭД) Тогда    
			
			Если ВестиУчетПоХарактеристикам Тогда
				ВидНоменклатуры = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка("Готовая продукция (маркируемая, с характеристиками)", мВнешняяСистема);
			Иначе 
				ВидНоменклатуры = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка("Готовая продукция (маркируемая, без характеристик)", мВнешняяСистема);
			КонецЕсли;
			
			
			
			
		Иначе 
			
			Если ВестиУчетПоХарактеристикам Тогда
				ВидНоменклатуры = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка("Готовая продукция (не маркируемая, с характеристиками)", мВнешняяСистема);
			Иначе 
				ВидНоменклатуры = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка("Готовая продукция (не маркируемая, без характеристик)", мВнешняяСистема);
			КонецЕсли;
			
		КонецЕсли;
		
			
	
	КонецЕсли;
	
	
	Возврат ВидНоменклатуры ;
	
КонецФункции


// Описание_метода
//
// Параметры:
//	_КодТНВЭД 	- строка - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ЭтоМаркируемаяПродукция(_КодТНВЭД)
		
	Для каждого эл Из мМассивКМ Цикл
		
		Если СтрНачинаетсяС(_КодТНВЭД, эл) Тогда
			Возврат Истина
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции


	
//Коды ТНВЭД маркируемой продукции 
// использовать этот массив с функцией СтрНачинаетсяС
мМассивКМ = Новый Массив;
мМассивКМ.Добавить("6302");
мМассивКМ.Добавить("420310000");
мМассивКМ.Добавить("6106");
мМассивКМ.Добавить("6201");
мМассивКМ.Добавить("6202");
мМассивКМ.Добавить("4304000000");
мМассивКМ.Добавить("611300");
мМассивКМ.Добавить("6210");
мМассивКМ.Добавить("6101");
мМассивКМ.Добавить("6102");
мМассивКМ.Добавить("6214");
мМассивКМ.Добавить("6215");
мМассивКМ.Добавить("6211200000");
мМассивКМ.Добавить("621132");
мМассивКМ.Добавить("621133");
мМассивКМ.Добавить("6211390000");
мМассивКМ.Добавить("621142");
мМассивКМ.Добавить("621143");
мМассивКМ.Добавить("621149000");
мМассивКМ.Добавить("6112110000");
мМассивКМ.Добавить("6112120000");
мМассивКМ.Добавить("6112190000");
мМассивКМ.Добавить("6112200000");
мМассивКМ.Добавить("6110");
мМассивКМ.Добавить("6205");
мМассивКМ.Добавить("6105");
мМассивКМ.Добавить("6206");
мМассивКМ.Добавить("6103");
мМассивКМ.Добавить("6203");
мМассивКМ.Добавить("6104");
мМассивКМ.Добавить("6204");
мМассивКМ.Добавить("6107");
мМассивКМ.Добавить("6207");
мМассивКМ.Добавить("6108");
мМассивКМ.Добавить("6208");
мМассивКМ.Добавить("6109");
мМассивКМ.Добавить("6111");
мМассивКМ.Добавить("6209");
мМассивКМ.Добавить("611231");
мМассивКМ.Добавить("611239");
мМассивКМ.Добавить("611241");
мМассивКМ.Добавить("611249");
мМассивКМ.Добавить("6211110000");
мМассивКМ.Добавить("6211120000");
мМассивКМ.Добавить("6115");
мМассивКМ.Добавить("4203210000");
мМассивКМ.Добавить("420329");
мМассивКМ.Добавить("6116");
мМассивКМ.Добавить("6216000000");
мМассивКМ.Добавить("6114");
мМассивКМ.Добавить("6117100000");
мМассивКМ.Добавить("6117801009");
мМассивКМ.Добавить("6117808009");
мМассивКМ.Добавить("6217100000");
мМассивКМ.Добавить("6504000000");
мМассивКМ.Добавить("650500");




мВнешняяСистема = "upp";

