Перем НЕ_ЗАГРУЖАТЬ;
Перем СОЗДАТЬ;
Перем ОБНОВИТЬ;
Перем ОТМЕНИТЬ_ПРОВЕДЕНИЕ;
Перем ПОМЕТИТЬ; //добавлено 2024-07-03

Перем мВнешняяСистема;
Перем ИмяСобытияЖР;
Перем jsonText;
Перем СобиратьНенайденнуюНоменклатуру Экспорт;
Перем НеНайденнаяНоменклатураМассив;

Перем мЛоггер;
Перем мИдВызова;                      

Перем ПредставлениеДокументаУПП;


#Область ПодключениеОбработкиКБСП

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	
	ПараметрыРегистрации.Вставить("Вид",ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	ПараметрыРегистрации.Вставить("Версия","1.8");
	//ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование","СубПлагин_док_ВозвратТоваровПоставщику");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация","СубПлагин_док_ВозвратТоваровПоставщику");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "3.1.5.180");
	//ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	ТипКоманды = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	ДобавитьКоманду(ПараметрыРегистрации.Команды, 
	"Открыть форму : СубПлагин_док_ВозвратТоваровПоставщику",
	"Форма_СубПлагин_док_ВозвратТоваровПоставщику",
	ТипКоманды, 
	Ложь) ;
	
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить() ;
	НоваяКоманда.Представление = Представление ;
	НоваяКоманда.Идентификатор = Идентификатор ;
	НоваяКоманда.Использование = Использование ;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение ;
	НоваяКоманда.Модификатор = Модификатор ;
КонецПроцедуры

#КонецОбласти 	


#Область ЗагрузитьОбъект_

Функция ЗагрузитьОбъект(СтруктураОбъекта, jsonText = "", СкладЕРП = Неопределено ) Экспорт
	
	мЛоггер = Вычислить("мис_ЛоггерСервер.getLogger(мИдВызова, ""Субплагин Импорт документов из УПП: СубПлагин_док_ВозвратТоваровПоставщику"")");
	
	мЛоггер.Инфо("Субплагин. Версия "+строка(СведенияОВнешнейОбработке().Версия)+". Импорт док. УПП ВозвратТоваровПоставщику №"+СтруктураОбъекта.definition.Number);
	
	Попытка
		
		Если НЕ СтруктураОбъекта.Свойство("type") Тогда // на случай, если передадут пустой объект
			Возврат Неопределено;
		КонецЕсли;
		Если НЕ НРег(СтруктураОбъекта.type) = НРег("Документ.ВозвратТоваровПоставщику") Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		id = СтруктураОбъекта.identification;
		def = СтруктураОбъекта.definition;
		
		Рез = СоздатьОбновитьДокумент(СтруктураОбъекта, СкладЕРП);
		
		//*************************** Экспорт ненайденной номенклатуры ****************
		Попытка
			ксп_ЭкспортСлужебный.ВыполнитьЭкспорт_ГуидовНоменклатуры(НеНайденнаяНоменклатураМассив);
			Сообщить("Выполнен экспорт ненайденной номенклатуры - " + Строка(НеНайденнаяНоменклатураМассив.Количество()) + " позиций");
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Сообщить("Ошибка экспорта ненайденной номенклатуры в УПП.");
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Предупреждение,,,
			"Ошибка экспорта ненайденной номенклатуры в УПП. Подробности: " + ТекстОшибки);
		КонецПопытки;
		//***************************
		
		Возврат Рез;
		
	Исключение
		мЛоггер.ерр("Субплагин Комплектация номенклатуры - Ошибка. Номер "+строка(def.Номер)+". Подробности: "+ОписаниеОшибки());
		ВызватьИсключение;// для помещения в retry
	КонецПопытки;
	
КонецФункции

#КонецОбласти


#Область Схема_1

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: структура
//
Функция СоздатьОбновитьДокумент(СтруктураОбъекта, СкладЕРП)
	
	Рез = Новый Структура;
	Рез.Вставить("ВозвратТоваровПоставщику", Неопределено);
	
	Если СтруктураОбъекта.Свойство("identification") = Ложь Тогда
		Возврат Рез;
	КонецЕсли;
	
	id = СтруктураОбъекта.identification;
	деф = СтруктураОбъекта.definition;
	
	ПредставлениеДокументаУПП = "ВозвратТоваровПоставщику (УПП) № "+деф.Number+" от "+строка(деф.Date);
	
	СуществующийДокСсылка = Документы["ВозвратТоваровПоставщику"].ПолучитьСсылку(Новый УникальныйИдентификатор(id.Ref));
	
	Если ЗначениеЗаполнено(СуществующийДокСсылка.ВерсияДанных) Тогда
		СсылкаНового = СуществующийДокСсылка;
		ЭтоНовый = Ложь;
	Иначе 
		
		ОбъектДанных = Документы["ВозвратТоваровПоставщику"].СоздатьДокумент();
		СсылкаНового = Документы["ВозвратТоваровПоставщику"].ПолучитьСсылку(Новый УникальныйИдентификатор(id.Ref));
		ОбъектДанных.УстановитьСсылкуНового(СсылкаНового);
		ЭтоНовый = Истина;
		
	КонецЕсли;	
	
	
	// -------------------------------------------- БЛОКИРОВКА
	
	Если НЕ ЭтоНовый Тогда
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(СуществующийДокСсылка);
		Блокировка = ксп_Блокировки.СоздатьБлокировкуНесколькихОбъектов(МассивСсылок);
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Если НЕ ЭтоНовый Тогда
		Попытка
			Блокировка.Заблокировать();
		Исключение
			СообщениеОбОшибке=ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,
				"Объект не загружен! Ошибка блокировки цепочки документов для "+ПредставлениеДокументаУПП+". Подробности: "+СообщениеОбОшибке);
			ОтменитьТранзакцию();
			
			мЛоггер.ерр("Ошибка загрузки документа (УПП): %1. Подробности: %2", ПредставлениеДокументаУПП, СообщениеОбОшибке);
			
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
	
	//------------------------------------- Заполнение реквизитов
	Попытка
		
		//Действие = ДействиеСДокументом(ЭтоНовый, СуществующийДокСсылка, деф);
		Действие = ксп_ИмпортСлужебный.ДействиеСДокументом(ЭтоНовый, СуществующийДокСсылка, деф);
		
		Если Действие = НЕ_ЗАГРУЖАТЬ Тогда
			ОтменитьТранзакцию();                                             
			мЛоггер.дебаг("Действие = НЕ Загружать. Документ пропущен: %1", ПредставлениеДокументаУПП);
			Рез.Вставить("ВозвратТоваровПоставщику", СуществующийДокСсылка);
			Возврат Рез;
		КонецЕсли;

        // добавлено 2024-07-03
        Если Действие = ПОМЕТИТЬ Тогда
            ОбъектДанных = СуществующийДокСсылка.ПолучитьОбъект();
            ОбъектДанных.УстановитьПометкуУдаления(Истина);
            РегистрыСведений.ксп_ОтложенноеПроведение.УдалитьОтложенноеПроведение(СуществующийДокСсылка);//добавлено 2024-07-03
            ЗафиксироватьТранзакцию();
			Рез.Вставить("ВозвратТоваровПоставщику", СуществующийДокСсылка);
			мЛоггер.дебаг("Действие = ПОМЕТИТЬ. Документ будет помечен на удаление: %1", ПредставлениеДокументаУПП);
			Возврат Рез;
		КонецЕсли;
		
		Если Действие = ОТМЕНИТЬ_ПРОВЕДЕНИЕ Тогда
			ОбъектДанных = СуществующийДокСсылка.ПолучитьОбъект();
			ОбъектДанных.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ЗафиксироватьТранзакцию();
			мЛоггер.дебаг("Действие = Отменить проведение. Документ: %1", ПредставлениеДокументаУПП);
			Рез.Вставить("ВозвратТоваровПоставщику", СуществующийДокСсылка);
			Возврат Рез;
		КонецЕсли;
		
		Если Действие = ОБНОВИТЬ Тогда
			ОбъектДанных = СуществующийДокСсылка.ПолучитьОбъект();
			мЛоггер.дебаг("Действие = Обновить. Документ будет обновлен: %1", ПредставлениеДокументаУПП);
		ИначеЕсли Действие = СОЗДАТЬ Тогда
			ОбъектДанных = Документы.ВозвратТоваровПоставщику.СоздатьДокумент();
			СсылкаНового = Документы.ВозвратТоваровПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(id.Ref));
			ОбъектДанных.УстановитьСсылкуНового(СсылкаНового);
			мЛоггер.дебаг("Действие = Создать. Документ будет создан: %1", ПредставлениеДокументаУПП);
		Иначе 
			ОтменитьТранзакцию();
			т = "Действие = Неизвестое действие: "+Строка(Действие)+". Документ: " + ПредставлениеДокументаУПП;
			мЛоггер.ерр(т);
			ВызватьИсключение т;
			
		КонецЕсли;
		
		ПредставлениеОбъекта = Строка(ОбъектДанных);
		
		ЗаполнитьРеквизиты(СтруктураОбъекта, ОбъектДанных, СкладЕРП, СсылкаНового, ЭтоНовый);
		
		ОбъектДанных.ОбменДанными.Загрузка = Ложь;
		ОбъектДанных.ДополнительныеСвойства.Вставить("НеРегистрироватьКОбменуRabbitMQ", Истина);
		Если ОбъектДанных.Проведен Тогда
			ОбъектДанных.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе 
			ОбъектДанных.Записать();
		КонецЕсли;
		
		// Документ будет помещен в Отложенное проведение
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_01(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_02(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_03(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_04(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_05(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		
		ЗафиксироватьТранзакцию();
		
		мЛоггер.инфо("Записан Документ : %1. Исходный док. УПП: %2", ОбъектДанных, ПредставлениеДокументаУПП);
		
		Рез.Вставить("ВозвратТоваровПоставщику", ОбъектДанных.Ссылка);
		
	Исключение
		
		СообщениеОбОшибке=ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,
			"Объект не загружен! Ошибка в процессе загрузки документа "+ПредставлениеДокументаУПП+". Подробности: "+СообщениеОбОшибке);
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		мЛоггер.ерр("Ошибка загрузки документа (УПП): %1. Подробности: %2", ПредставлениеДокументаУПП, СообщениеОбОшибке);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат Рез;
	
КонецФункции

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ЗаполнитьРеквизиты(СтруктураОбъекта, ОбъектДанных, СкладЕРП, СсылкаНового, ЭтоНовый)
	
	id = СтруктураОбъекта.identification;
	деф = СтруктураОбъекта.definition; 
	
	//------------------------------------- Заполнение реквизитов -----------------------------------
	
	ОбъектДанных.Дата = деф.Date;
	ОбъектДанных.Номер = деф.Number;	
	ОбъектДанных.Организация = ксп_ИмпортСлужебный.НайтиОрганизацию(деф.Организация, мВнешняяСистема);
	ОбъектДанных.Склад = СкладЕРП;
	Контрагент = ксп_ИмпортСлужебный.НайтиКонтрагента(деф.Контрагент, мВнешняяСистема);
	УзелКонтрагента = Неопределено;
	ДоговорКонтрагента = ксп_ИмпортСлужебный.НайтиДоговор(деф.ДоговорКонтрагента, УзелКонтрагента, Контрагент);
	ОбъектДанных.Контрагент = Контрагент;
	ОбъектДанных.Договор = ДоговорКонтрагента;
	ОбъектДанных.Партнер = ОбъектДанных.Контрагент.Партнер;
	
	//Соглашение
	мСоглашение = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка(
		"СоглашениеСПоставщикамиУПП", мВнешняяСистема);
	Если НЕ ЗначениеЗаполнено(мСоглашение)
		ИЛИ ( НЕ ЗначениеЗаполнено(мСоглашение.ВерсияДанных) 
		И ТипЗнч(мСоглашение) = Тип("СправочникСсылка.ДоговорыКонтрагентов") ) Тогда 
		// так проверяем на битую ссылку
		ОбъектДанных.Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка();
		мЛоггер.ерр("Не заполнена настройка 
		|    СоглашениеСПоставщикамиУПП
		|в регистре ксп_ДополнительныеНастройкиИнтеграций
		|для %1. ", ПредставлениеДокументаУПП);
	Иначе
		ОбъектДанных.Соглашение = мСоглашение;
	КонецЕсли;
	
	//Подразделение

	кодВалюты="";
	ЕстьАтрибут = деф.ВалютаДокумента.свойство("currencyCode",кодВалюты);
	Если ЕстьАтрибут Тогда
		ОбъектДанных.Валюта = ксп_ИмпортСлужебный.НайтиВалюту(кодВалюты);
	КонецЕсли;

	ОбъектДанных.СуммаДокумента = деф.СуммаДокумента;
	ОбъектДанных.ЦенаВключаетНДС = деф.СуммаВключаетНДС;
	ОбъектДанных.Комментарий = "[УПП № "+Строка(деф.Number)+" от "+Строка(ОбъектДанных.Дата)+"]"+деф.Комментарий;
	ОбъектДанных.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ОбъектДанных.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику;
	
	//ЕстьМаркируемаяПродукцияГИСМ //? это под вопросом пока
	
	ОбъектДанных.СпособКомпенсации = Перечисления.СпособыКомпенсацииВозвратовТоваров.ВернутьДенежныеСредства;
	ОбъектДанных.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз; 
	
	
	//------------------------------------------------------     ТЧ Товары
	
	ОбъектДанных.Товары.Очистить();
	
	Для счТовары = 0 По деф.ТЧТовары.Количество()-1 Цикл
		стрк = деф.ТЧТовары[счТовары];
		СтрокаТЧ = ОбъектДанных.Товары.Добавить();
		
		
		//СтрокаТЧ.АналитикаУчетаНоменклатуры = ксп_ИмпортСлужебный.НайтиАналитикаУчетаНоменклатуры(стрк.АналитикаУчетаНоменклатуры);
		
		СтрокаТЧ.Количество = стрк.Количество;
		СтрокаТЧ.КоличествоУпаковок = стрк.Количество;
		
		//////////////////////////////////////////         НЕНАЙДЕННАЯ НОМЕНКЛАТУРА (НАЧАЛО)
		
		Если стрк.Номенклатура.Свойство("identification") Тогда
			// это полный объект номенклатуры.
			ТэгНоменклатуры = стрк.Номенклатура.identification;
		Иначе 
			ТэгНоменклатуры = стрк.Номенклатура;
		КонецЕсли;
		
		_Номенклатура = ксп_ИмпортСлужебный.НайтиНоменклатуру(ТэгНоменклатуры);
		
		Если ТипЗнч(_Номенклатура) = Тип("СправочникСсылка.Номенклатура") И
			НЕ ЗначениеЗаполнено(_Номенклатура.ВерсияДанных) Тогда
			
			НомГУИД = "";
			Если ТэгНоменклатуры.Свойство("Ref", НомГУИД) Тогда
				Если НеНайденнаяНоменклатураМассив.Найти(НомГУИД) = Неопределено Тогда
					НеНайденнаяНоменклатураМассив.Добавить(НомГУИД);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТЧ.Номенклатура = _Номенклатура;
		
		///////////////////////////////////////////         НЕНАЙДЕННАЯ НОМЕНКЛАТУРА (КОНЕЦ)
		
		СтрокаТЧ.Характеристика = ксп_ИмпортСлужебный.НайтиХарактеристику(стрк.ХарактеристикаНоменклатуры);
		
		СтрокаТЧ.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		
		СтрокаТЧ.СтавкаНДС = ксп_ИмпортСлужебный.ОпределитьСтавкуНДСПоПеречислениюУПП(стрк.СтавкаНДС);
		СтрокаТЧ.Цена = стрк.Цена;
		СтрокаТЧ.СуммаНДС = стрк.СуммаНДС;
		СтрокаТЧ.Сумма = стрк.Сумма;
		
		Если деф.СуммаВключаетНДС = Истина Тогда
			СтрокаТЧ.СуммаСНДС = стрк.Сумма;
		Иначе 
			СтрокаТЧ.СуммаСНДС = стрк.Сумма + стрк.СуммаНДС;
		КонецЕсли;

		
	КонецЦикла;
	
	//// ОбъектРасчетов должен быть в конце создания документа:
	//Отказ = ЛОжь;
	//МассивСтруктур = ВзаиморасчетыСервер.ПараметрыМеханизма();
	//МассивСтруктур = ВзаиморасчетыСервер.ДополненныеПараметрыМеханизма(ОбъектДанных, МассивСтруктур);
	//Если ЭтоНовый = Истина Тогда
	//	МассивСтруктур.Вставить("СсылкаНового", СсылкаНового);
	//Иначе 
	//	
	//	МассивСтруктур.Вставить("Ссылка", СсылкаНового);
	//КонецЕсли;
	//РежимЗаписи = РежимЗаписиДокумента.Запись;
	//ОбъектыРасчетовСервер.ПроверитьОбъектыРасчетовПередЗаписью(СсылкаНового, МассивСтруктур.МассивПараметров[0], РежимЗаписи, Отказ);

	ОбъектДанных.ОбъектРасчетов = СоздатьОбновитьОбъектРасчетов(ОбъектДанных, id, СсылкаНового);
	
	
	
	//------------------------------------------------------ ФИНАЛ
	
	Возврат ОбъектДанных;
	
КонецФункции

#КонецОбласти 	


#Область Тестирование

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ЗагрузитьИзJsonНаСервере(Json, СкладЕРП) export
	
	мЧтениеJSON = Новый ЧтениеJSON;
	мЧтениеJSON.УстановитьСтроку(Json);
	СтруктураОбъекта = ПрочитатьJSON(мЧтениеJSON,,,,"ФункцияВосстановленияJSON",ЭтотОбъект);//структура
	
	Если ТипЗнч(СтруктураОбъекта) = Тип("Массив") Тогда
		
		Для каждого эл Из СтруктураОбъекта Цикл
			ЗагрузитьОбъект(эл,,СкладЕРП);
		КонецЦикла;
		
	Иначе 
		Возврат ЗагрузитьОбъект(СтруктураОбъекта, , СкладЕРП);
	КонецЕсли;
	
	
КонецФункции

#КонецОбласти 	


#Область Служебные

Функция ФункцияВосстановленияJSON(Свойство, Значение, ДопПараметры) Экспорт
	
	Если Свойство = "Date" Тогда
		Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
	КонецЕсли;
	Если Свойство = "Период" Тогда
		Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
	КонецЕсли;
	Если Свойство = "Сумма" Тогда
		Если ТипЗнч(Значение) = Тип("Число") Тогда
			Возврат Значение;
		Иначе
			Возврат XMLЗначение(Тип("Число"),Значение);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция МассивРеквизитовШапкиДляПроверки() Экспорт
	
	мРеквизиты = Новый Массив;
	мРеквизиты.Добавить("Склад");
	мРеквизиты.Добавить("Организация");
	Возврат мРеквизиты;
	
КонецФункции

// Используется в  ксп_ИмпортСлужебный.ПроверитьКачествоДанных()
//
// Параметры:
//  ДокументОбъект  - ДокументСсылка - <описание параметра>
//
// Возвращаемое значение:
//  ТЗ, Колонки:
//   * ИмяТЧ
//   * ИмяКолонки
//
Функция ТабличныеЧастиДляПроверки(ДокументСсылка = Неопределено) Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ИмяТЧ");
	ТЗ.Колонки.Добавить("ИмяКолонки");
	
	Если ДокументСсылка = Неопределено 
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		НовСтр = ТЗ.Добавить();
		НовСтр.ИмяТЧ = "Товары";
		НовСтр.ИмяКолонки = "Номенклатура";
		НовСтр = ТЗ.Добавить();
		НовСтр.ИмяТЧ = "Товары";
		НовСтр.ИмяКолонки = "Характеристика";
		
	КонецЕсли;
	
	Возврат ТЗ;
	
КонецФункции

// Описание_метода
//
// Параметры:
//	ГУИД 	- строка - 36 симв
//
// Возвращаемое значение:
//	Тип: ДокументСсылка
//

// Описание_метода
//
// Параметры:
//	ГУИД 	- строка - 36 симв
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ПолучитьСсылкуДокумента(ГУИД, ВидОбъекта)
	
	СуществующийОбъект 		= Документы[ВидОбъекта].ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	
	Возврат СуществующийОбъект;
	
КонецФункции

// Описание_метода
//
// Параметры:
//  Параметр1   - Тип1 -
//
Функция сетИдВызова(пИдВызова) Экспорт
	
	мИдВызова = пИдВызова;
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти 	

//
Функция СоздатьОбновитьОбъектРасчетов(ОбъектДанных, id, ОбъектДанныхСсылка)
	
	// объект расчетов
	УИД = Новый УникальныйИдентификатор(id.Ref);
	ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПолучитьСсылку(уид);
	Если НЕ ЗначениеЗаполнено(ОбъектРасчетов.ВерсияДанных) Тогда
		ОбъектРасчетовОбъект = Справочники.ОбъектыРасчетов.СоздатьЭлемент();

		СсылкаНового = Справочники.ОбъектыРасчетов.ПолучитьСсылку(уид);
		ОбъектРасчетовОбъект.УстановитьСсылкуНового(СсылкаНового);
		
	Иначе 
		ОбъектРасчетовОбъект = ОбъектРасчетов.ПолучитьОбъект();
	КонецЕсли;
	

	ОбъектРасчетовОбъект.Объект = ОбъектДанныхСсылка;

	
	
	
	//БанковскийСчетКонтрагента
	//БанковскийСчетОрганизации
	ОбъектРасчетовОбъект.Валюта = ОбъектДанных.Валюта;
	ОбъектРасчетовОбъект.ВалютаВзаиморасчетов = ОбъектДанных.Валюта;
	//ГруппаФинансовогоУчета
	ОбъектРасчетовОбъект.Дата = ОбъектДанных.Дата;
	//ДатаВходящегоДокумента
	//
	ОбъектРасчетовОбъект.Договор = ОбъектДанных.Договор;
	//ДополнительныеРеквизиты
	//ИдентификаторПлатежа
	//ИмяПредопределенныхДанных
	//Касса
	//Комментарий
	//
	ОбъектРасчетовОбъект.Контрагент = ОбъектДанных.Контрагент;
	//Менеджер
	ОбъектРасчетовОбъект.Наименование  = Строка(ОбъектДанных);
	//НаименованиеПервичногоДокумента
	ОбъектРасчетовОбъект.НалогообложениеНДС = ОбъектДанных.НалогообложениеНДС;
	//НаправлениеДеятельности
	//
	ОбъектРасчетовОбъект.Номер = ОбъектДанных.Номер;
	//НомерВходящегоДокумента
	//Объект
	//ОплатаВВалюте
	//
	ОбъектРасчетовОбъект.Организация = ОбъектДанных.Организация;
	//
	ОбъектРасчетовОбъект.Партнер = ОбъектДанных.Партнер;
	//Подразделение
	//ПометкаУдаления
	//Предопределенный
	//
	ОбъектРасчетовОбъект.Соглашение = ОбъектДанных.Соглашение;
	//Состояние
	//Ссылка
	ОбъектРасчетовОбъект.Сумма = ОбъектДанных.СуммаДокумента;
	//
	ОбъектРасчетовОбъект.СуммаВзаиморасчетов = ОбъектДанных.СуммаДокумента;
	ОбъектРасчетовОбъект.ТипОбъектаРасчетов = Перечисления.ТипыОбъектовРасчетов.ПлатежВозврат;
	ОбъектРасчетовОбъект.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	ОбъектРасчетовОбъект.ТипСсылки = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию("Возврат товаров поставщику (Документ)", Истина);
	//ТолькоОстатки
	ОбъектРасчетовОбъект.УникальныйИдентификатор = Строка(id.Ref);
	//ФормаОплаты	

	ОбъектРасчетовОбъект.Записать();

		
	Возврат ОбъектРасчетовОбъект.ссылка;
	
КонецФункции






мВнешняяСистема = "UPP";
ИмяСобытияЖР = "Импорт_из_RabbitMQ_УПП";
СобиратьНенайденнуюНоменклатуру = Истина;
НеНайденнаяНоменклатураМассив = Новый Массив;

НЕ_ЗАГРУЖАТЬ = 1;
СОЗДАТЬ = 2;
ОБНОВИТЬ = 3;
ОТМЕНИТЬ_ПРОВЕДЕНИЕ = 4;
ПОМЕТИТЬ = 5;
