Перем мГруппаДействующие;
Перем мМассивКМ;

Перем мВнешняяСистема;

Перем КэшТНВЭД;

Перем мЛоггер;
Перем мИдВызова;
Перем мОбновлять;

Перем мГруппа_Гражданская_группа;
Перем мГруппа_Прочий_ассортимент;
Перем мГрупаа_Брак;




&НаСервере
Процедура ВыполнитьОбработкуНаСервере()   экспорт


	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка   как _Группа  
	|поместить ВТ1
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура      
	|	
	|ГДЕ
	|	Номенклатура.код = &Ссылка1
	|union all
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка     
	|
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура      
	|	
	|ГДЕ
	|	Номенклатура.код = &Ссылка2	
	|union all
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка     
	|
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура      
	|	
	|ГДЕ
	|	Номенклатура.код = &Ссылка3	";
	
	//Запрос.УстановитьПараметр("Ссылка1", мГруппа_Гражданская_группа.код);	
	//Запрос.УстановитьПараметр("Ссылка2", мГруппа_Прочий_ассортимент.код);	
	//Запрос.УстановитьПараметр("Ссылка3", мГрупаа_Брак.код);	
	
	Запрос.УстановитьПараметр("Ссылка1", "00-00088566");	
	Запрос.УстановитьПараметр("Ссылка2", "00-00162939");	
	Запрос.УстановитьПараметр("Ссылка3", "00-00172181");	
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Родитель КАК Родитель,
	|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Номенклатура.КодТНВЭД.Код КАК _КодТНВЭД,
	| 	ISNULL(ДР.Значение, Ложь) КАК ВестиУчетПоХарактеристикам
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура      
	|	
	|left join Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР по ДР.Свойство = &Свойство и ДР.ссылка = Номенклатура.Ссылка
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ

	|	И Номенклатура.Ссылка В ИЕРАРХИИ( Выбрать _Группа из ВТ1)";
	
	МассивГрупп = Новый Массив;
    
	МассивГрупп.Добавить(мГруппа_Гражданская_группа);
	МассивГрупп.Добавить(мГруппа_Прочий_ассортимент);
	МассивГрупп.Добавить(мГрупаа_Брак);
	Запрос.УстановитьПараметр("МассивГрупп", МассивГрупп);	

	мСвойствоУчетПоХар = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ВестиУчетПоХарактеристикамУПП_5d26513afe87400295dd0df74a1f6aaf");
	Запрос.УстановитьПараметр("Свойство", мСвойствоУчетПоХар);
	
	Выборка = Запрос.Выполнить().Выбрать();
	сч = 0;
	Пока выборка.Следующий() Цикл         
		сч = сч +1;
		
		
		
		_ВидНоменклатуры = ПолучитьВидНоменклатуры2(выборка.Ссылка, 
			Выборка.Родитель, 
			Выборка._КодТНВЭД,
			Выборка.ВестиУчетПоХарактеристикам);  
			
		Если Выборка.ВидНоменклатуры <> _ВидНоменклатуры Тогда
			обк = Выборка.Ссылка.ПолучитьОбъект();
		    обк.ВидНоменклатуры =_ВидНоменклатуры; 
			обк.ОбменДанными.Загрузка = Истина;
			обк.Записать();
		    сч = сч +1;
		КонецЕсли;
		
		
		
	КонецЦикла;                          
	
	сообщить(сч);
	
КонецПроцедуры



// 2024-08-28. Новые правила определения вида номенклатуры
Функция ПолучитьВидНоменклатуры2(Ссылка, Родитель, _КодТНВЭД, ВестиУчетПоХарактеристикам)     
	
	Перем ВидНоменклатуры;
	
	// подарочный сертификат
	
	Если Родитель = мГруппаДействующие Тогда
		
		ВидНоменклатуры = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка("ВидНоменклатурыПодарочныйСертификат", мВнешняяСистема);
		
		Возврат ВидНоменклатуры;
		
	КонецЕсли;
		
	// готовая продукция
	
	Если ЭтоМаркируемаяПродукция(_КодТНВЭД) Тогда    
		
		Если ВестиУчетПоХарактеристикам Тогда
			ВидНоменклатуры = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка("Готовая продукция (маркируемая, с характеристиками)", мВнешняяСистема);
		Иначе 
			ВидНоменклатуры = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка("Готовая продукция (маркируемая, без характеристик)", мВнешняяСистема);
		КонецЕсли;		
				
		
	Иначе 
		
		Если ВестиУчетПоХарактеристикам Тогда
			ВидНоменклатуры = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка("Готовая продукция (не маркируемая, с характеристиками)", мВнешняяСистема);
		Иначе 
			ВидНоменклатуры = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка("Готовая продукция (не маркируемая, без характеристик)", мВнешняяСистема);
		КонецЕсли;
		
	КонецЕсли;
	
		
    	
	Возврат ВидНоменклатуры ;
	
КонецФункции


// Описание_метода
//
// Параметры:
//	_КодТНВЭД 	- строка - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ЭтоМаркируемаяПродукция(_КодТНВЭД)
		
	Для каждого эл Из мМассивКМ Цикл
		
		Если СтрНачинаетсяС(_КодТНВЭД, эл) Тогда
			Возврат Истина
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции


	мГруппа_Гражданская_группа = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("93b3f220-db52-11db-8a2c-00034732ecf3"));
	Если НЕ ЗначениеЗаполнено(мГруппа_Гражданская_группа.ВерсияДанных) Тогда
		ВызватьИсключение "Группа Гражданская_группа  не найдена!"; 
	КонецЕсли;
	мГруппа_Прочий_ассортимент = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("5e55e3f1-ca86-4569-9622-9e117af6a6bb"));
	Если НЕ ЗначениеЗаполнено(мГруппа_Прочий_ассортимент.ВерсияДанных) Тогда
		ВызватьИсключение "Группа мГруппа_Прочий_ассортимент  не найдена!"; 
	КонецЕсли;
	мГрупаа_Брак = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("72279534-2c00-4254-906c-bdabd0f1f31d"));
	Если НЕ ЗначениеЗаполнено(мГрупаа_Брак.ВерсияДанных) Тогда
		ВызватьИсключение "Группа мГрупаа_Брак  не найдена!"; 
	КонецЕсли;
	
	


	мГруппаДействующие = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("83803fc7-d1f5-47a9-ba86-3233e22f4644"));
	
	Если НЕ ЗначениеЗаполнено(мГруппаДействующие.ВерсияДанных) Тогда
		ВызватьИсключение "Группа мГруппаДействующие  не найдена!"; 
	КонецЕсли;
	
		

		
	//Коды ТНВЭД маркируемой продукции 
	// использовать этот массив с функцией СтрНачинаетсяС
	мМассивКМ = Новый Массив;
	мМассивКМ.Добавить("6302");
	мМассивКМ.Добавить("420310000");
	мМассивКМ.Добавить("6106");
	мМассивКМ.Добавить("6201");
	мМассивКМ.Добавить("6202");
	мМассивКМ.Добавить("4304000000");
	мМассивКМ.Добавить("611300");
	мМассивКМ.Добавить("6210");
	мМассивКМ.Добавить("6101");
	мМассивКМ.Добавить("6102");
	мМассивКМ.Добавить("6214");
	мМассивКМ.Добавить("6215");
	мМассивКМ.Добавить("6211200000");
	мМассивКМ.Добавить("621132");
	мМассивКМ.Добавить("621133");
	мМассивКМ.Добавить("6211390000");
	мМассивКМ.Добавить("621142");
	мМассивКМ.Добавить("621143");
	мМассивКМ.Добавить("621149000");
	мМассивКМ.Добавить("6112110000");
	мМассивКМ.Добавить("6112120000");
	мМассивКМ.Добавить("6112190000");
	мМассивКМ.Добавить("6112200000");
	мМассивКМ.Добавить("6110");
	мМассивКМ.Добавить("6205");
	мМассивКМ.Добавить("6105");
	мМассивКМ.Добавить("6206");
	мМассивКМ.Добавить("6103");
	мМассивКМ.Добавить("6203");
	мМассивКМ.Добавить("6104");
	мМассивКМ.Добавить("6204");
	мМассивКМ.Добавить("6107");
	мМассивКМ.Добавить("6207");
	мМассивКМ.Добавить("6108");
	мМассивКМ.Добавить("6208");
	мМассивКМ.Добавить("6109");
	мМассивКМ.Добавить("6111");
	мМассивКМ.Добавить("6209");
	мМассивКМ.Добавить("611231");
	мМассивКМ.Добавить("611239");
	мМассивКМ.Добавить("611241");
	мМассивКМ.Добавить("611249");
	мМассивКМ.Добавить("6211110000");
	мМассивКМ.Добавить("6211120000");
	мМассивКМ.Добавить("6115");
	мМассивКМ.Добавить("4203210000");
	мМассивКМ.Добавить("420329");
	мМассивКМ.Добавить("6116");
	мМассивКМ.Добавить("6216000000");
	мМассивКМ.Добавить("6114");
	мМассивКМ.Добавить("6117100000");
	мМассивКМ.Добавить("6117801009");
	мМассивКМ.Добавить("6117808009");
	мМассивКМ.Добавить("6217100000");
	мМассивКМ.Добавить("6504000000");
	мМассивКМ.Добавить("650500");




	мВнешняяСистема = "upp";

	
