
&НаСервере
Функция ВыгрузитьОбъектНаСервере()
	json = РеквизитФормыВЗначение("Объект").ВыгрузитьОбъект(СсылочныйТип);
	return json;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьОбъект(Команда)
	json = ВыгрузитьОбъектНаСервере();
	message(json);
КонецПроцедуры





&НаСервере
Процедура СоздатьТестовыйДокументНаСервере()
	ДокОбк = Документы.ЧекККМКоррекции.СоздатьДокумент();
	
	ДокОбк.Дата = ТекущаяДатаСеанса();
	
	Докобк.Организация = справочники.Организации.ОрганизацияПоУмолчанию();
	
	// Товары+

	ДокОбк.Товары.Добавить();

	//ОплатаПлатежнымиКартами+

	ДокОбк.ОплатаПлатежнымиКартами.Добавить();
	
	//Серии  +

	ДокОбк.Серии.Добавить();

	//ПодарочныеСертификаты+

	ДокОбк.ПодарочныеСертификаты.Добавить();
	
	
	//АкцизныеМарки        +

	ДокОбк.АкцизныеМарки.Добавить();
	
	
	
	
	
	// ФИНАЛ
	
	Докобк.ОбменДанными.Загрузка = Истина;
	ДокОбк.Записать();
	
	СсылочныйТип = ДокОбк.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТестовыйДокумент(Команда)
	СоздатьТестовыйДокументНаСервере();
КонецПроцедуры
