&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	
	Рез = ЗагрузитьИзJsonНаСервере();
	
	Если ЗначениеЗаполнено(Рез.СпрВидыЦенСсылка) Тогда
		ТекстСообщения = "В регистре сведений: ксп_МэппингСправочникВидыЦен найдена запись: " + Рез.НаименованиеДляМэппинга + " !";
		Сообщить(ТекстСообщения, СтатусСообщения.БезСтатуса);
	Иначе
		ТекстСообщения = "В регистре сведений: ксп_МэппингСправочникВидыЦен добавлена запись: " + Рез.НаименованиеДляМэппинга + "
			|необходимо установить ВидЦены!";
		Сообщить(ТекстСообщения, СтатусСообщения.БезСтатуса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	
	Рез = РеквизитФормыВЗначение("Объект").ЗагрузитьИзJsonНаСервере(JsonText);
	Возврат Рез;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	JsonText = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Пример").ПолучитьТекст();
КонецПроцедуры

&НаСервереБезКонтекста
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция КодНом(Ном)
		
	Возврат Ном.Код;
	
КонецФункции

