

// Описание_метода
//
// Параметры:
// Бин — строка — пример «0x80C14CCC6A0BFFF311E6C10D673B12C1»
//или битая ссылка: <Объект не найден> (831:9e050050569e582311eeaed4794b1ccb)
//
// Возвращаемое значение:
// Тип: строка, гуид в формате «53a3863a-6ddd-11e7-9402-d89d67262ec2»
//
Функция БинариВГуидСтроку(Знач Бин)

    Гуид = "";  

    Бин = сред(Бин,3);//уберем 0x слева
    //а если это битая ссылка:
    //&lt;Объект не найден> (831:9e050050569e582311eeaed4794b1ccb)
    // то берем строку после 831:

    // результат - ГУДИ, в формате:
    //53a3863a-6ddd-11e7-9402-d89d67262ec2
    //   0       1   2    3       4


    Гуид3 = Лев(Бин,4);
    гуид4 = сред(бин,5,12);
    гуид2 = сред(бин,17,4);
    гуид1 = сред(бин,21,4);
    гуид0 = сред(бин,25,8);

    Возврат гуид0+"-"+гуид1+"-"+гуид2+"-"+гуид3+"-"+гуид4;

КонецФункции


// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ВыгрузитьВРэббитВсеГУИДЫ(ИдВызова, МассивБИН, ВидОбъекта, ЭтоСправочник = Истина)  Экспорт
	
	ИмяСобытияЖР = "Выгрузка в Рэббит BINARY SQL";
	
	ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Информация,,,
		"Запуск" );
	мИдВызова = ИдВызова;
	мИДСессии = Строка(Новый УникальныйИдентификатор);
	мЛоггер = КСП_ЛоггерСервер.getLogger(ИдВызова, "Экспорт в RabbitMQ BINARY SQL");
	мЛоггер.инфо("Запуск. ИдСессии: "+мИДСессии);
	мЛоггер.инфо("Вид метаданных: "+?(ЭтоСправочник,"Справочник", "Документ"));
	мЛоггер.инфо("Вид объекта: "+ВидОбъекта);


	ИмяТочкиОбмена = Константы.ксп_ТочкаОбмена.Получить().Наименование;
	
	Если Не ЗначениеЗаполнено(ИмяТочкиОбмена) Тогда
		ВызватьИсключение "Константа ксп_ТочкаОбмена не установлена!";
	КонецЕсли;

	Узел = Константы.ксп_УзелОбменаRabbit.Получить();
	Если Не ЗначениеЗаполнено(Узел) Тогда
		ВызватьИсключение "Константа ксп_УзелОбменаRabbit не установлена!";
	КонецЕсли;
	
	Клиент = Вычислить("PinkRabbit.ПолучитьКлиента()");
	
	
	
	Для каждого эл Из массивБИН Цикл
		
		гуид = БинариВГуидСтроку(эл);          
		
		УИД = Новый УникальныйИдентификатор(гуид);
		Если ЭтоСправочник Тогда                      
			
			Ссылка = Справочники[ВидОбъекта].ПолучитьСсылку(УИД);
		Иначе
			Ссылка = Документы[ВидОбъекта].ПолучитьСсылку(УИД);
		КонецЕсли;
		
		ПредставлениеСсылки = СтрЗаменить(Строка(Ссылка),"%","&proc");
		
			
		
		Json = КСП_ЭкспортСлужебный.ВыгрузитьОбъектПоСсылке(Ссылка);
		
		
		_типОбъекта = ТипЗнч(Ссылка);	
		RoutingKey = "";
		Если Документы.ТипВсеСсылки().СодержитТип(_типОбъекта) Тогда
			RoutingKey = "doc";
		ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(_типОбъекта) 
			ИЛИ Перечисления.ТипВсеСсылки().СодержитТип(_типОбъекта)
			ИЛИ ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(_типОбъекта) Тогда
			RoutingKey = "static";
		КонецЕсли;
		
			
		
		УспешноОпубликован = Ложь;
		Попытка
			Клиент.BasicPublish(ИмяТочкиОбмена, RoutingKey, json, 0, Ложь);
			УспешноОпубликован = Истина;
            мЛоггер.инфо("PUBLISHED! БИН: "+эл+", ГУИД: "+гуид+", Ссылка: "+ПредставлениеСсылки);
		Исключение
	        т = Клиент.GetLastError();
			тт = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,	
				"Ошибка публикации объекта <"+ПредставлениеСсылки+">. Ошибка PinkRabbitMQ: "+т+символы.ПС+
				"Ошибка 1С: "+тт);
			
			ВызватьИсключение;
		КонецПопытки;
		
		
	КонецЦикла;
	
	Клиент = Неопределено;

	мЛоггер.инфо("Завершение. ИдСессии: "+мИДСессии);
	
КонецПроцедуры               


// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ВыгрузитьВРэббитШтрихкоды(ИдВызова, МассивШК) Экспорт
	
	ИмяСобытияЖР = "Выгрузка в Рэббит BINARY SQL";
	
	ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Информация,,,
		"Запуск" );
	мИдВызова = ИдВызова;
	мИДСессии = Строка(Новый УникальныйИдентификатор);
	мЛоггер = КСП_ЛоггерСервер.getLogger(ИдВызова, "Экспорт в RabbitMQ BINARY SQL");
	мЛоггер.инфо("Запуск. ИдСессии: "+мИДСессии);
	мЛоггер.инфо("Вид метаданных: Регистр ШтрихкодыНоменклатуры");


	ИмяТочкиОбмена = Константы.ксп_ТочкаОбмена.Получить().Наименование;
	
	Если Не ЗначениеЗаполнено(ИмяТочкиОбмена) Тогда
		ВызватьИсключение "Константа ксп_ТочкаОбмена не установлена!";
	КонецЕсли;

	Узел = Константы.ксп_УзелОбменаRabbit.Получить();
	Если Не ЗначениеЗаполнено(Узел) Тогда
		ВызватьИсключение "Константа ксп_УзелОбменаRabbit не установлена!";
	КонецЕсли;
	
	Клиент = Вычислить("PinkRabbit.ПолучитьКлиента()");
	
	
	
	Для каждого эл Из массивБИН Цикл
		
		
		
		УИД = Новый УникальныйИдентификатор(гуид);
		Если ЭтоСправочник Тогда                      
			
			Ссылка = Справочники[ВидОбъекта].ПолучитьСсылку(УИД);
		Иначе
			Ссылка = Документы[ВидОбъекта].ПолучитьСсылку(УИД);
		КонецЕсли;
		
		ПредставлениеСсылки = СтрЗаменить(Строка(Ссылка),"%","&proc");
		
			
		
		Json = КСП_ЭкспортСлужебный.ВыгрузитьОбъектПоСсылке(Ссылка);
		
		
		_типОбъекта = ТипЗнч(Ссылка);	
		RoutingKey = "";
		Если Документы.ТипВсеСсылки().СодержитТип(_типОбъекта) Тогда
			RoutingKey = "doc";
		ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(_типОбъекта) 
			ИЛИ Перечисления.ТипВсеСсылки().СодержитТип(_типОбъекта)
			ИЛИ ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(_типОбъекта) Тогда
			RoutingKey = "static";
		КонецЕсли;
		
			
		
		УспешноОпубликован = Ложь;
		Попытка
			Клиент.BasicPublish(ИмяТочкиОбмена, RoutingKey, json, 0, Ложь);
			УспешноОпубликован = Истина;
            мЛоггер.инфо("PUBLISHED! БИН: "+эл+", ГУИД: "+гуид+", Ссылка: "+ПредставлениеСсылки);
		Исключение
	        т = Клиент.GetLastError();
			тт = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,	
				"Ошибка публикации объекта <"+ПредставлениеСсылки+">. Ошибка PinkRabbitMQ: "+т+символы.ПС+
				"Ошибка 1С: "+тт);
			
			ВызватьИсключение;
		КонецПопытки;
		
		
	КонецЦикла;
	
	Клиент = Неопределено;

	мЛоггер.инфо("Завершение. ИдСессии: "+мИДСессии);
	
	
КонецПроцедуры
