

#Область ПодключениеОбработкиКБСП

Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();

	ПараметрыРегистрации.Вставить("Вид",ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	ПараметрыРегистрации.Вставить("Версия","1.1");
	//ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование","Регистрация/выгрузка GUID-ов в RabbitMQ из MSSQL");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация","Регистрация/выгрузка GUID-ов в RabbitMQ из MSSQL");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "3.1.5.180"); // ОБЯЗАТЕЛЬНО!!! //(https://forum.infostart.ru/forum9/topic179193/)
	//ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	
	ТипКоманды = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	ДобавитьКоманду(ПараметрыРегистрации.Команды, "Открыть форму : Регистрация/выгрузка GUID-ов в RabbitMQ из MSSQL","ЭкспортФорма",ТипКоманды, Ложь) ;
	
	//ТипКоманды = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	//ДобавитьКоманду(ПараметрыРегистрации.Команды, "Выполнить экспорт. Версия 2","ЭкспортБезОткрытияФормы",ТипКоманды, Ложь) ;

	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить() ;
	НоваяКоманда.Представление = Представление ;
	НоваяКоманда.Идентификатор = Идентификатор ;
	НоваяКоманда.Использование = Использование ;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение ;
	НоваяКоманда.Модификатор = Модификатор ;
КонецПроцедуры

// Интерфейс для запуска логики обработки.
Процедура ВыполнитьКоманду(ИмяКоманды, ПараметрыВыполнения) Экспорт
	
	Если ИмяКоманды = "ЭкспортБезОткрытияФормы" Тогда
		//ВыполнитьЭкспорт(ПараметрыВыполнения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 	


// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ВыгрузитьВРэббитВсеГУИДЫ(ИдВызова, МассивБИН, ВидОбъекта, ЭтоСправочник = Истина)  Экспорт
	
	ИмяСобытияЖР = "Выгрузка в Рэббит BINARY SQL";
	
	ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Информация,,,
		"Запуск" );
	мИдВызова = ИдВызова;
	мИДСессии = Строка(Новый УникальныйИдентификатор);
	мЛоггер = КСП_ЛоггерСервер.getLogger(ИдВызова, "Экспорт в RabbitMQ BINARY SQL");
	мЛоггер.инфо("Запуск. ИдСессии: "+мИДСессии);
	мЛоггер.инфо("Вид метаданных: "+?(ЭтоСправочник,"Справочник", "Документ"));
	мЛоггер.инфо("Вид объекта: "+ВидОбъекта);


	ИмяТочкиОбмена = Константы.ксп_ТочкаОбмена.Получить().Наименование;
	
	Если Не ЗначениеЗаполнено(ИмяТочкиОбмена) Тогда
		ВызватьИсключение "Константа ксп_ТочкаОбмена не установлена!";
	КонецЕсли;

	Узел = Константы.ксп_УзелОбменаRabbit.Получить();
	Если Не ЗначениеЗаполнено(Узел) Тогда
		ВызватьИсключение "Константа ксп_УзелОбменаRabbit не установлена!";
	КонецЕсли;
	
	Клиент = Вычислить("PinkRabbit.ПолучитьКлиента()");
	
	
	
	Для каждого эл Из массивБИН Цикл
		
		гуид = БинариВГуидСтроку(эл);          
		
		УИД = Новый УникальныйИдентификатор(гуид);
		Если ЭтоСправочник Тогда                      
			
			Ссылка = Справочники[ВидОбъекта].ПолучитьСсылку(УИД);
		Иначе
			Ссылка = Документы[ВидОбъекта].ПолучитьСсылку(УИД);
		КонецЕсли;
		
		ПредставлениеСсылки = СтрЗаменить(Строка(Ссылка),"%","&proc");
		
			
		
		Json = КСП_ЭкспортСлужебный.ВыгрузитьОбъектПоСсылке(Ссылка);
		
		
		_типОбъекта = ТипЗнч(Ссылка);	
		RoutingKey = "";
		Если Документы.ТипВсеСсылки().СодержитТип(_типОбъекта) Тогда
			RoutingKey = "doc";
		ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(_типОбъекта) 
			ИЛИ Перечисления.ТипВсеСсылки().СодержитТип(_типОбъекта)
			ИЛИ ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(_типОбъекта) Тогда
			RoutingKey = "static";
		КонецЕсли;
		
			
		
		УспешноОпубликован = Ложь;
		Попытка
			Клиент.BasicPublish(ИмяТочкиОбмена, RoutingKey, json, 0, Ложь);
			УспешноОпубликован = Истина;
            мЛоггер.инфо("PUBLISHED! БИН: "+эл+", ГУИД: "+гуид+", Ссылка: "+ПредставлениеСсылки);
		Исключение
	        т = Клиент.GetLastError();
			тт = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,	
				"Ошибка публикации объекта <"+ПредставлениеСсылки+">. Ошибка PinkRabbitMQ: "+т+символы.ПС+
				"Ошибка 1С: "+тт);
			
			ВызватьИсключение;
		КонецПопытки;
		
		
	КонецЦикла;
	
	Клиент = Неопределено;

	мЛоггер.инфо("Завершение. ИдСессии: "+мИДСессии);
	
КонецПроцедуры               



// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ВыгрузитьВРэббитШтрихкоды(ИдВызова, МассивШК) Экспорт
	
	ИмяСобытияЖР = "Выгрузка в Рэббит BINARY SQL";
	
	ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Информация,,,
		"Запуск" );
	мИдВызова = ИдВызова;
	мИДСессии = Строка(Новый УникальныйИдентификатор);
	мЛоггер = КСП_ЛоггерСервер.getLogger(ИдВызова, "Экспорт в RabbitMQ BINARY SQL");
	мЛоггер.инфо("Запуск. ИдСессии: "+мИДСессии);
	мЛоггер.инфо("Вид метаданных: Регистр ШтрихкодыНоменклатуры");


	ИмяТочкиОбмена = Константы.ксп_ТочкаОбмена.Получить().Наименование;
	
	Если Не ЗначениеЗаполнено(ИмяТочкиОбмена) Тогда
		ВызватьИсключение "Константа ксп_ТочкаОбмена не установлена!";
	КонецЕсли;

	Узел = Константы.ксп_УзелОбменаRabbit.Получить();
	Если Не ЗначениеЗаполнено(Узел) Тогда
		ВызватьИсключение "Константа ксп_УзелОбменаRabbit не установлена!";
	КонецЕсли;
	
	Клиент = Вычислить("PinkRabbit.ПолучитьКлиента()");
	
	
	НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
	
	Для каждого эл Из МассивШК Цикл
		
		НаборЗаписей.Отбор.Штрихкод.Установить(эл);	
		НаборЗаписей.Прочитать();
		
		Json = КСП_ЭкспортСлужебный.ВыгрузитьНаборЗаписей(НаборЗаписей);
		
		RoutingKey = "static";
		
		УспешноОпубликован = Ложь;
		Попытка
			Клиент.BasicPublish(ИмяТочкиОбмена, RoutingKey, json, 0, Ложь);
			УспешноОпубликован = Истина;
            мЛоггер.инфо("PUBLISHED! ШК: "+эл);
		Исключение
	        т = Клиент.GetLastError();
			тт = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,	
				"Ошибка публикации штрихкода <"+эл+">. Ошибка PinkRabbitMQ: "+т+символы.ПС+
				"Ошибка 1С: "+тт);
			
			ВызватьИсключение;
		КонецПопытки;
		
		
	КонецЦикла;
	
	Клиент = Неопределено;

	мЛоггер.инфо("Завершение. ИдСессии: "+мИДСессии);
	
	
КонецПроцедуры



// Описание_метода
//
// Параметры:
// Бин — строка — пример «0x80C14CCC6A0BFFF311E6C10D673B12C1»
//или битая ссылка: <Объект не найден> (831:9e050050569e582311eeaed4794b1ccb)
//
// Возвращаемое значение:
// Тип: строка, гуид в формате «53a3863a-6ddd-11e7-9402-d89d67262ec2»
//
Функция БинариВГуидСтроку(Знач Бин)

    Гуид = "";  

    Бин = сред(Бин,3);//уберем 0x слева
    //а если это битая ссылка:
    //&lt;Объект не найден> (831:9e050050569e582311eeaed4794b1ccb)
    // то берем строку после 831:

    // результат - ГУДИ, в формате:
    //53a3863a-6ddd-11e7-9402-d89d67262ec2
    //   0       1   2    3       4


    Гуид3 = Лев(Бин,4);
    гуид4 = сред(бин,5,12);
    гуид2 = сред(бин,17,4);
    гуид1 = сред(бин,21,4);
    гуид0 = сред(бин,25,8);

    Возврат гуид0+"-"+гуид1+"-"+гуид2+"-"+гуид3+"-"+гуид4;

КонецФункции


