
//ЕНС. Сразу закроем форму
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполнитьДействие(Неопределено);
КонецПроцедуры




&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	ВыполнитьНаСервере();    
    Парам = Новый Структура("ОбъектДляЗаполнения,ТипДокументаСлужебногоРезерва");
    Парам.ОбъектДляЗаполнения = ВладелецФормы;
    
    ЭтаФорма.Закрыть(Парам);
КонецПроцедуры


&НаСервере
Процедура ОтменаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ОтменаНаСервере();
	ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры

