
&НаСервере
Функция ВыгрузитьОбъектНаСервере()
	json = РеквизитФормыВЗначение("Объект").ВыгрузитьОбъект(СсылочныйТип);
	return json;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьОбъект(Команда)
	json = ВыгрузитьОбъектНаСервере();
	message(json);
КонецПроцедуры





&НаСервере
Процедура СоздатьТестовыйДокументНаСервере()
	
	ДокОбк = Документы.ЗаказНаПеремещение.СоздатьДокумент();
	ДокОбк.Дата = ТекущаяДатаСеанса();
	
	ДокОбк.Ответственный = пользователи.ТекущийПользователь();
	
	Докобк.Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
	
	//Товары
	докобк.Товары.Добавить();
	//ДополнительныеРеквизиты
	докобк.ДополнительныеРеквизиты.Добавить();
	
	ДокОбк.ОбменДанными.Загрузка = Истина;
	ДокОбк.Записать();
	
	СсылочныйТип = докобк.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТестовыйДокумент(Команда)
	СоздатьТестовыйДокументНаСервере();
	ВыгрузитьОбъект(Неопределено);
КонецПроцедуры
