
&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначения)Экспорт 
	
	Для каждого стрк Из ВладелецФормы.Объект.Товары Цикл
		Если ЗначениеЗаполнено(стрк.Характеристика) Тогда
			//Если НЕ ЗначениеЗаполнено(стрк.Характеристика.ВерсияДанных) Тогда 
				//Ссылка = ВыполнитьПоискХарактеристики(стрк.Номенклатура);
				//Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
				//	Ссылка = Создатьхарактеристику(стрк.Номенклатура);		
				//КонецЕсли;
			//КонецЕсли;
		Иначе 
			Ссылка = ВыполнитьПоискХарактеристики(стрк.Номенклатура); 
			Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
				Ссылка = Создатьхарактеристику(стрк.Номенклатура);		
			КонецЕсли;
			стрк.Характеристика = Ссылка;
		КонецЕсли; 
	КонецЦикла;
     
    ВладелецФормы.Модифицированность = Истина;

КонецПроцедуры
 
&НаКлиенте
Процедура Зполнить(Команда) 
	
	ВыполнитьКоманду("", Объект.Документ); 
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ВыполнитьПоискХарактеристики(Владелец)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец
		|	И ХарактеристикиНоменклатуры.Наименование = ""Неопределена""";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда 
			Возврат Выборка.Ссылка;          
		КонецЕсли;
	КонецЦикла;
	
КонецФункции  

&НаСервере
Функция Создатьхарактеристику(Владелец) 
	
	НоваяХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
    НоваяХарактеристика.Наименование = "Неопределена";
	НоваяХарактеристика.Владелец     = Владелец;
	НоваяХарактеристика.Записать(); 
	Возврат НоваяХарактеристика.Ссылка;

КонецФункции
