
&НаСервере
Функция ВыгрузитьОбъектНаСервере()
	json = РеквизитФормыВЗначение("Объект").ВыгрузитьОбъект(СсылочныйТип);
	return json;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьОбъект(Команда)
	json = ВыгрузитьОбъектНаСервере();
	message(json);
КонецПроцедуры



&НаСервере
Процедура СоздатьТестовыйОбъектНаСервере()
	
	НачатьТранзакцию();
	
	ТестовыйОбъект = Справочники.ВидыНоменклатуры.СоздатьЭлемент();
	
	ТестовыйОбъект.РеквизитыДляКонтроляНоменклатуры.Добавить();
	ТестовыйОбъект.РеквизитыДляКонтроляХарактеристик.Добавить();
	ТестовыйОбъект.РеквизитыДляКонтроляСерий.Добавить();
	ТестовыйОбъект.РеквизитыБыстрогоОтбораНоменклатуры.Добавить();
	ТестовыйОбъект.РеквизитыБыстрогоОтбораХарактеристик.Добавить();
	ТестовыйОбъект.ПолитикиУчетаСерий.Добавить();
	ТестовыйОбъект.РеквизитыХарактеристикДляКлючаЦен.Добавить();
	ТестовыйОбъект.РеквизитыСерийДляКлючаЦен.Добавить();
	
	
	
	ТестовыйОбъект.ОбменДанными.Загрузка = Истина;
	ТестовыйОбъект.Записать();
	
	СсылочныйТип = ТестовыйОбъект.Ссылка;
	
	сообщить(ВыгрузитьОбъектНаСервере());
	
	ОтменитьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТестовыйОбъект(Команда)
	СоздатьТестовыйОбъектНаСервере();
КонецПроцедуры
