&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	Ссылка = ЗагрузитьИзJsonНаСервере();
	Сообщить(НСтр("ru = '"+строка(ссылка.РеализацияТоваровУслуг)+"'"), СтатусСообщения.БезСтатуса);
КонецПроцедуры

&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	Ссылка = Об.ЗагрузитьИзJsonНаСервере(JsonText);
	
	Если Ссылка = Неопределено Тогда
		СсылочныйТип = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	Иначе
		СсылочныйТип = Ссылка;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции


