
&НаСервере
Функция ВыгрузитьОбъектНаСервере()
	json = РеквизитФормыВЗначение("Объект").ВыгрузитьОбъект(СсылочныйТип);
	return json;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьОбъект(Команда)
	json = ВыгрузитьОбъектНаСервере();
	message(json);
КонецПроцедуры

&НаСервере
Процедура СоздатьТестовыйДокументНаСервере()
	
	ДокОбк = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
	ДокОбк.Дата = ТекущаяДатаСеанса();
	
	ДокОбк.Ответственный = пользователи.ТекущийПользователь();
	
	//ТоварыПоРаспоряжениям
	докобк.ТоварыПоРаспоряжениям.Добавить();
	//ОтгружаемыеТовары	
	докобк.ОтгружаемыеТовары.Добавить();
	//ДополнительныеРеквизиты
	докобк.ДополнительныеРеквизиты.Добавить();
	//ШтрихкодыУпаковок
	докобк.ШтрихкодыУпаковок.Добавить();
	
	ДокОбк.ОбменДанными.Загрузка = Истина;
	ДокОбк.Записать();
	
	СсылочныйТип = докобк.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТестовыйДокумент(Команда)
	СоздатьТестовыйДокументНаСервере();
	ВыгрузитьОбъект(Неопределено);
КонецПроцедуры
