#Область ПодключениеОбработкиКБСП

Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();

	ПараметрыРегистрации.Вставить("Вид",ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	ПараметрыРегистрации.Вставить("Версия","1.1");
	//ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование","Плагин_RabbitMQ_экспорт_Документ_ПередачаТоваровМеждуОрганизациями");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация","Плагин_RabbitMQ_экспорт_Документ_ПередачаТоваровМеждуОрганизациями");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "3.1.5.180");
	//ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	
	ТипКоманды = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	ДобавитьКоманду(ПараметрыРегистрации.Команды, 
		"Открыть форму : Плагин_RabbitMQ_экспорт_Документ_ПередачаТоваровМеждуОрганизациями",
		"Форма_Плагин_RabbitMQ_экспорт_Документ_ПередачаТоваровМеждуОрганизациями",
		ТипКоманды, 
		Ложь) ;
	
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

	//ТаблицаКоманд.Колонки.Добавить("Представление", РеквизитыТабличнойЧасти.Представление.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Идентификатор", РеквизитыТабличнойЧасти.Идентификатор.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	//ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", РеквизитыТабличнойЧасти.ПоказыватьОповещение.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Модификатор", РеквизитыТабличнойЧасти.Модификатор.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Скрыть",      РеквизитыТабличнойЧасти.Скрыть.Тип);
	//ТаблицаКоманд.Колонки.Добавить("ЗаменяемыеКоманды", РеквизитыТабличнойЧасти.ЗаменяемыеКоманды.Тип);
	
//           ** Использование - Строка - тип команды:
//               "ВызовКлиентскогоМетода",
//               "ВызовСерверногоМетода",
//               "ЗаполнениеФормы",
//               "ОткрытиеФормы" или
//               "СценарийВБезопасномРежиме".
//               Для получения типов команд рекомендуется использовать функции
//               ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКоманды<ИмяТипа>.
//               В комментариях к этим функциям также даны шаблоны процедур-обработчиков команд.

	НоваяКоманда = ТаблицаКоманд.Добавить() ;
	НоваяКоманда.Представление = Представление ;
	НоваяКоманда.Идентификатор = Идентификатор ;
	НоваяКоманда.Использование = Использование ;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение ;
	НоваяКоманда.Модификатор = Модификатор ;
КонецПроцедуры


#КонецОбласти 	


// Описание_метода
//
// Параметры:
//	Номенклатура	- СправочникСсылка.Номенклатура / СправочникОбъект.Номенклатура - при чтении узла обмена сюда будут приходить именно объекты
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ВыгрузитьОбъект(Ссылка) Экспорт
	
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда
		Обк = Ссылка.ПолучитьОбъект(); 
	Иначе 
		Обк = Ссылка; 
	КонецЕсли;

	
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);
	ЗаписьJson = Новый ЗаписьJSON;
	ЗаписьJson.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	// Это основной объект json-сообщения
	СтруктураОбъекта = Новый Структура;
	
	СтруктураОбъекта.Вставить("source", "ERP");
	СтруктураОбъекта.Вставить("type", Обк.метаданные().ПолноеИмя());
	СтруктураОбъекта.Вставить("datetime", XMLСтрока(ТекущаяДатаСеанса()));
	
	identification = ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Ссылка);
	СтруктураОбъекта.Вставить("identification", identification);
	
	//	DEFINITION
	
	definition = ксп_ЭкспортСлужебный.СоздатьУзелDefinition(Обк.Ссылка);
	
	//Таблица:	Шапка	
		
	definition.Вставить("Автор", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Автор));
	definition.Вставить("АдресДоставки", Обк.АдресДоставки);
	definition.Вставить("БанковскийСчетГрузоотправителя", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.БанковскийСчетГрузоотправителя));
	definition.Вставить("БанковскийСчетГрузополучателя", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.БанковскийСчетГрузополучателя));
	definition.Вставить("БанковскийСчетКонтрагента", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.БанковскийСчетКонтрагента));
	definition.Вставить("БанковскийСчетОрганизации", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.БанковскийСчетОрганизации));
	definition.Вставить("БанковскийСчетОрганизацииПолучателя", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.БанковскийСчетОрганизацииПолучателя));
	definition.Вставить("Валюта", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Валюта));
	definition.Вставить("ВалютаВзаиморасчетов", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ВалютаВзаиморасчетов));
	definition.Вставить("ВариантОформленияПродажи", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ВариантОформленияПродажи));
	definition.Вставить("ВидЦены", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ВидЦены));
	definition.Вставить("ВидыЗапасовУказаныВручную", Обк.ВидыЗапасовУказаныВручную);
	definition.Вставить("ГлавныйБухгалтер", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ГлавныйБухгалтер));
	definition.Вставить("Грузоотправитель", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Грузоотправитель));
	definition.Вставить("Грузополучатель", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Грузополучатель));
	definition.Вставить("ГруппаФинансовогоУчета", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ГруппаФинансовогоУчета));
	definition.Вставить("ГруппаФинансовогоУчетаПолучателя", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ГруппаФинансовогоУчетаПолучателя));
	definition.Вставить("ДатаВходящегоДокумента", XMLСтрока(Обк.ДатаВходящегоДокумента));
	definition.Вставить("ДатаПлатежа", XMLСтрока(Обк.ДатаПлатежа));
	definition.Вставить("ДоверенностьВыдана", Обк.ДоверенностьВыдана);
	definition.Вставить("ДоверенностьДата", XMLСтрока(Обк.ДоверенностьДата));
	definition.Вставить("ДоверенностьЛицо", Обк.ДоверенностьЛицо);
	definition.Вставить("ДоверенностьНомер", Обк.ДоверенностьНомер);
	definition.Вставить("Договор", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Договор));
	definition.Вставить("ДоговорПокупки", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ДоговорПокупки));
	definition.Вставить("ДоговорПродажи", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ДоговорПродажи));
	definition.Вставить("ИдентификаторПлатежа", Обк.ИдентификаторПлатежа);
	definition.Вставить("Комментарий", Обк.Комментарий);
	definition.Вставить("КонецПериода", XMLСтрока(Обк.КонецПериода));
	definition.Вставить("Контрагент", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Контрагент));
	definition.Вставить("КурсЗнаменатель", Обк.КурсЗнаменатель);
	definition.Вставить("КурсЧислитель", Обк.КурсЧислитель);
	definition.Вставить("Менеджер", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Менеджер));
	definition.Вставить("НаименованиеВходящегоДокумента", Обк.НаименованиеВходящегоДокумента);
	definition.Вставить("НалогообложениеНДС", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.НалогообложениеНДС));
	definition.Вставить("НаправлениеДеятельности", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.НаправлениеДеятельности));
	definition.Вставить("НачалоПериода", XMLСтрока(Обк.НачалоПериода));
	definition.Вставить("НомерВходящегоДокумента", Обк.НомерВходящегоДокумента);
	definition.Вставить("ОбъектРасчетов", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ОбъектРасчетов));
	definition.Вставить("ОбъектРасчетовПолучателя", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ОбъектРасчетовПолучателя));
	definition.Вставить("ОплатаВВалюте", Обк.ОплатаВВалюте);
	definition.Вставить("Организация", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Организация));
	definition.Вставить("ОрганизацияПолучатель", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ОрганизацияПолучатель));
	definition.Вставить("Основание", Обк.Основание);
	definition.Вставить("ОснованиеДата", XMLСтрока(Обк.ОснованиеДата));
	definition.Вставить("ОснованиеНомер", Обк.ОснованиеНомер);
	definition.Вставить("Отпустил", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Отпустил));
	definition.Вставить("ОтпустилДолжность", Обк.ОтпустилДолжность);
	definition.Вставить("Партнер", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Партнер));
	definition.Вставить("ПередачаПодДеятельность", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ПередачаПодДеятельность));
	definition.Вставить("Подразделение", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Подразделение));
	definition.Вставить("ПорядокРасчетов", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ПорядокРасчетов));
	definition.Вставить("РасчетыЧерезОтдельногоКонтрагента", Обк.РасчетыЧерезОтдельногоКонтрагента);
	definition.Вставить("Руководитель", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Руководитель));
	definition.Вставить("Склад", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Склад));
	definition.Вставить("СуммаВзаиморасчетов", Обк.СуммаВзаиморасчетов);
	definition.Вставить("СуммаДокумента", Обк.СуммаДокумента);
	definition.Вставить("УдалитьПорядокОплаты", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.УдалитьПорядокОплаты));
	definition.Вставить("УказыватьНомераГТД", Обк.УказыватьНомераГТД);
	definition.Вставить("ФормаОплаты", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ФормаОплаты));
	definition.Вставить("ХозяйственнаяОперация", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ХозяйственнаяОперация));
	definition.Вставить("ЦенаВключаетНДС", Обк.ЦенаВключаетНДС);

	
	//Таблица: Товары   
	
	ТЧТовары = Новый Массив;
	
	Для сч = 0 По обк.товары.Количество()-1 Цикл
		
		стрк = обк.товары[сч];
		
		НовСтр = Новый Структура;   
	
			
		НовСтр.Вставить("АналитикаРасходов", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.АналитикаРасходов));
		НовСтр.Вставить("АналитикаУчетаНоменклатуры", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.АналитикаУчетаНоменклатуры));
		НовСтр.Вставить("ВидЗапасов", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ВидЗапасов));
		НовСтр.Вставить("ВидЦены", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ВидЦены));
		НовСтр.Вставить("ИдентификаторСтроки", стрк.ИдентификаторСтроки);
		НовСтр.Вставить("Количество", стрк.Количество);
		НовСтр.Вставить("КоличествоПоРНПТ", стрк.КоличествоПоРНПТ);
		НовСтр.Вставить("КоличествоУпаковок", стрк.КоличествоУпаковок);
		НовСтр.Вставить("Назначение", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Назначение));
		НовСтр.Вставить("Номенклатура", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Номенклатура));
		НовСтр.Вставить("НомерГТД", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.НомерГТД));
		НовСтр.Вставить("Подразделение", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Подразделение));
		НовСтр.Вставить("ПоТоварамКОформлению", стрк.ПоТоварамКОформлению);
		НовСтр.Вставить("Серия", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Серия));
		НовСтр.Вставить("СписатьНаРасходы", стрк.СписатьНаРасходы);
		НовСтр.Вставить("СтавкаНДС", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.СтавкаНДС));
		НовСтр.Вставить("СтатусУказанияСерий", стрк.СтатусУказанияСерий);
		НовСтр.Вставить("СтатьяРасходов", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.СтатьяРасходов));
		НовСтр.Вставить("Сумма", стрк.Сумма);
		НовСтр.Вставить("СуммаВзаиморасчетов", стрк.СуммаВзаиморасчетов);
		НовСтр.Вставить("СуммаНДС", стрк.СуммаНДС);
		НовСтр.Вставить("СуммаНДСВзаиморасчетов", стрк.СуммаНДСВзаиморасчетов);
		НовСтр.Вставить("СуммаСНДС", стрк.СуммаСНДС);
		НовСтр.Вставить("УдалитьСтавкаНДС", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.УдалитьСтавкаНДС));
		НовСтр.Вставить("Упаковка", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Упаковка));
		НовСтр.Вставить("Характеристика", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Характеристика));
		НовСтр.Вставить("Цена", стрк.Цена);

		ТЧТовары.Добавить(НовСтр);
	КонецЦикла;
	
	definition.Вставить("ТЧТовары", ТЧТовары);

	
	//Таблица:	ВидыЗапасов	

	ТЧВидыЗапасов = Новый Массив;
	
	Для сч = 0 По обк.ВидыЗапасов.Количество()-1 Цикл
		
		стрк = обк.ВидыЗапасов[сч];
		
		НовСтр = Новый Структура;   
			
		НовСтр.Вставить("АналитикаРасходов", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.АналитикаРасходов));
		НовСтр.Вставить("АналитикаУчетаНоменклатуры", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.АналитикаУчетаНоменклатуры));
		НовСтр.Вставить("ВидЗапасов", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ВидЗапасов));
		НовСтр.Вставить("ВидЗапасовПолучателя", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ВидЗапасовПолучателя));
		НовСтр.Вставить("ИдентификаторСтроки", стрк.ИдентификаторСтроки);
		НовСтр.Вставить("Количество", стрк.Количество);
		НовСтр.Вставить("КоличествоПоРНПТ", стрк.КоличествоПоРНПТ);
		НовСтр.Вставить("КоличествоУпаковок", стрк.КоличествоУпаковок);
		НовСтр.Вставить("НомерГТД", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.НомерГТД));
		НовСтр.Вставить("Подразделение", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Подразделение));
		НовСтр.Вставить("ПоТоварамКОформлению", стрк.ПоТоварамКОформлению);
		НовСтр.Вставить("СписатьНаРасходы", стрк.СписатьНаРасходы);
		НовСтр.Вставить("СтавкаНДС", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.СтавкаНДС));
		НовСтр.Вставить("СтатьяРасходов", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.СтатьяРасходов));
		НовСтр.Вставить("СуммаВзаиморасчетов", стрк.СуммаВзаиморасчетов);
		НовСтр.Вставить("СуммаНДС", стрк.СуммаНДС);
		НовСтр.Вставить("СуммаНДСВзаиморасчетов", стрк.СуммаНДСВзаиморасчетов);
		НовСтр.Вставить("СуммаСНДС", стрк.СуммаСНДС);
		НовСтр.Вставить("УдалитьСтавкаНДС", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.УдалитьСтавкаНДС));
		НовСтр.Вставить("Упаковка", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Упаковка));

		ТЧВидыЗапасов.Добавить(НовСтр);
	КонецЦикла;
	
	definition.Вставить("ТЧВидыЗапасов", ТЧВидыЗапасов);
	
	//Таблица:	РасшифровкаПлатежаСКлиентом	

	ТЧРасшифровкаПлатежаСКлиентом = Новый Массив;
	
	Для сч = 0 По обк.РасшифровкаПлатежаСКлиентом.Количество()-1 Цикл
		
		стрк = обк.РасшифровкаПлатежаСКлиентом[сч];
		
		НовСтр = Новый Структура;   
			
		НовСтр.Вставить("ОбъектРасчетов", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ОбъектРасчетов));
		НовСтр.Вставить("Сумма", стрк.Сумма);
		НовСтр.Вставить("СуммаВзаиморасчетов", стрк.СуммаВзаиморасчетов);
		НовСтр.Вставить("УдалитьЗаказ", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.УдалитьЗаказ));

		ТЧРасшифровкаПлатежаСКлиентом.Добавить(НовСтр);
	КонецЦикла;
	
	definition.Вставить("ТЧРасшифровкаПлатежаСКлиентом", ТЧРасшифровкаПлатежаСКлиентом);

	
	//Таблица:	РасшифровкаПлатежаСПоставщиком

	ТЧРасшифровкаПлатежаСПоставщиком = Новый Массив;
	
	Для сч = 0 По обк.РасшифровкаПлатежаСПоставщиком.Количество()-1 Цикл
		
		стрк = обк.РасшифровкаПлатежаСПоставщиком[сч];
		
		НовСтр = Новый Структура;   
			
		НовСтр.Вставить("ОбъектРасчетов", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ОбъектРасчетов));
		НовСтр.Вставить("Сумма", стрк.Сумма);
		НовСтр.Вставить("СуммаВзаиморасчетов", стрк.СуммаВзаиморасчетов);
		НовСтр.Вставить("УдалитьЗаказ", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.УдалитьЗаказ));

		ТЧРасшифровкаПлатежаСПоставщиком.Добавить(НовСтр);
	КонецЦикла;
	
	definition.Вставить("ТЧРасшифровкаПлатежаСПоставщиком", ТЧРасшифровкаПлатежаСПоставщиком);

	
	//Таблица:	ДополнительныеРеквизиты   

	ТЧДополнительныеРеквизиты = Новый Массив;
	
	Для сч = 0 По обк.ДополнительныеРеквизиты.Количество()-1 Цикл
		
		стрк = обк.ДополнительныеРеквизиты[сч];
		
		НовСтр = Новый Структура;   
			
		НовСтр.Вставить("Значение", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Значение));
		НовСтр.Вставить("Свойство", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.Свойство));
		НовСтр.Вставить("ТекстоваяСтрока", стрк.ТекстоваяСтрока);

		ТЧДополнительныеРеквизиты.Добавить(НовСтр);
	КонецЦикла;
	
	definition.Вставить("ТЧДополнительныеРеквизиты", ТЧДополнительныеРеквизиты);

	//Таблица:	ШтрихкодыУпаковок  ШтрихкодыУпаковок 

	ТЧШтрихкодыУпаковок = Новый Массив;
	
	Для сч = 0 По обк.ШтрихкодыУпаковок.Количество()-1 Цикл
		
		стрк = обк.ШтрихкодыУпаковок[сч];
		
		НовСтр = Новый Структура;   
			
		НовСтр.Вставить("ШтрихкодУпаковки", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(стрк.ШтрихкодУпаковки));

		ТЧШтрихкодыУпаковок.Добавить(НовСтр);
	КонецЦикла;
	
	definition.Вставить("ТЧШтрихкодыУпаковок", ТЧШтрихкодыУпаковок);

	
	
	
	
	
	//------------------------------------------------------
	
	СтруктураОбъекта.Вставить("definition", definition);
	
	ЗаписатьJSON(ЗаписьJson, СтруктураОбъекта);
	json = ЗаписьJson.Закрыть();
	
	Возврат json;
	
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьОбъектыДляВыгрузки(Узел) Экспорт
	Возврат Неопределено;
КонецФункции

Функция getRoutingKey() Экспорт
	Возврат "doc";
КонецФункции




