Перем ОбъектЗаполнения Экспорт;

&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив) Экспорт
	Если НЕ ЗначениеЗаполнено(Объект.Документ) Тогда 
         Объект.Документ = ВладелецФормы.Объект.Ссылка;
    КонецЕсли;
    ОбъектЗаполнения=Объект.Документ;
	СоздатьДокументЗаказНаПеремещение(ОбъектЗаполнения);
	
	//ЗакрытиеФормы = Новый ОписаниеОповещения
	//	("ЗаполнениеПоВыбраннымПараметрам", ЭтаФорма); // Название процедуры, которая будет выполняться после закрытия формы "ЗапросПараметров"
	//ЗапросПараметров = ОткрытьФорму("ВнешняяОбработка.ЗаказНаПеремещениеНаОснованииВводаОстатковТовара.Форма.ЗапросПараметров"
	//	,,ОбъектЗаполнения,,,,ЗакрытиеФормы);
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнениеПоВыбраннымПараметрам(Результат, Параметры) Экспорт
    ОбъектЗаполнения = ЗаполнениеНаСервере(ОбъектЗаполнения, Результат); // Результат содержит структуру, полученную из формы "ЗапросПараметров"
    Если НЕ ВладелецФормы=Неопределено Тогда
        ВладелецФормы.Прочитать(); // Если обработка вызывалась из документа, то нужно перечитать изменения, чтобы пользователь видел результат обработки
    КонецЕсли;
КонецПроцедуры
 
&НаСервере
функция ЗаполнениеНаСервере(ОбъектЗаполнения, Параметры = Неопределено)
    Если ЗначениеЗаполнено(Объект.Документ) Тогда // Проверяем режим запуска: Через Открыть или из документа
        Док = Объект.Документ.ПолучитьОбъект();
	Иначе 
		Док = ОбъектЗаполнения;
	КонецЕсли;
	
	СоздатьДокументЗаказНаПеремещение(док);

КонецФункции


&НаСервере
Процедура СоздатьРезервНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СоздатьРезерв(Команда)
	СоздатьРезервНаСервере();
	ВыполнитьКоманду("", Объект.Документ);
КонецПроцедуры


&НаСервере
Процедура СоздатьДокументЗаказНаПеремещение(ВводОстатковСсылкаОбъект)
	
	
	ОбъектДанных = Документы.ЗаказНаПеремещение.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ОбъектДанных, ВводОстатковСсылкаОбъект, , "Номер,Дата");
	
	ОбъектДанных.Дата = ТекущаяДатаСеанса();
	
	ОбъектДанных.ПометкаУдаления = Ложь;
	
	ОбъектДанных.Комментарий = "Ввод остатков №"+строка(ВводОстатковСсылкаОбъект.Номер)+" от "+строка(ВводОстатковСсылкаОбъект.Дата);
	//ОбъектДанных.Номер = деф.Number;
	
	ОбъектДанных.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ОбъектДанных.Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению; 
	
	ОбъектДанных.СкладОтправитель = ВводОстатковСсылкаОбъект.Склад;

	ОбъектДанных.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
	
	ОбъектДанных.ЖелаемаяДатаПоступления = ОбъектДанных.Дата;

	ОбъектДанных.Товары.Очистить();
	
	счКодСтроки = 1;
	Для каждого строка из ВводОстатковСсылкаОбъект.Товары Цикл
		
		НоваяСтрока = ОбъектДанных.Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		//Если ЗаполненаСсылка(строка.Номенклатура) Тогда
		//	НоваяСтрока.Номенклатура = ПолучитьСсылкуСправочникаПоДаннымID(строка.Номенклатура, "Номенклатура");
		//КонецЕсли;
		//Если ЗаполненаСсылка(строка.Номенклатура) Тогда
		//	НоваяСтрока.Характеристика = ПолучитьСсылкуСправочникаПоДаннымID(строка.ХарактеристикаНоменклатуры, "ХарактеристикиНоменклатуры");
		//КонецЕсли;
		//
		//НоваяСтрока.Количество = строка.Количество; 
		//НоваяСтрока.КоличествоУпаковок = строка.Количество; 
		                    
		НоваяСтрока.НачалоОтгрузки = ОбъектДанных.Дата;
		
		НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;

		НоваяСтрока.КодСтроки = счКодСтроки;
		счКодСтроки = счКодСтроки + 1;
	КонецЦикла; 
	
	ОбъектДанных.ОбменДанными.Загрузка = ложь;
	Успешно = Ложь;
	Попытка
		ОбъектДанных.Записать(РежимЗаписиДокумента.Проведение);
		Успешно = Истина;
	Исключение
		т = ОписаниеОшибки();
	    сообщить("Ошибка проведения документа Заказ на перемещение: "+т);
	КонецПопытки;
	
	Если не успешно Тогда
		ОбъектДанных.Записать(РежимЗаписиДокумента.запись);
	КонецЕсли;
	
	сообщить("Создан документ Заказ на перемещение: "+строка(ОбъектДанных));
	
КонецПроцедуры


