
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	ТабДок.Вывести(Макет); 
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьСетку = Истина;
	ТабДок.Защита = Ложь;    
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетШтрихкоды");
	ТабДокШтрихкоды.Вывести(Макет); 
	ТабДокШтрихкоды.ТолькоПросмотр = Ложь;
	ТабДокШтрихкоды.ОтображатьСетку = Истина;
	ТабДокШтрихкоды.Защита = Ложь;    
	
	//Элементы.ВидОбъектаРегистрСведений.СписокВыбора.Добавить("ШтрихкодыНоменклатуры");
	
	Элементы.ВидОбъектаДокумент.СписокВыбора.Добавить("УстановкаЦенНоменклатуры");
	Элементы.ВидОбъектаДокумент.СписокВыбора.Добавить("РасходныйОрдерНаТовары");
	Элементы.ВидОбъектаДокумент.СписокВыбора.Добавить("ПеремещениеТоваров");
	Элементы.ВидОбъектаДокумент.СписокВыбора.Добавить("ЗаказКлиента");
	
	Элементы.ВидОбъектаСправочник.СписокВыбора.Добавить("Номенклатура");
	Элементы.ВидОбъектаСправочник.СписокВыбора.Добавить("ХарактеристикиНоменклатуры");
	Элементы.ВидОбъектаСправочник.СписокВыбора.Добавить("ФизическиеЛица");
	Элементы.ВидОбъектаСправочник.СписокВыбора.Добавить("СтруктураПредприятия");
	Элементы.ВидОбъектаСправочник.СписокВыбора.Добавить("Сотрудники");
	Элементы.ВидОбъектаСправочник.СписокВыбора.Добавить("КассыККМ");
	Элементы.ВидОбъектаСправочник.СписокВыбора.Добавить("ВидыЦен");
	Элементы.ВидОбъектаСправочник.СписокВыбора.Добавить("ВидыНоменклатуры");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыборВидаОбъекта = 0;
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВРэббитСразуНаСервере()
	ИдВызова = КСП_логгерСервер.СоздатьИдВызова(Неопределено, 
	"Выгрузка по данным SQL BINARY", ТекущаяДата(),
	"", Неопределено, Неопределено);   
	
	
	МассивБИН = Новый Массив;
	
	Для сч = 2 По ТабДок.ВысотаТаблицы Цикл
		
		бин = ТабДок.Область("R"+формат(сч,"ЧГ=;ЧРГ=")+"C1").Текст;
		Если СокрЛП(бин)="" Тогда
			Прервать;
		КонецЕсли;
		МассивБИН.Добавить(бин);
		
	КонецЦикла;
	
	Если ВыборВидаОбъекта = 0 Тогда
		ВидОбъекта = ВидОбъектаСправочник;
		ЭтоСправочник = Истина;
		
		РеквизитФормыВЗначение("Объект").ВыгрузитьВРэббитВсеГУИДЫ(ИдВызова, МассивБИН, ВидОбъекта, ЭтоСправочник);
		
	КонецЕсли;
	
	Если ВыборВидаОбъекта = 1 Тогда
		ВидОбъекта = ВидОбъектаДокумент;
		ЭтоСправочник = ложь;     
		
		РеквизитФормыВЗначение("Объект").ВыгрузитьВРэббитВсеГУИДЫ(ИдВызова, МассивБИН, ВидОбъекта, ЭтоСправочник);
		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВРэббитСразу(Команда)
	ВыгрузитьВРэббитСразуНаСервере();
	
	КСП_ЛоггерКлиент.ОткрытьОтчетПоЛогу(ИдВызова, Ложь, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьШтрихкодыВРэббит(Команда)
	ВыгрузитьШтрихкодыВРэббитНаСервере();
	
	КСП_ЛоггерКлиент.ОткрытьОтчетПоЛогу(ИдВызова, Ложь, ЭтаФорма);
КонецПроцедуры



&НаСервере
Процедура ВыгрузитьШтрихкодыВРэббитНаСервере()

	ИдВызова = КСП_логгерСервер.СоздатьИдВызова(Неопределено, 
	"Выгрузка Штрихкодов по данным SQL BINARY", ТекущаяДата(),
	"", Неопределено, Неопределено);   
	
	
	МассивБИН = Новый Массив;
	
	Для сч = 2 По ТабДокШтрихкоды.ВысотаТаблицы Цикл
		
		бин = ТабДокШтрихкоды.Область("R"+формат(сч,"ЧГ=;ЧРГ=")+"C1").Текст;
		Если СокрЛП(бин)="" Тогда
			Прервать;
		КонецЕсли;
		МассивБИН.Добавить(бин);
		
	КонецЦикла;
	
	РеквизитФормыВЗначение("Объект").ВыгрузитьВРэббитШтрихкоды(ИдВызова, МассивБИН);


КонецПроцедуры

