&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Ссылка = Об.ЗагрузитьИзJsonНаСервере(JsonText);
	СсылочныйТип = Ссылка;
    Возврат Ссылка;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	
	Адрес = "";
	Если ИмяКаталога <> "" Тогда        
		Колбэк = Новый ОписаниеОповещения("НачатьИмпорт", ЭтотОбъект);
		
		ОписанияПередаваемыхФайлов = Новый Массив;             
		
		массивФайлов = НайтиФАйлы(ИмяКаталога, "*.json", Ложь);
		Для каждого одинФайл Из массивФайлов Цикл
			ОдноОписание = Новый ОписаниеПередаваемогоФайла(одинФайл.ПолноеИмя);
			ОписанияПередаваемыхФайлов.Добавить(ОдноОписание);
		КонецЦикла;
		
		
		НачатьПомещениеФайловНаСервер(Колбэк,,,ОписанияПередаваемыхФайлов,ЭтаФорма.УникальныйИдентификатор);
		
	
	Иначе 
		
		Ссылка = ЗагрузитьИзJsonНаСервере();
		Сообщить(НСтр("ru = '"+строка(ссылка)+"'"), СтатусСообщения.БезСтатуса);
		
	КонецЕсли;
	
	
КонецПроцедуры

// параметры
//	МассивФайлов -  Массив объектов типа ОписаниеПомещенногоФайла, либо Неопределено, если помещение файлов было отменено.
 &НаКлиенте
Процедура НачатьИмпорт(МассивФайлов, Доп)  Экспорт 
	

	 
	Если МассивФайлов = Неопределено Тогда
		Возврат;
	КонецЕсли;    

	//ОписаниеПомещенногоФайла.Адрес
	//ОписаниеПомещенногоФайла.СсылкаНаФайл
	//	ИдентификаторФайла (FileID)
	//	Имя (Name)
	//	Расширение (Extension)
	//	Файл (File)

    идВызова = СоздатьИдВызова();
	
	Для каждого ОписаниеПомещенногоФайла Из МассивФайлов Цикл
		ЗагрузитьИзJsonНаСервереИзФайла(идВызова, ОписаниеПомещенногоФайла.Адрес);
	КонецЦикла;
	
	
КонецПроцедуры   

&НаСервере
Процедура ЗагрузитьИзJsonНаСервереИзФайла(идВызоваРодитель, Адрес)
	
идВызова = мис_ЛоггерСервер.СоздатьИдВызова(идВызоваРодитель, "Импорт ввода остатков товаров. Один документ. Интерактивный", ТекущаяДатаСеанса(),"Плагин", , Неопределено);

	обк=РеквизитФормыВЗначение("Объект");	
	Попытка
		обк.сетИдВызова(идВызова);
	Исключение
	    //Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	КонецПопытки;

	
	
	Ссылка = обк.ЗагрузитьИзJsonНаСервереИзФайла(Адрес);
	
	
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВводОстатковТоваров") Тогда
		Сообщить(НСтр("ru = '"+строка(ссылка)+"'"), СтатусСообщения.БезСтатуса);
	КонецЕсли;
	

КонецПроцедуры    

&НаСервере
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция СоздатьИдВызова()
	
	идВызова = мис_ЛоггерСервер.СоздатьИдВызова(Неопределено, "Импорт ввода остатков товаров. Интерактивный", ТекущаяДатаСеанса(),"Плагин", , Неопределено);
	
	возврат идВызова;
		
КонецФункции

