// чек-лист по доработке для другого вида объекта

// 1 поменять содержимое макета "Макет"


Перем КонтекстЯдра;
Перем Ожидаем;
Перем ИнтеграцияRetailCRM;

Перем ЭтоЗначениеЗаполняетсяПередЗапускомТеста;
Перем ЭтоЗначениеЗаполняетсяПослеЗапускаТеста;
Перем ТекстИсключенияПадающегоТеста;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	ИнтеграцияRetailCRM = КонтекстЯдра.Плагин("ИнтеграцияRetailCRM");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.Добавить("ТестИмпорта");
	//НаборТестов.Добавить("ТестДолжен_ПроверитьРезультатТестированияОтсутствующегоМетода");
	//НаборТестов.Добавить("ТестДолжен_ПроверитьВызов_ПослеЗапускаТеста");
	//НаборТестов.Добавить("ТестДолжен_ПроверитьВызов_ПослеЗапускаТеста_УПадающегоТеста");
	//НаборТестов.Добавить("ТестДолжен_ПроверитьРезультатТеста_Когда_ПередЗапускаТеста_СОшибкой");
	//НаборТестов.Добавить("ТестДолжен_ПроверитьРезультатТеста_Когда_ПослеЗапускаТеста_СОшибкой");
	
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	ЭтоЗначениеЗаполняетсяПередЗапускомТеста = Истина;
	ЭтоЗначениеЗаполняетсяПослеЗапускаТеста = Неопределено;
	
	НачатьТранзакцию();
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	ЭтоЗначениеЗаполняетсяПослеЗапускаТеста = Истина;
	
	ОтменитьТранзакцию();
КонецПроцедуры

Процедура ПередЗапускомТеста_СОшибкой() Экспорт
	ВызватьИсключение "ПередЗапускомТеста_СОшибкой";
КонецПроцедуры

Процедура ПослеЗапускаТеста_СОшибкой() Экспорт
	ВызватьИсключение "ПослеЗапускаТеста_СОшибкой";
КонецПроцедуры





// проверяет лишь факт выполнения метода плагина
Процедура ТестИмпорта() Экспорт
	
	// ид 24774
	json = ЭтотОбъект.ПолучитьМакет("Макет").ПолучитьТекст();   
	
	json = "[" + json + "]";
	
	ОбработкаRetailCRM = ИнтеграцияRetailCRM.ПолучитьОбработкуRetailCRM();
	
	СоответствиеЗаказы = crm_RetailCRMОбщий.UnJSONТест(json);
	
	ТЗБрони = Неопределено;
	ОбработкаRetailCRM.Мод_СозданиеЗаказов(СоответствиеЗаказы, ТЗБрони);

	объект = ОбработкаRetailCRM.УТ11_ВернутьДокументЗаказ ("24774");
	
	Ожидаем.Что(объект.СуммаДокумента).Равно(6999);
	Ожидаем.Что(НачалоДня(объект.Дата)).Равно('20231004');
	
	
КонецПроцедуры


 