// ЕНС. Заполнение происходит в форме, без записи объекта. Включается флаг Модифицированность у формы.

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполнитьКоманду("", Объект.Документ);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив)Экспорт
	
	ВыполнитьОбработку(ВладелецФормы.Объект.Ссылка);
	
	ВладелецФормы.Объект.Прочитать();
	
КонецПроцедуры

&НаСервереБезКонтекста
функция ВыполнитьОбработку(ДокСсылка)
	
	ДокОбъект = ДокСсылка.ПолучитьОбъект();
	
 	МестаУчета = РегистрыСведений.АналитикаУчетаНоменклатуры.МестаУчета(
		ДокОбъект.ХозяйственнаяОперация, ДокОбъект.Склад, Неопределено, Неопределено);
	ИменаПолей = РегистрыСведений.АналитикаУчетаНоменклатуры.ИменаПолейКоллекцииПоУмолчанию();
	ИменаПолей.СтатусУказанияСерий = "СтатусУказанияСерий";
	РегистрыСведений.АналитикаУчетаНоменклатуры.ЗаполнитьВКоллекции(ДокОбъект.Товары, МестаУчета, ИменаПолей);
	
	ДокОбъект.Записать();
	
КонецФункции

