
&НаСервере
Процедура ВыполнитьОтложенноеПроведениеНаСервере()
	РеквизитФормыВЗначение("Объект").ВыполнитьОтложенноеПроведение();
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьОтложенноеПроведение(Команда)
	ВыполнитьОтложенноеПроведениеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПровестиОдинДокументНаСервере()
	РеквизитФормыВЗначение("Объект").ПровестиОдинДокумент(ДокументСсылка);
КонецПроцедуры


&НаКлиенте
Процедура ПровестиОдинДокумент(Команда)
	ПровестиОдинДокументНаСервере();
КонецПроцедуры

