&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	тДок = ЗагрузитьИзJsonНаСервере();   
	
	//Сарычев
	Если тДок = Неопределено Тогда  
		Сообщить(НСтр("ru = '"+строка("Загрузка НЕ выполнена! Ошибка в JSON.")+"'"), СтатусСообщения.БезСтатуса);		
		Возврат; 
	ИначеЕсли тДок = 0 Тогда
		
	КонецЕсли;	
	//---
	
	Сообщить(НСтр("ru = '"+строка("Загрузка выполнена! Созданные документы помещены в таблицу на форме.")+"'"), СтатусСообщения.БезСтатуса);
	Если ТипЗнч(тДок) = Тип("ТекстовыйДокумент") Тогда
		тДок.Показать("Ненайденная в ЕРП номенклатура");
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	обк = РеквизитФормыВЗначение("Объект");
	обк.СобиратьНеНайденнуюНоменклатуру = Истина;
	СтруктураОтвета = обк.ЗагрузитьИзJsonНаСервере(JsonText, Неопределено);
	
	//Сарычев
	Если СтруктураОтвета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	
	//---
	
	ТЗДокументов.Очистить();
	
	Если ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда  
		Если СтруктураОтвета.Свойство("ПриобретениеТоваровУслуг") Тогда  
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.ПриобретениеТоваровУслуг;
		
		Иначе
			Сообщить("Не тот документ");
			Возврат Неопределено;
		КонецЕсли;    
		
	Иначе 	

		НовСтр = ТЗДокументов.Добавить();
		НовСтр.Документ = СтруктураОтвета;
	КонецЕсли;  
	
КонецФункции


&НаКлиенте
Процедура Тест_Схема_1_ПеремещениеНаФулфилмент(Команда)
	Тест_Схема_1_ПеремещениеНаФулфилментНаСервере();
КонецПроцедуры
&НаСервере
Процедура Тест_Схема_1_ПеремещениеНаФулфилментНаСервере()
	СтруктураОтвета = РеквизитФормыВЗначение("Объект").Тест_Схема_1_ПеремещениеНаФулфилмент(JsonText);
	ТЗДокументов.Очистить();
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.ЗаказНаПеремещение;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.РО;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.Перемещение;
КонецПроцедуры

&НаКлиенте
Процедура Тест_Схема_2_ПередачаНаКомиссию(Команда)
	Тест_Схема_2_ПередачаНаКомиссиюНаСервере();
КонецПроцедуры
&НаСервере
Процедура Тест_Схема_2_ПередачаНаКомиссиюНаСервере()
	СтруктураОтвета = РеквизитФормыВЗначение("Объект").Тест_Схема_2_ПередачаНаКомиссию(JsonText);
	ТЗДокументов.Очистить();
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.ЗаказКлиента;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.РО;
	НовСтр = ТЗДокументов.Добавить();
	НовСтр.Документ = СтруктураОтвета.РеализацияТоваровУслуг;
КонецПроцедуры






                          
