
&НаСервере
Функция ЗагрузитьИзJsonНаСервере()

	ИдВызова = СоздатьИдВызова();
	Об = РеквизитФормыВЗначение("Объект");
	
	об.сетИдВызова(ИдВызова);
	
	Результат = Об.ЗагрузитьИзJsonНаСервере(JsonText);
	Если Результат = Неопределено Тогда
		Возврат Документы.ОприходованиеИзлишковТоваров.ПустаяСсылка();
	Иначе
		Возврат Результат.ОприходованиеИзлишковТоваров;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	
	ДокСсылка = ЗагрузитьИзJsonНаСервере();

	мис_ЛоггерКлиент.ОткрытьОтчетПоЛогу(ИдВызова, Ложь, ЭтаФорма);
	
КонецПроцедуры



Функция СоздатьИдВызова()
	
	мидВызова = мис_ЛоггерСервер.СоздатьИдВызова(Неопределено, "Импорт Оприходование товаров. Интерактивный", ТекущаяДатаСеанса(),"Плагин", , Неопределено);
	
	возврат мидВызова;
		
КонецФункции
