

&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	Ссылка = РеквизитФормыВЗначение("Объект").ЗагрузитьИзJsonНаСервере(JsonText);
	СсылочныйТип = ссылка;
    Возврат Ссылка;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	Ссылка = ЗагрузитьИзJsonНаСервере();
	Сообщить(НСтр("ru = '"+строка(ссылка)+"'"), СтатусСообщения.БезСтатуса);
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьДокументы(Команда)
	ЗагрузитьДокументыНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьДокументыНаСервере()
	РеквизитФормыВЗначение("Объект").ВыполнитьИмпортДокументов();
КонецПроцедуры

