
&НаСервере
Функция ВыгрузитьОбъектНаСервере()
	json = РеквизитФормыВЗначение("Объект").ВыгрузитьОбъект(СсылочныйТип);
	return json;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьОбъект(Команда)
	json = ВыгрузитьОбъектНаСервере();
	message(json);
КонецПроцедуры





&НаСервере
Процедура СоздатьТестовыйОтчетОРознПродажахНаСервере()
	ДокОбк = Документы.ОтчетОРозничныхПродажах.СоздатьДокумент();
	
	ДокОбк.Дата = ТекущаяДатаСеанса();
	
	Докобк.Организация = справочники.Организации.ОрганизацияПоУмолчанию();
	
	// Табл части
	
	//товары
	новСтр = докОбк.Товары.Добавить();
	
	//ВидыЗапасов
	новСтр = докОбк.ВидыЗапасов.Добавить();

	//Серии
	новСтр = докОбк.Серии.Добавить();

	//АкцизныеМарки
	новСтр = докОбк.АкцизныеМарки.Добавить();

	//ОплатаПлатежнымиКартами
	новСтр = докОбк.ОплатаПлатежнымиКартами.Добавить();
	
	//ПодарочныеСертификаты
	новСтр = докОбк.ПодарочныеСертификаты.Добавить();

	//НачислениеБонусныхБаллов
	новСтр = докОбк.НачислениеБонусныхБаллов.Добавить();
	
	//ОплатаБонуснымиБаллами
	новСтр = докОбк.ОплатаБонуснымиБаллами.Добавить();

	// ФИНАЛ
	
	Докобк.ОбменДанными.Загрузка = Истина;
	ДокОбк.Записать();
	
	СсылочныйТип = ДокОбк.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТестовыйОтчетОРознПродажах(Команда)
	СоздатьТестовыйОтчетОРознПродажахНаСервере();
КонецПроцедуры
