&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		Выполнить("СерверRabbitMQ = Справочники.ксп_Серверы_RabbitMQ.ПустаяСсылка()");
	Исключение
	    Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	КонецПопытки;
	
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьИмпортНСИНаСервере()

	мИдВызова = Вычислить("мис_ЛоггерСервер.СоздатьИдВызова(, ""Импорт НСИ из УПП"", ТекущаяДатаСеанса(),"""", Неопределено, Неопределено)");
	
	РеквизитФормыВЗначение("Объект").ВыполнитьИмпортНСИ(мИдВызова, СерверRabbitMQ, ОчередьRabbitMQ);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИмпортНСИ(Команда)
	ВыполнитьИмпортНСИНаСервере();
	Выполнить("мис_ЛоггерКлиент.ОткрытьОтчетПоЛогу(мИдВызова, Ложь, Неопределено)");
КонецПроцедуры

&НаСервере
Процедура ВыполнитьИмпортДокументовНаСервере()

	мИдВызова = Вычислить("мис_ЛоггерСервер.СоздатьИдВызова(, ""Импорт Документов из УПП"", ТекущаяДатаСеанса(),"""", Неопределено, Неопределено)");

	РеквизитФормыВЗначение("Объект").ВыполнитьИмпортДокументов(мИдВызова, СерверRabbitMQ, ОчередьRabbitMQ);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИмпортДокументов(Команда)
	ВыполнитьИмпортДокументовНаСервере();
	Выполнить("мис_ЛоггерКлиент.ОткрытьОтчетПоЛогу(мИдВызова, Ложь, Неопределено)");
КонецПроцедуры

