&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		Выполнить("СерверRabbitMQ = Справочники.ксп_Серверы_RabbitMQ.ПустаяСсылка()");
	Исключение
	    Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	КонецПопытки;
	
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьИмпортНСИНаСервере()
	// Вставить содержимое обработчика. 
	мИдВызова = Вычислить("мис_ЛоггерСервер.getLogger(ИдВызова, ""Импорт НСИ из УПП"")");
	РеквизитФормыВЗначение("Объект").ВыполнитьИмпортНСИ(мИдВызова, СерверRabbitMQ, ОчередьRabbitMQ);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИмпортНСИ(Команда)
	ВыполнитьИмпортНСИНаСервере();
	Выполнить("мис_ЛоггерКлиент.ОткрытьОтчетПоЛогу(мИдВызова, Ложь, Неопределено)");
КонецПроцедуры

&НаСервере
Процедура ВыполнитьИмпортДокументовНаСервере()
	мИдВызова = Вычислить("мис_ЛоггерСервер.getLogger(ИдВызова, ""Импорт Документов из УПП"")");
	РеквизитФормыВЗначение("Объект").ВыполнитьИмпортДокументов(мИдВызова, СерверRabbitMQ, ОчередьRabbitMQ);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИмпортДокументов(Команда)
	ВыполнитьИмпортДокументовНаСервере();
	Выполнить("мис_ЛоггерКлиент.ОткрытьОтчетПоЛогу(мИдВызова, Ложь, Неопределено)");
КонецПроцедуры

