&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		Выполнить("СерверRabbitMQ = Справочники.ксп_Серверы_RabbitMQ.ПустаяСсылка()");
	Исключение
	    Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	КонецПопытки;
	
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьИмпортНСИНаСервере()
	// Вставить содержимое обработчика. 
	РеквизитФормыВЗначение("Объект").ВыполнитьИмпортНСИ();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИмпортНСИ(Команда)
	ВыполнитьИмпортНСИНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьИмпортДокументовНаСервере()
	// Вставить содержимое обработчика.
	РеквизитФормыВЗначение("Объект").ВыполнитьИмпортДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИмпортДокументов(Команда)
	ВыполнитьИмпортДокументовНаСервере();
КонецПроцедуры

