
Перем НЕ_ЗАГРУЖАТЬ;
Перем СОЗДАТЬ;
Перем ОБНОВИТЬ;
Перем ОТМЕНИТЬ_ПРОВЕДЕНИЕ;
Перем ПОМЕТИТЬ;

Перем мВнешняяСистема;
Перем мВнутренняяСистема;
Перем ИмяСобытияЖР;
Перем jsonText;

Перем СобиратьНенайденнуюНоменклатуру Экспорт; // дли интерактивного импорта
Перем НеНайденнаяНоменклатураМассив;

Перем мЛоггер;
Перем мИдВызова;

Перем мСкладОтправитель;
Перем мСкладПолучатель;
Перем мДоговор;


#Область ПодключениеОбработкиКБСП

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	
	ПараметрыРегистрации.Вставить("Вид",ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	ПараметрыРегистрации.Вставить("Версия","1.8");
	//ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование","СубПлагин_импорт_РеализацияТоваровУслуг_ПростаяПродажа");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация","СубПлагин_импорт_РеализацияТоваровУслуг_ПростаяПродажа");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "3.1.5.180");
	//ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	ТипКоманды = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();		
	ДобавитьКоманду(ПараметрыРегистрации.Команды, 
	"Открыть форму : СубПлагин_импорт_РеализацияТоваровУслуг_ПростаяПродажа",
	"Форма_СубПлагин_импорт_РеализацияТоваровУслуг_ПростаяПродажа",
	ТипКоманды, 
	Ложь) ;
	
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить() ;
	НоваяКоманда.Представление = Представление ;
	НоваяКоманда.Идентификатор = Идентификатор ;
	НоваяКоманда.Использование = Использование ;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение ;
	НоваяКоманда.Модификатор = Модификатор ;
КонецПроцедуры

#КонецОбласти


// Возвращает структуру. Поля различаются в зависимости от режима загрузки.
// Это нужно для отладки, а не для обычного режима работы.
//
Функция ЗагрузитьОбъект(СтруктураОбъекта, jsonText = "", СкладЕРП = Неопределено) Экспорт
	
	мЛоггер = Вычислить("мис_ЛоггерСервер.getLogger(мИдВызова, ""Импорт документов из УПП: РеализацияТоваровУслуг"")");
	
	Попытка
		
		Если НЕ СтруктураОбъекта.Свойство("type") Тогда // на случай, если передадут пустой объект
			мЛоггер.Варн("Нет свойства type в сообщении! Объект не загружен.");
			Возврат Неопределено;
		КонецЕсли;
		
		Если НЕ НРег(СтруктураОбъекта.type) = НРег("Документ.РеализацияТоваровУслуг") Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		id = СтруктураОбъекта.identification;
		деф = СтруктураОбъекта.definition;
		
		ВидОперации = "";
		НайденноеЗначение = "";
		Если деф.ВидОперации.свойство("Значение",НайденноеЗначение) Тогда
			ВидОперации = НайденноеЗначение;
		КонецЕсли;
		
		Контрагент = ксп_ИмпортСлужебный.НайтиКонтрагента(деф.Контрагент, мВнешняяСистема);
		УзелКонтрагента = Неопределено;
		
		мСкладОтправитель = складЕРП;
		
		////ЕНС. 2024-01-16. Договор теперь хранится в РС "КСП_КомиссионерыДляРеализацийУПП" для каждого контрагента
		ДоговорКонтрагента = ксп_ИмпортСлужебный.НайтиДоговор(деф.ДоговорКонтрагента, УзелКонтрагента, Контрагент);
		//ЭтоКомиссионер = РегистрыСведений.КСП_КомиссионерыДляРеализацийУПП.ЭтоКомиссионер(мВнешняяСистема, Контрагент, ДоговорКонтрагента, деф.date); 
		//мСкладПолучатель = РегистрыСведений.КСП_КомиссионерыДляРеализацийУПП.СкладПолучатель(мВнешняяСистема, Контрагент, ДоговорКонтрагента, деф.date);
		//мДоговор = РегистрыСведений.КСП_КомиссионерыДляРеализацийУПП.Договор(мВнешняяСистема, Контрагент, деф.date);
		
		Результат = Схема_1(СтруктураОбъекта);
		
		//*************************** Экспорт ненайденной номенклатуры ****************
		Если НеНайденнаяНоменклатураМассив.Количество()>0 Тогда
			ЗаписьJson = Новый ЗаписьJson;
			ЗаписьJson.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJson, НеНайденнаяНоменклатураМассив);
			jsonGoods = ЗаписьJson.Закрыть();
			
			МассивОбъектовJson = Новый Массив;
			МассивОбъектовJson.Добавить(jsonGoods);
			
			Попытка
				ксп_ЭкспортСлужебный.ВыполнитьЭкспорт_СписокJsonИзМассива( МассивОбъектовJson, "goods.guid" );
				Сообщить("Экспорт ненайденной номенклатуры: " + Строка(НеНайденнаяНоменклатураМассив.Количество()) + " записей");
			Исключение
				ТекстОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("ИмпортИзУПП", УровеньЖурналаРегистрации.Предупреждение,,,
					"Ошибка экспорта ненайденной номенклатуры в УПП. Подробности: " + ТекстОшибки);
			КонецПопытки;
		КонецЕсли;
		//***************************
		
		Возврат Результат;
		
	Исключение
		
		ТекстОшибки = ОписаниеОшибки();
		мЛоггер.ерр("Субплагин: Субплагин_RabbitMQ_импорт_из_УПП_Документ_РеализацияТоваровУслуг_ПростаяПродажа.
			|Подробности: " + ТекстОшибки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецФункции


#Область Схема_1

Функция Схема_1(СтруктураОбъекта) Экспорт
	//Заказ на перемещение (склад Щепкин - склад PFS), Расходный ордер на товар, Перемещение.
	
	id = СтруктураОбъекта.identification;
	деф = СтруктураОбъекта.definition;
	
	ПредставлениеДокументаИзУПП = "РеализацияТоваровУслуг (УПП) № " + деф.Number + " от " + строка(деф.Date);
	
	СуществующийЗаказСсылка 		= СоздатьПолучитьСсылкуДокумента(id.Ref, "ЗаказКлиента");
	СуществующийРОСсылка 			= СоздатьПолучитьСсылкуДокумента(id.Ref, "РасходныйОрдерНаТовары");
	РеализацияТоваровУслугСсылка	= СоздатьПолучитьСсылкуДокумента(id.Ref, "РеализацияТоваровУслуг");
	
	МассивСсылок = Новый Массив;
	
	МассивСсылок.Добавить(СуществующийЗаказСсылка);
	МассивСсылок.Добавить(СуществующийРОСсылка);
	МассивСсылок.Добавить(РеализацияТоваровУслугСсылка);
	
	// -------------------------------------------- БЛОКИРОВКА
	// не будем различать ситуации Новый/НеНовый
	Если ЗначениеЗаполнено(СуществующийЗаказСсылка.ВерсияДанных) Тогда
		ЭтоНовый = Ложь;
	Иначе
		ЭтоНовый = Истина;
	КонецЕсли;
	//Если НЕ ЭтоНовый Тогда
	Блокировка = ксп_Блокировки.СоздатьБлокировкуНесколькихОбъектов(МассивСсылок);
	//КонецЕсли;
	
	НачатьТранзакцию();
	
	//Если НЕ ЭтоНовый Тогда
	Попытка
		Блокировка.Заблокировать();
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,
			"Объект не загружен! Ошибка блокировки цепочки документов для " + ПредставлениеДокументаИзУПП + ". Подробности: " + ТекстОшибки);
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	//КонецЕсли;
	
	//------------------------------------- Заполнение реквизитов
	
	Действие = ксп_ИмпортСлужебный.ДействиеСДокументом(ЭтоНовый, СуществующийЗаказСсылка, деф);
	
	Результат = Новый Структура;
	//Результат.Вставить("ЗаказКлиента", Документы.ЗаказКлиента.ПустаяСсылка());
	//Результат.Вставить("РО", Документы.РасходныйОрдерНаТовары.ПустаяСсылка());
	//Результат.Вставить("РеализацияТоваровУслуг", Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	
	Если Действие = НЕ_ЗАГРУЖАТЬ Тогда
		ОтменитьТранзакцию();
		мЛоггер.инфо("Действие = НЕ Загружать. Документ пропущен: %1", ПредставлениеДокументаИзУПП);
		Результат.Вставить("ЗаказКлиента", СуществующийЗаказСсылка);
		Возврат Результат;
	КонецЕсли;

    // добавлено 2024-07-03
    Если Действие = ПОМЕТИТЬ Тогда
        ОбъектДанных = СуществующийЗаказСсылка.ПолучитьОбъект();
        ОбъектДанных.УстановитьПометкуУдаления(Истина);
        РегистрыСведений.ксп_ОтложенноеПроведение.УдалитьОтложенноеПроведение(СуществующийЗаказСсылка);//добавлено 2024-07-03
        ЗафиксироватьТранзакцию();
		Результат.Вставить("ЗаказКлиента", СуществующийЗаказСсылка);
		мЛоггер.дебаг("Действие = ПОМЕТИТЬ. Документ будет помечен на удаление: %1", ПредставлениеДокументаИзУПП);
		Возврат Результат;
	КонецЕсли;
		
	Если Действие = ОТМЕНИТЬ_ПРОВЕДЕНИЕ Тогда
		ОбъектДанных = СуществующийЗаказСсылка.ПолучитьОбъект();
		ОбъектДанных.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ЗафиксироватьТранзакцию();
		мЛоггер.инфо("Действие = Отменить проведение. Документ: %1", ПредставлениеДокументаИзУПП);
		Результат.Вставить("ЗаказКлиента", СуществующийЗаказСсылка);
		Возврат Результат;
	КонецЕсли;
	
	Если Действие = ОБНОВИТЬ Тогда
		ОбъектДанных = СуществующийЗаказСсылка.ПолучитьОбъект();
		мЛоггер.инфо("Действие = Обновить. Документ будет обновлен: %1", ПредставлениеДокументаИзУПП);
	ИначеЕсли Действие = СОЗДАТЬ Тогда
		ОбъектДанных = Документы.ЗаказКлиента.СоздатьДокумент();
		СсылкаНового = Документы.ЗаказКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор(id.Ref));
		ОбъектДанных.УстановитьСсылкуНового(СсылкаНового);
		мЛоггер.инфо("Действие = Создать. Документ будет создан: %1", ПредставлениеДокументаИзУПП);
	Иначе
		ОтменитьТранзакцию();
		ТекстСообщения = "Действие = Неизвестое действие: "+Строка(Действие)+". Документ: " + ПредставлениеДокументаИзУПП;
		мЛоггер.ерр(ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	//------------------------------------- Заполнение реквизитов
	Попытка
		//Сарычев
		//ЗаказНаПеремещениеОбъект = СоздатьЗаказНаПеремещение(СтруктураОбъекта, СуществующийЗаказСсылка);
		ЗаказКлиентаОбъект = СоздатьЗаказКлиента(СтруктураОбъекта, СуществующийЗаказСсылка, ОбъектДанных);
		
		РООбъект = СоздатьРасходныйОрдер(СтруктураОбъекта, СуществующийРОСсылка, ЗаказКлиентаОбъект);
		
		//ПеремещениеОбъект = СоздатьПеремещение(СтруктураОбъекта, СуществующийПеремещениеСсылка, РООбъект, ЗаказНаПеремещениеОбъект);
		РеализацияОбъект = СоздатьРеализацию(СтруктураОбъекта, РеализацияТоваровУслугСсылка, РООбъект, ЗаказКлиентаОбъект);
		
		Комментарий = "";
		
		РегистрыСведений.КСП_СвязьРеализацийУППиПередачиНаКомиссию.ДобавитьЗапись(
			мВнешняяСистема, 
			id.Ref, 
			ЗаказКлиентаОбъект.Ссылка, 
			РеализацияОбъект.Ссылка, 
			РООбъект.Ссылка,
			ПредставлениеДокументаИзУПП, 
			Комментарий);
			
		ЗафиксироватьТранзакцию();
		
		Результат.Вставить("ЗаказКлиента", ЗаказКлиентаОбъект.Ссылка);
		Результат.Вставить("РО", РООбъект.Ссылка);
		Результат.Вставить("РеализацияТоваровУслуг", РеализацияОбъект.Ссылка);
		
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,
			"Объект не загружен! Ошибка в процессе загрузки документа " + ПредставлениеДокументаИзУПП + ".
			|Подробности: " + ТекстОшибки);
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
//Функция СоздатьЗаказНаПеремещение(СтруктураОбъекта, СуществующийЗаказСсылка)
Функция СоздатьЗаказКлиента(СтруктураОбъекта, СуществующийЗаказСсылка, ОбъектДанных)
	
	id = СтруктураОбъекта.identification;
	деф = СтруктураОбъекта.definition;
	
	ПредставлениеДокументаИзУПП = "ЗаказКлиента (УПП РеализацияТоваровУслуг) № " + деф.Number + " от " + строка(деф.Date);
	
	//------------------------------------- Заполнение реквизитов -----------------------------------
	
	Если ЗначениеЗаполнено(СуществующийЗаказСсылка.ВерсияДанных) Тогда
		ЭтоНовый = Ложь;
	Иначе
		ЭтоНовый = Истина;
	КонецЕсли;
	
	Действие = ксп_ИмпортСлужебный.ДействиеСДокументом(ЭтоНовый, СуществующийЗаказСсылка, деф);
	
	Если Действие = НЕ_ЗАГРУЖАТЬ Тогда
		мЛоггер.инфо("Действие = НЕ Загружать. Документ пропущен: %1", ПредставлениеДокументаИзУПП);
		Возврат СуществующийЗаказСсылка;
	КонецЕсли;
	
    // добавлено 2024-07-03
    Если Действие = ПОМЕТИТЬ Тогда
        ОбъектДанных = СуществующийЗаказСсылка.ПолучитьОбъект();
        ОбъектДанных.УстановитьПометкуУдаления(Истина);
        РегистрыСведений.ксп_ОтложенноеПроведение.УдалитьОтложенноеПроведение(СуществующийЗаказСсылка);//добавлено 2024-07-03
        ЗафиксироватьТранзакцию();
		мЛоггер.дебаг("Действие = ПОМЕТИТЬ. Документ будет помечен на удаление: %1", ПредставлениеДокументаИзУПП);
		Возврат СуществующийЗаказСсылка;
	КонецЕсли;

	Если Действие = ОТМЕНИТЬ_ПРОВЕДЕНИЕ Тогда
		ОбъектДанных = СуществующийЗаказСсылка.ПолучитьОбъект();
		ОбъектДанных.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ЗафиксироватьТранзакцию();
		мЛоггер.инфо("Действие = Отменить проведение. Документ: %1", ПредставлениеДокументаИзУПП);
		Возврат СуществующийЗаказСсылка;
	КонецЕсли;
	
	Если Действие = ОБНОВИТЬ Тогда
		ОбъектДанных = СуществующийЗаказСсылка.ПолучитьОбъект();
		мЛоггер.инфо("Действие = Обновить. Документ будет обновлен: %1", ПредставлениеДокументаИзУПП);
	ИначеЕсли Действие = СОЗДАТЬ Тогда
		ОбъектДанных = Документы.ЗаказКлиента.СоздатьДокумент();
		СсылкаНового = Документы.ЗаказКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор(id.Ref));
		ОбъектДанных.УстановитьСсылкуНового(СсылкаНового);
		мЛоггер.инфо("Действие = Создать. Документ будет создан: %1", ПредставлениеДокументаИзУПП);
	Иначе
		ТекстСообщения = "Действие = Неизвестое действие: "+Строка(Действие)+". Документ: " + ПредставлениеДокументаИзУПП;
		мЛоггер.ерр(ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	Если деф.Свойство("Автор") Тогда 
		ЕстьАтрибут = деф.Автор.свойство("Ref","");
		Если ЕстьАтрибут Тогда
			//ОбъектДанных.Автор = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( деф.Автор.Ref ) );
			Сообщить("Ищем автора по ГУИДу");
			АвторУИД = деф.Автор.Ref;
			ОбъектДанных.Автор = Справочники.Пользователи.ПолучитьСсылку((Новый УникальныйИдентификатор(АвторУИД)));
			ОбъектДанных.Менеджер = Справочники.Пользователи.ПолучитьСсылку((Новый УникальныйИдентификатор(АвторУИД)));
		Иначе
			ОбъектДанных.Автор = Пользователи.ТекущийПользователь();
			ОбъектДанных.Менеджер = Пользователи.ТекущийПользователь();
		КонецЕсли;
	Иначе
		ОтветственныйПоУмолчанию = ксп_ИмпортСлужебный.ОтветственныйПоУмолчанию();
		ОбъектДанных.Автор = ОтветственныйПоУмолчанию;
		ОбъектДанных.Менеджер = ОтветственныйПоУмолчанию;
	КонецЕсли;
	// на случай, если есть метод поиска ссылки:
	//ОбъектДанных.Автор = ксп_ИмпортСлужебный.НайтиАвтор(деф.Автор);
	
	ОбъектДанных.АдресДоставки = деф.АдресДоставки;
	//	ОбъектДанных.АдресДоставкиЗначение = деф.АдресДоставкиЗначение;
	//	ОбъектДанных.АдресДоставкиЗначенияПолей = деф.АдресДоставкиЗначенияПолей;
	//	ОбъектДанных.АдресДоставкиПеревозчика = деф.АдресДоставкиПеревозчика;
	//	ОбъектДанных.АдресДоставкиПеревозчикаЗначение = деф.АдресДоставкиПеревозчикаЗначение;
	//	ОбъектДанных.АдресДоставкиПеревозчикаЗначенияПолей = деф.АдресДоставкиПеревозчикаЗначенияПолей;   
	
	//ОбъектДанных.Номер = деф.Number;
	ОбъектДанных.Дата = деф.Date;
	ОбъектДанных.ПометкаУдаления = деф.DeletionMark;
	ОбъектДанных.Организация = ксп_ИмпортСлужебный.НайтиОрганизацию(деф.Организация, мВнешняяСистема);
	////ОбъектДанных.Склад = ксп_ИмпортСлужебный.НайтиСклад(деф.Склад, мВнешняяСистема);
	//СкладУПП = Справочники.ксп_СкладыУПП.ПолучитьСсылку(Новый УникальныйИдентификатор(деф.Склад.Ref));
	//мСклад = Справочники.КСП_ВидыОперацийПоСкладамУПП.ПоМэппингу(СкладУПП);
	//Если НЕ ЗначениеЗаполнено(мСклад.ВерсияДанных) Тогда 
	//	СообщениеОбОшибке = ИнформацияОбОшибке();
	//	ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,
	//		"Объект не загружен! СкладУПП не найден! УИД склада: "+деф.Склад.Ref +
	//		Символы.ПС+ ПредставлениеДокументаИзУПП + ". Подробности: " + СообщениеОбОшибке);
	//	Возврат СуществующийДокСсылка;
	//КонецЕсли;
	ОбъектДанных.Склад = мСкладОтправитель;//мСклад
	
	ОбъектДанных.СкидкиРассчитаны = Истина;
	
	// на случай, если есть метод поиска ссылки:
	//ОбъектДанных.Приоритет = ксп_ИмпортСлужебный.НайтиПриоритет(деф.Приоритет);
	мПриоритет = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка("ПриоритетДляРТУ_схема_ПростаяПродажа", мВнешняяСистема);
	Если ЗначениеЗаполнено(мПриоритет) Тогда
		ОбъектДанных.Приоритет = мПриоритет;
	Иначе
		мЛоггер.Варн("Не заполнена настройка ПриоритетДляРТУ_схема_ПростаяПродажа в регистре ксп_ДополнительныеНастройкиИнтеграций
		|для %1. ", ПредставлениеДокументаИзУПП);
	КонецЕсли;
	
	ОбъектДанных.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке;
	// на случай, если есть метод поиска ссылки:
	//ОбъектДанных.Статус = ксп_ИмпортСлужебный.НайтиПеречисление_Статус(деф.Статус);
	//ОбъектДанных.Статус = ксп_ИмпортСлужебный.НайтиПеречисление(мВнешняяСистема, Объект, деф.Статус);
	
	//ОбъектДанных.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;    
	//*деф.ВидОперации.type = "Перечисление.ВидыОперацийРеализацияТоваров";
	///деф.ВидОперации.значение = "ПродажаКомиссия";
	ОбъектДанных.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;       
	// на случай, если есть метод поиска ссылки:
	//ОбъектДанных.ХозяйственнаяОперация = ксп_ИмпортСлужебный.НайтиПеречисление(мВнешняяСистема, Объект, деф.ХозяйственнаяОперация);
	
	//*деф.ВидПередачи.type = "Перечисление.ВидыПередачиТоваров";
	///деф.ВидОперации.значение = "ПоОрдеру";
	
	ОбъектДанных.Контрагент = ксп_ИмпортСлужебный.НайтиКонтрагента(деф.Контрагент, мВнешняяСистема);
	ОбъектДанных.Партнер = Справочники.Партнеры.НайтиПоНаименованию(Строка(ОбъектДанных.Контрагент));   //клиент    
	мСоглашение = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка(
		"СоглашениеСКлиентамиДляРеализацияТоваровСхемаПростаяПродажа", мВнешняяСистема);
	Если НЕ ЗначениеЗаполнено(мСоглашение)
		ИЛИ ( НЕ ЗначениеЗаполнено(мСоглашение.ВерсияДанных) 
		И ТипЗнч(мСоглашение) = Тип("СправочникСсылка.СоглашенияСКлиентами") ) Тогда 
		// так проверяем на битую ссылку
		ОбъектДанных.Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка();
		мЛоггер.ерр("Не заполнена настройка 
		|СоглашениеСКлиентамиДляРеализацияТоваровСхемаПростаяПродажа
		|в регистре ксп_ДополнительныеНастройкиИнтеграций
		|для %1. ", ПредставлениеДокументаИзУПП);
	Иначе
		ОбъектДанных.Соглашение = мСоглашение;
	КонецЕсли;
	
	//ОбъектДанных.Согласование = 
	//ОбъектДанных.Коллекция = 
	//ОбъектДанных.КаналСбыта = 
	//---
	ОбъектДанных.Валюта = ксп_ИмпортСлужебный.НайтиВалюту(деф.ВалютаДокумента.currencyCode);
	ОбъектДанных.Комментарий = СтрШаблон("схема ПростаяПродажа: [УПП РеализацияТоваровУслуг № %1 от %2 ]
		|Склад: %3
		|Оригинальный комментарий: %4",
		строка(деф.number),
		строка(деф.date),
		мСкладОтправитель,
		деф.Комментарий,);

	Если деф.УчитыватьНДС Тогда
		ОбъектДанных.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	Иначе
		ОбъектДанных.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
	КонецЕсли;	
	ОбъектДанных.ЦенаВключаетНДС = деф.СуммаВключаетНДС;
	
	ОбъектДанных.ДокументОснование = Неопределено;
	
	
	////------------------------------------------------------     ТЧ Товары
	
	ОбъектДанных.Товары.Очистить();
	
	Для счТовары = 0 По деф.ТЧТовары.Количество()-1 Цикл
		стрк = деф.ТЧТовары[счТовары];
		СтрокаТЧ = ОбъектДанных.Товары.Добавить();
		
		//////////////////////////////////////////         НЕНАЙДЕННАЯ НОМЕНКЛАТУРА (НАЧАЛО)
		
		Если стрк.Номенклатура.Свойство("identification") Тогда
			// это полный объект номенклатуры.
			ТэгНоменклатуры = стрк.Номенклатура.identification;
		Иначе 
			ТэгНоменклатуры = стрк.Номенклатура;
		КонецЕсли;
		
		_Номенклатура = ксп_ИмпортСлужебный.НайтиНоменклатуру(ТэгНоменклатуры);
		
		Если ТипЗнч(_Номенклатура) = Тип("СправочникСсылка.Номенклатура") И
			НЕ ЗначениеЗаполнено(_Номенклатура.ВерсияДанных) Тогда
			
			НомГУИД = "";
			Если ТэгНоменклатуры.Свойство("Ref", НомГУИД) Тогда
				Если НеНайденнаяНоменклатураМассив.Найти(НомГУИД) = Неопределено Тогда
					НеНайденнаяНоменклатураМассив.Добавить(НомГУИД);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТЧ.Номенклатура = _Номенклатура;
		
		///////////////////////////////////////////         НЕНАЙДЕННАЯ НОМЕНКЛАТУРА (КОНЕЦ)
		
		СтрокаТЧ.Количество = стрк.Количество;
		СтрокаТЧ.КоличествоУпаковок = стрк.Количество;
		СтрокаТЧ.Характеристика = ксп_ИмпортСлужебный.НайтиХарактеристику(стрк.ХарактеристикаНоменклатуры);
		СтрокаТЧ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
		
		СтрокаТЧ.СтавкаНДС = ксп_ИмпортСлужебный.ОпределитьСтавкуНДСПоПеречислениюУПП(стрк.СтавкаНДС);
		СтрокаТЧ.Цена = стрк.Цена;
		СтрокаТЧ.СуммаНДС = стрк.СуммаНДС;
		СтрокаТЧ.Сумма = стрк.Сумма;      
		СтрокаТЧ.СуммаСНДС = стрк.Сумма + стрк.СуммаНДС; 
		
		СтрокаТЧ.ДатаОтгрузки = ОбъектДанных.Дата;
	КонецЦикла; 
	
	//------------------------------------------------------     ТЧ Услуги
		
	Для счУслуги = 0 По деф.ТЧУслуги.Количество()-1 Цикл
		стрк = деф.ТЧУслуги[счУслуги];
		СтрокаТЧ = ОбъектДанных.Товары.Добавить();
		
		СтрокаТЧ.Номенклатура = ксп_ИмпортСлужебный.НайтиНоменклатуру(стрк.Номенклатура);
		СтрокаТЧ.Количество = стрк.Количество;
		СтрокаТЧ.КоличествоУпаковок = стрк.Количество;
		
		СтрокаТЧ.СтавкаНДС = ксп_ИмпортСлужебный.ОпределитьСтавкуНДСПоПеречислениюУПП(стрк.СтавкаНДС);
		СтрокаТЧ.Цена = стрк.Цена;
		СтрокаТЧ.СуммаНДС = стрк.СуммаНДС;
		СтрокаТЧ.Сумма = стрк.Сумма;      
		СтрокаТЧ.СуммаСНДС = стрк.Сумма + стрк.СуммаНДС;
		СтрокаТЧ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется;		
		
		СтрокаТЧ.ДатаОтгрузки = ОбъектДанных.Дата;
		
	КонецЦикла;
	
	
	//------------------------------------------------------ ФИНАЛ	
	
	Попытка
		
		ОбъектДанных.ОбменДанными.Загрузка = Ложь;
		ОбъектДанных.ДополнительныеСвойства.Вставить("НеРегистрироватьКОбменуRabbitMQ", Истина);
		Если ОбъектДанных.Проведен Тогда
			ОбъектДанных.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе 
			ОбъектДанных.Записать();
		КонецЕсли;
		
		// Документ будет помещен в Отложенное проведение
		jsonText = "";
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_01(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_02(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_03(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_04(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_05(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		
	Исключение
		
		СообщениеОбОшибке=ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,
			"Объект не загружен! Ошибка в процессе загрузки документа "+ПредставлениеДокументаИзУПП+".
			|Подробности: "+СообщениеОбОшибке);
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		мЛоггер.ерр("Ошибка загрузки документа (УПП): %1.
			|Подробности: %2", ПредставлениеДокументаИзУПП, СообщениеОбОшибке);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат ОбъектДанных;
	
КонецФункции

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция СоздатьРасходныйОрдер(СтруктураОбъекта, СуществующийРОСсылка, ЗаказНаПеремещениеОбъект)
	
	id = СтруктураОбъекта.identification;
	деф = СтруктураОбъекта.definition;
	
	ПредставлениеДокументаИзУПП = "РасходныйОрдерНаТовары (УПП РеализацияТоваровУслуг) № " + деф.Number + " от " + строка(деф.Date);
	
	//------------------------------------- Заполнение реквизитов
	
	Если ЗначениеЗаполнено(СуществующийРОСсылка.ВерсияДанных) Тогда
		ЭтоНовый = Ложь;
	Иначе
		ЭтоНовый = Истина;
	КонецЕсли;
	
	Действие = ксп_ИмпортСлужебный.ДействиеСДокументом(ЭтоНовый, СуществующийРОСсылка, деф);
	
	Если Действие = НЕ_ЗАГРУЖАТЬ Тогда
		мЛоггер.инфо("Действие = НЕ Загружать. Документ пропущен: %1", ПредставлениеДокументаИзУПП);
		Возврат СуществующийРОСсылка;
	КонецЕсли;
	
    // добавлено 2024-07-03
    Если Действие = ПОМЕТИТЬ Тогда
        ОбъектДанных = СуществующийРОСсылка.ПолучитьОбъект();
        ОбъектДанных.УстановитьПометкуУдаления(Истина);
        РегистрыСведений.ксп_ОтложенноеПроведение.УдалитьОтложенноеПроведение(СуществующийРОСсылка);//добавлено 2024-07-03
        ЗафиксироватьТранзакцию();
		мЛоггер.дебаг("Действие = ПОМЕТИТЬ. Документ будет помечен на удаление: %1", ПредставлениеДокументаИзУПП);
		Возврат СуществующийРОСсылка;
	КонецЕсли;

	Если Действие = ОТМЕНИТЬ_ПРОВЕДЕНИЕ Тогда
		ОбъектДанных = СуществующийРОСсылка.ПолучитьОбъект();
		ОбъектДанных.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ЗафиксироватьТранзакцию();
		мЛоггер.инфо("Действие = Отменить проведение. Документ: %1", ПредставлениеДокументаИзУПП);
		Возврат СуществующийРОСсылка;
	КонецЕсли;
	
	Если Действие = ОБНОВИТЬ Тогда
		ОбъектДанных = СуществующийРОСсылка.ПолучитьОбъект();
		мЛоггер.инфо("Действие = Обновить. Документ будет обновлен: %1", ПредставлениеДокументаИзУПП);
	ИначеЕсли Действие = СОЗДАТЬ Тогда
		ОбъектДанных = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
		СсылкаНового = Документы.РасходныйОрдерНаТовары.ПолучитьСсылку(Новый УникальныйИдентификатор(id.Ref));
		ОбъектДанных.УстановитьСсылкуНового(СсылкаНового);
		мЛоггер.инфо("Действие = Создать. Документ будет создан: %1", ПредставлениеДокументаИзУПП);
	Иначе
		ТекстСообщения = "Действие = Неизвестое действие: "+Строка(Действие)+". Документ: " + ПредставлениеДокументаИзУПП;
		мЛоггер.ерр(ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	//ОбъектДанных.Номер = деф.Number;
	ОбъектДанных.Дата = деф.Date;
	ОбъектДанных.ПометкаУдаления = деф.DeletionMark;
	
	//ОбъектДанных.Получатель = мСкладПолучатель; //Сарычев Не соотв.тип
	
	//ОбъектДанных.Склад = ксп_ИмпортСлужебный.НайтиСклад(деф.Склад, мВнешняяСистема);
	ОбъектДанных.Склад = мСкладОтправитель; 
	//	ОбъектДанных.ГрузоПолучатель = мСкладПолучатель; //Сарычев Не соотв.тип
	
	ОбъектДанных.СкладскаяОперация = перечисления.СкладскиеОперации.ОтгрузкаКлиенту;
	ОбъектДанных.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
	
	//ОбъектДанных.ВсегоМест = деф.ВсегоМест;
	
	ОбъектДанных.ДатаОтгрузки = деф.Date;
	ОбъектДанных.Приоритет = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка("ПриоритетДляРТУ_схема_ПростаяПродажа", мВнешняяСистема);  
	мПриоритет = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка("ПриоритетДляРТУ_схема_ПростаяПродажа", мВнешняяСистема);
	Если ЗначениеЗаполнено(мПриоритет) Тогда
		ОбъектДанных.Приоритет = мПриоритет;
	Иначе
		мЛоггер.ерр("Не заполнена настройка ПриоритетДляРТУ_схема_ПростаяПродажа в регистре ксп_ДополнительныеНастройкиИнтеграций
		|для %1. ", ПредставлениеДокументаИзУПП);
	КонецЕсли;
	ОбъектДанных.Комментарий = СтрШаблон("схема ПростаяПродажа: [УПП РеализацияТоваровУслуг № %1 от %2 ]
		|Склад: %3
		|Оригинальный комментарий: %4",
		строка(деф.number),
		строка(деф.date),
		мСкладОтправитель,
		деф.Комментарий,);
	
	//ОбъектДанных.Ответственный = ;
	
	//гуид="";
	//ЕстьАтрибут = деф.ЗаданиеНаПеревозку.свойство("Ref",гуид);
	//Если ЕстьАтрибут Тогда
	//	ОбъектДанных.ЗаданиеНаПеревозку = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( деф.ЗаданиеНаПеревозку.Ref ) );
	//Иначе
	//	ОбъектДанных.ЗаданиеНаПеревозку = Неопределено;
	//КонецЕсли;
	//// на случай, если есть метод поиска ссылки:
	//ОбъектДанных.ЗаданиеНаПеревозку = ксп_ИмпортСлужебный.НайтиЗаданиеНаПеревозку(деф.ЗаданиеНаПеревозку);
	
	//гуид="";
	//ЕстьАтрибут = деф.ЗонаОтгрузки.свойство("Ref",гуид);
	//Если ЕстьАтрибут Тогда
	//	ОбъектДанных.ЗонаОтгрузки = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( деф.ЗонаОтгрузки.Ref ) );
	//Иначе
	//	ОбъектДанных.ЗонаОтгрузки = Неопределено;
	//КонецЕсли;
	//// на случай, если есть метод поиска ссылки:
	//ОбъектДанных.ЗонаОтгрузки = ксп_ИмпортСлужебный.НайтиЗонаОтгрузки(деф.ЗонаОтгрузки);
	
	//гуид="";
	//ЕстьАтрибут = деф.Контролер.свойство("Ref",гуид);
	//Если ЕстьАтрибут Тогда
	//	ОбъектДанных.Контролер = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( деф.Контролер.Ref ) );
	//Иначе
	//	ОбъектДанных.Контролер = Неопределено;
	//КонецЕсли;
	//// на случай, если есть метод поиска ссылки:
	//ОбъектДанных.Контролер = ксп_ИмпортСлужебный.НайтиКонтролер(деф.Контролер);
	
	//гуид="";
	//ЕстьАтрибут = деф.Ответственный.свойство("Ref",гуид);
	//Если ЕстьАтрибут Тогда
	//	ОбъектДанных.Ответственный = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( деф.Ответственный.Ref ) );
	//Иначе
	//	ОбъектДанных.Ответственный = Неопределено;
	//КонецЕсли;
	//// на случай, если есть метод поиска ссылки:
	//ОбъектДанных.Ответственный = ксп_ИмпортСлужебный.НайтиОтветственный(деф.Ответственный);
	
	//ОбъектДанных.ОтгрузкаПоЗаданиюНаПеревозку = деф.ОтгрузкаПоЗаданиюНаПеревозку;
	
	//гуид="";
	//ЕстьАтрибут = деф.Получатель.свойство("Ref",гуид);
	//Если ЕстьАтрибут Тогда
	//	ОбъектДанных.Получатель = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( деф.Получатель.Ref ) );
	//Иначе
	//	ОбъектДанных.Получатель = Неопределено;
	//КонецЕсли;
	
	//гуид="";
	//ЕстьАтрибут = деф.Помещение.свойство("Ref",гуид);
	//Если ЕстьАтрибут Тогда
	//	ОбъектДанных.Помещение = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( деф.Помещение.Ref ) );
	//Иначе
	//	ОбъектДанных.Помещение = Неопределено;
	//КонецЕсли;
	
	// на случай, если есть метод поиска ссылки:
	//ОбъектДанных.Помещение = ксп_ИмпортСлужебный.НайтиПомещение(деф.Помещение);
	
	//ОбъектДанных.ПорядокДоставки = деф.ПорядокДоставки;
	//ОбъектДанных.РежимПросмотраПоТоварам = деф.РежимПросмотраПоТоварам;
	
	
	////------------------------------------------------------     ТЧ ТоварыПоРаспоряжениям
	
	Если деф.ТЧТовары.Количество() >0 Тогда
		
		ОбъектДанных.ТоварыПоРаспоряжениям.Очистить();
		
		Для счТовары = 0 По деф.ТЧТовары.Количество()-1 Цикл
			стрк = деф.ТЧТовары[счТовары];
			СтрокаТЧ = ОбъектДанных.ТоварыПоРаспоряжениям.Добавить();
			
			СтрокаТЧ.Номенклатура = ксп_ИмпортСлужебный.НайтиНоменклатуру(стрк.Номенклатура);
			СтрокаТЧ.Характеристика = ксп_ИмпортСлужебный.НайтиХарактеристику(стрк.ХарактеристикаНоменклатуры);
			СтрокаТЧ.Количество = стрк.Количество;
			СтрокаТЧ.Распоряжение = ЗаказНаПеремещениеОбъект.Ссылка;
		КонецЦикла;
		
	КонецЕсли;
	
	//	гуид="";
	//	ЕстьАтрибут = стрк.Назначение.свойство("Ref",гуид);
	//	Если ЕстьАтрибут Тогда
	//		СтрокаТЧ.Назначение = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.Назначение.Ref ) );
	//	Иначе
	//		СтрокаТЧ.Назначение = Неопределено;
	//	КонецЕсли;
	//	// на случай, если есть метод поиска ссылки:
	//	СтрокаТЧ.Назначение = ксп_ИмпортСлужебный.НайтиНазначение(стрк.Назначение);
	
	//	гуид="";
	//	ЕстьАтрибут = стрк.Номенклатура.свойство("Ref",гуид);
	//	Если ЕстьАтрибут Тогда
	//		СтрокаТЧ.Номенклатура = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.Номенклатура.Ref ) );
	//	Иначе
	//		СтрокаТЧ.Номенклатура = Неопределено;
	//	КонецЕсли;
	
	//	гуид="";
	//	ЕстьАтрибут = стрк.Распоряжение.свойство("Ref",гуид);
	//	Если ЕстьАтрибут Тогда
	//		СтрокаТЧ.Распоряжение = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.Распоряжение.Ref ) );
	//	Иначе
	//		СтрокаТЧ.Распоряжение = Неопределено;
	//	КонецЕсли;
	
	
	//	гуид="";
	//	ЕстьАтрибут = стрк.Серия.свойство("Ref",гуид);
	//	Если ЕстьАтрибут Тогда
	//		СтрокаТЧ.Серия = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.Серия.Ref ) );
	//	Иначе
	//		СтрокаТЧ.Серия = Неопределено;
	//	КонецЕсли;
	
	// на случай, если есть метод поиска ссылки:
	//	СтрокаТЧ.Серия = ксп_ИмпортСлужебный.НайтиСерия(стрк.Серия);
	
	//	СтрокаТЧ.СтатусУказанияСерий = стрк.СтатусУказанияСерий;
	
	//	гуид="";
	//	ЕстьАтрибут = стрк.Характеристика.свойство("Ref",гуид);
	//	Если ЕстьАтрибут Тогда
	//		СтрокаТЧ.Характеристика = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.Характеристика.Ref ) );
	//	Иначе
	//		СтрокаТЧ.Характеристика = Неопределено;
	//	КонецЕсли;
	
	//КонецЦикла;
	
	////------------------------------------------------------     ТЧ ОтгружаемыеТовары
	
	ОбъектДанных.ОтгружаемыеТовары.Очистить();
	
	Для счТовары = 0 По деф.ТЧТовары.Количество()-1 Цикл
		стрк = деф.ТЧТовары[счТовары];
		СтрокаТЧ = ОбъектДанных.ОтгружаемыеТовары.Добавить();
		
		СтрокаТЧ.Номенклатура = ксп_ИмпортСлужебный.НайтиНоменклатуру(стрк.Номенклатура);
		СтрокаТЧ.Характеристика = ксп_ИмпортСлужебный.НайтиХарактеристику(стрк.ХарактеристикаНоменклатуры);
		СтрокаТЧ.Количество = стрк.Количество;
		СтрокаТЧ.КоличествоУпаковок = стрк.Количество;
		СтрокаТЧ.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
		
		
		//	_знч = "";
		//	ЕстьЗначение = стрк.Действие.свойство("Значение",_знч);
		//	Если ЕстьЗначение Тогда
		//		СтрокаТЧ.Действие = стрк.Действие.Значение;
		//	Иначе
		//		СтрокаТЧ.Действие = Неопределено;
		//	КонецЕсли;
		
		//	СтрокаТЧ.Количество = стрк.Количество;
		//	СтрокаТЧ.КоличествоУпаковок = стрк.КоличествоУпаковок;
		
		//	гуид="";
		//	ЕстьАтрибут = стрк.Назначение.свойство("Ref",гуид);
		//	Если ЕстьАтрибут Тогда
		//		СтрокаТЧ.Назначение = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.Назначение.Ref ) );
		//	Иначе
		//		СтрокаТЧ.Назначение = Неопределено;
		//	КонецЕсли;
		
		// на случай, если есть метод поиска ссылки:
		//	СтрокаТЧ.Назначение = ксп_ИмпортСлужебный.НайтиНазначение(стрк.Назначение);
		
		//	гуид="";
		//	ЕстьАтрибут = стрк.Номенклатура.свойство("Ref",гуид);
		//	Если ЕстьАтрибут Тогда
		//		СтрокаТЧ.Номенклатура = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.Номенклатура.Ref ) );
		//	Иначе
		//		СтрокаТЧ.Номенклатура = Неопределено;
		//	КонецЕсли;
		
		// на случай, если есть метод поиска ссылки:
		//	СтрокаТЧ.Номенклатура = ксп_ИмпортСлужебный.НайтиНоменклатура(стрк.Номенклатура);
		
		//	гуид="";
		//	ЕстьАтрибут = стрк.Серия.свойство("Ref",гуид);
		//	Если ЕстьАтрибут Тогда
		//		СтрокаТЧ.Серия = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.Серия.Ref ) );
		//	Иначе
		//		СтрокаТЧ.Серия = Неопределено;
		//	КонецЕсли;
		
		// на случай, если есть метод поиска ссылки:
		//	СтрокаТЧ.Серия = ксп_ИмпортСлужебный.НайтиСерия(стрк.Серия);
		
		//	СтрокаТЧ.СтатусУказанияСерий = стрк.СтатусУказанияСерий;
		
		//	гуид="";
		//	ЕстьАтрибут = стрк.Упаковка.свойство("Ref",гуид);
		//	Если ЕстьАтрибут Тогда
		//		СтрокаТЧ.Упаковка = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.Упаковка.Ref ) );
		//	Иначе
		//		СтрокаТЧ.Упаковка = Неопределено;
		//	КонецЕсли;
		
		// на случай, если есть метод поиска ссылки:
		//	СтрокаТЧ.Упаковка = ксп_ИмпортСлужебный.НайтиУпаковка(стрк.Упаковка);
		
		//	гуид="";
		//	ЕстьАтрибут = стрк.УпаковочныйЛист.свойство("Ref",гуид);
		//	Если ЕстьАтрибут Тогда
		//		СтрокаТЧ.УпаковочныйЛист = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.УпаковочныйЛист.Ref ) );
		//	Иначе
		//		СтрокаТЧ.УпаковочныйЛист = Неопределено;
		//	КонецЕсли;
		
		// на случай, если есть метод поиска ссылки:
		//	СтрокаТЧ.УпаковочныйЛист = ксп_ИмпортСлужебный.НайтиУпаковочныйЛист(стрк.УпаковочныйЛист);
		
		//	гуид="";
		//	ЕстьАтрибут = стрк.УпаковочныйЛистРодитель.свойство("Ref",гуид);
		//	Если ЕстьАтрибут Тогда
		//		СтрокаТЧ.УпаковочныйЛистРодитель = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.УпаковочныйЛистРодитель.Ref ) );
		//	Иначе
		//		СтрокаТЧ.УпаковочныйЛистРодитель = Неопределено;
		//	КонецЕсли;
		
		// на случай, если есть метод поиска ссылки:
		//	СтрокаТЧ.УпаковочныйЛистРодитель = ксп_ИмпортСлужебный.НайтиУпаковочныйЛистРодитель(стрк.УпаковочныйЛистРодитель);
		
		//	гуид="";
		//	ЕстьАтрибут = стрк.Характеристика.свойство("Ref",гуид);
		//	Если ЕстьАтрибут Тогда
		//		СтрокаТЧ.Характеристика = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.Характеристика.Ref ) );
		//	Иначе
		//		СтрокаТЧ.Характеристика = Неопределено;
		//	КонецЕсли;
		
		// на случай, если есть метод поиска ссылки:
		//	СтрокаТЧ.Характеристика = ксп_ИмпортСлужебный.НайтиХарактеристика(стрк.Характеристика);
		
		//	СтрокаТЧ.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста = стрк.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста;
		
		//	СтрокаТЧ.ЭтоУпаковочныйЛист = стрк.ЭтоУпаковочныйЛист;
		
	КонецЦикла;
	
	////------------------------------------------------------     ТЧ ДополнительныеРеквизиты
	
	//ОбъектДанных.ДополнительныеРеквизиты.Очистить();
	
	//Для счТовары = 0 По деф.ТЧДополнительныеРеквизиты.Количество()-1 Цикл
	//	стрк = деф.ТЧДополнительныеРеквизиты[счТовары];
	//	СтрокаТЧ = ОбъектДанных.ДополнительныеРеквизиты.Добавить();
	
	
	//	гуид="";
	//	ЕстьАтрибут = стрк.Значение.свойство("Ref",гуид);
	//	Если ЕстьАтрибут Тогда
	//		СтрокаТЧ.Значение = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.Значение.Ref ) );
	//	Иначе
	//		СтрокаТЧ.Значение = Неопределено;
	//	КонецЕсли;
	//	// на случай, если есть метод поиска ссылки:
	//	СтрокаТЧ.Значение = ксп_ИмпортСлужебный.НайтиЗначение(стрк.Значение);
	
	//	гуид="";
	//	ЕстьАтрибут = стрк.Свойство.свойство("Ref",гуид);
	//	Если ЕстьАтрибут Тогда
	//		СтрокаТЧ.Свойство = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.Свойство.Ref ) );
	//	Иначе
	//		СтрокаТЧ.Свойство = Неопределено;
	//	КонецЕсли;
	//	// на случай, если есть метод поиска ссылки:
	//	СтрокаТЧ.Свойство = ксп_ИмпортСлужебный.НайтиСвойство(стрк.Свойство);
	
	//	СтрокаТЧ.ТекстоваяСтрока = стрк.ТекстоваяСтрока;
	
	//КонецЦикла;
	
	////------------------------------------------------------     ТЧ ШтрихкодыУпаковок
	
	
	//ОбъектДанных.ШтрихкодыУпаковок.Очистить();
	
	//Для счТовары = 0 По деф.ТЧШтрихкодыУпаковок.Количество()-1 Цикл
	//	стрк = деф.ТЧШтрихкодыУпаковок[счТовары];
	//	СтрокаТЧ = ОбъектДанных.ШтрихкодыУпаковок.Добавить();
	
	//	гуид="";
	//	ЕстьАтрибут = стрк.ШтрихкодУпаковки.свойство("Ref",гуид);
	//	Если ЕстьАтрибут Тогда
	//		СтрокаТЧ.ШтрихкодУпаковки = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( стрк.ШтрихкодУпаковки.Ref ) );
	//	Иначе
	//		СтрокаТЧ.ШтрихкодУпаковки = Неопределено;
	//	КонецЕсли;
	//	// на случай, если есть метод поиска ссылки:
	//	СтрокаТЧ.ШтрихкодУпаковки = ксп_ИмпортСлужебный.НайтиШтрихкодУпаковки(стрк.ШтрихкодУпаковки);
	
	//КонецЦикла;
	
	//------------------------------------------------------ ФИНАЛ
	
	Попытка
		
		ОбъектДанных.ОбменДанными.Загрузка = Ложь;
		ОбъектДанных.ДополнительныеСвойства.Вставить("НеРегистрироватьКОбменуRabbitMQ", Истина);
		Если ОбъектДанных.Проведен Тогда
			ОбъектДанных.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе 
			ОбъектДанных.Записать();
		КонецЕсли;
		
		// Документ будет помещен в Отложенное проведение
		jsonText = "";
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_01(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_02(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_03(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_04(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_05(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		
	Исключение
		
		СообщениеОбОшибке=ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,
			"Объект не загружен! Ошибка в процессе загрузки документа "+ПредставлениеДокументаИзУПП+".
			|Подробности: "+СообщениеОбОшибке);
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		мЛоггер.ерр("Ошибка загрузки документа (УПП): %1.
			|Подробности: %2", ПредставлениеДокументаИзУПП, СообщениеОбОшибке);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат ОбъектДанных;
	
КонецФункции

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
//Функция СоздатьПеремещение(СтруктураОбъекта, СуществующийПеремещениеСсылка, РООбъект, ЗаказНаПеремещениеОбъект)
Функция СоздатьРеализацию(СтруктураОбъекта, РеализацияТоваровУслугСсылка, РООбъект, ЗаказКлиентаОбъект)
	
	id = СтруктураОбъекта.identification;
	деф = СтруктураОбъекта.definition;
	
	ПредставлениеДокументаИзУПП = "РеализацияТоваровУслуг (УПП РеализацияТоваровУслуг) № " + деф.Number + " от " + строка(деф.Date);
	
	//------------------------------------- Заполнение реквизитов
	
	Если ЗначениеЗаполнено(РеализацияТоваровУслугСсылка.ВерсияДанных) Тогда
		ЭтоНовый = Ложь;
	Иначе
		ЭтоНовый = Истина;
	КонецЕсли;
	
	Действие = ксп_ИмпортСлужебный.ДействиеСДокументом(ЭтоНовый, РеализацияТоваровУслугСсылка, деф);
	
	Если Действие = НЕ_ЗАГРУЖАТЬ Тогда
		мЛоггер.инфо("Действие = НЕ Загружать. Документ пропущен: %1", ПредставлениеДокументаИзУПП);
		Возврат РеализацияТоваровУслугСсылка;
	КонецЕсли;
	
    // добавлено 2024-07-03
    Если Действие = ПОМЕТИТЬ Тогда
        ОбъектДанных = РеализацияТоваровУслугСсылка.ПолучитьОбъект();
        ОбъектДанных.УстановитьПометкуУдаления(Истина);
        РегистрыСведений.ксп_ОтложенноеПроведение.УдалитьОтложенноеПроведение(РеализацияТоваровУслугСсылка);//добавлено 2024-07-03
        ЗафиксироватьТранзакцию();
		мЛоггер.дебаг("Действие = ПОМЕТИТЬ. Документ будет помечен на удаление: %1", ПредставлениеДокументаИзУПП);
		Возврат РеализацияТоваровУслугСсылка;
	КонецЕсли;

	Если Действие = ОТМЕНИТЬ_ПРОВЕДЕНИЕ Тогда
		ОбъектДанных = РеализацияТоваровУслугСсылка.ПолучитьОбъект();
		ОбъектДанных.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ЗафиксироватьТранзакцию();
		мЛоггер.инфо("Действие = Отменить проведение. Документ: %1", ПредставлениеДокументаИзУПП);
		Возврат РеализацияТоваровУслугСсылка;
	КонецЕсли;
	
	Если Действие = ОБНОВИТЬ Тогда
		ОбъектДанных = РеализацияТоваровУслугСсылка.ПолучитьОбъект();
		мЛоггер.инфо("Действие = Обновить. Документ будет обновлен: %1", ПредставлениеДокументаИзУПП);
	ИначеЕсли Действие = СОЗДАТЬ Тогда
		ОбъектДанных = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		СсылкаНового = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(id.Ref));
		ОбъектДанных.УстановитьСсылкуНового(СсылкаНового);
		мЛоггер.инфо("Действие = Создать. Документ будет создан: %1", ПредставлениеДокументаИзУПП);
	Иначе
		ТекстСообщения = "Действие = Неизвестое действие: "+Строка(Действие)+". Документ: " + ПредставлениеДокументаИзУПП;
		мЛоггер.ерр(ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ОтветственныйПоУмолчанию = ксп_ИмпортСлужебный.ОтветственныйПоУмолчанию(); //?
	Если деф.Свойство("Автор") Тогда 
		ЕстьАтрибут = деф.Автор.свойство("Ref","");
		Если ЕстьАтрибут Тогда
			//ОбъектДанных.Автор = Справочники_Документы.КакойТоВидМД.ПолучитьСсылку( Новый УникальныйИдентификатор( деф.Автор.Ref ) );
			Сообщить("Ищем автора по ГУИДу");
			ОбъектДанных.Автор    = Справочники.Пользователи.ПолучитьСсылку((Новый УникальныйИдентификатор(деф.Автор.Ref)));
			ОбъектДанных.Менеджер = Справочники.Пользователи.ПолучитьСсылку((Новый УникальныйИдентификатор(деф.Автор.Ref)));
		Иначе
			ОбъектДанных.Автор = ОтветственныйПоУмолчанию;
			ОбъектДанных.Менеджер = ОтветственныйПоУмолчанию;
		КонецЕсли;
	Иначе
		ОбъектДанных.Автор    = ОтветственныйПоУмолчанию;
		ОбъектДанных.Менеджер = ОтветственныйПоУмолчанию;
	КонецЕсли;
	// на случай, если есть метод поиска ссылки:
	//ОбъектДанных.Автор = ксп_ИмпортСлужебный.НайтиАвтор(деф.Автор);
	
	//ОбъектДанных.Номер = деф.Number;
	ОбъектДанных.Дата = деф.Date;
	ОбъектДанных.ПометкаУдаления = деф.DeletionMark;
	ОбъектДанных.Организация = ксп_ИмпортСлужебный.НайтиОрганизацию(деф.Организация, мВнешняяСистема);
	
	//	ОбъектДанных.ЗаказНаПеремещение = ЗаказНаПеремещениеОбъект.Ссылка;
	ОбъектДанных.ЗаказКлиента = ЗаказКлиентаОбъект.Ссылка;
	//ОбъектДанных.Склад = ксп_ИмпортСлужебный.НайтиСклад(деф.Склад, мВнешняяСистема);
	ОбъектДанных.Склад = мСкладОтправитель;
	
	ОбъектДанных.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	ОбъектДанных.СкидкиРассчитаны = Истина;
	ОбъектДанных.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам;
	
	мБанковскийСчетОрганизации = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(
		ОбъектДанных.Организация);
	ОбъектДанных.БанковскийСчетОрганизации = мБанковскийСчетОрганизации;
	
	ОбъектДанных.ДатаВозвратаМногооборотнойТары = деф.Date;
	ОбъектДанных.КурсЗнаменатель = 1;
	ОбъектДанных.КурсЧислитель = 1;
	
	ОбъектДанных.Контрагент = ксп_ИмпортСлужебный.НайтиКонтрагента(деф.Контрагент, мВнешняяСистема);
	ОбъектДанных.Партнер = ОбъектДанных.Контрагент.Партнер;
	
	мСоглашение = РегистрыСведений.ксп_ДополнительныеНастройкиИнтеграций.Настройка(
		"СоглашениеСКлиентамиДляРеализацияТоваровСхемаПростаяПродажа", мВнешняяСистема);
	Если НЕ ЗначениеЗаполнено(мСоглашение)
		ИЛИ ( НЕ ЗначениеЗаполнено(мСоглашение.ВерсияДанных) 
		И ТипЗнч(мСоглашение) = Тип("СправочникСсылка.СоглашенияСКлиентами") ) Тогда 
		// так проверяем на битую ссылку
		ОбъектДанных.Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка();
		мЛоггер.ерр("Не заполнена настройка 
		|СоглашениеСКлиентамиДляРеализацияТоваровСхемаПростаяПродажа
		|в регистре ксп_ДополнительныеНастройкиИнтеграций
		|для %1. ", ПредставлениеДокументаИзУПП);
	Иначе
		ОбъектДанных.Соглашение = мСоглашение;
	КонецЕсли;
	
	//ОбъектДанных.Коллекция = 
	//ОбъектДанных.КаналСбыта = 
	
	ОбъектДанных.Валюта = ксп_ИмпортСлужебный.НайтиВалюту(деф.ВалютаДокумента.currencyCode);
	ОбъектДанных.ВалютаВзаиморасчетов = ксп_ИмпортСлужебный.НайтиВалюту(деф.ВалютаДокумента.currencyCode);
	ОбъектДанных.Комментарий = СтрШаблон("схема ПростаяПродажа: [УПП РеализацияТоваровУслуг № %1 от %2 ]
		|Склад: %3
		|Оригинальный комментарий: %4",
		строка(деф.number),
		строка(деф.date),
		мСкладОтправитель,
		деф.Комментарий,);
	
	Если деф.УчитыватьНДС Тогда
		ОбъектДанных.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	Иначе
		ОбъектДанных.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
	КонецЕсли;	
	ОбъектДанных.ЦенаВключаетНДС = деф.СуммаВключаетНДС;
	
	//	ОбъектДанных.ПеремещениеПоЗаказам = Истина;
	ОбъектДанных.РеализацияПоЗаказам = Истина; 
	
	ОбъектДанных.Основание = деф.ОснованиеТекст;   
	Если ЗначениеЗаполнено(деф.ОснованиеТекст) Тогда
		ОснованиеДатаНачало = СтрНайти(деф.ОснованиеТекст, " от ");
		ОснованиеТекст = Сред(деф.ОснованиеТекст,ОснованиеДатаНачало+4,10); 
		ОснованиеТекстДень = Лев(ОснованиеТекст,2);
		ОснованиеТекстМесяц = Сред(ОснованиеТекст,4,2);
		ОснованиеТекстГод = Сред(ОснованиеТекст,7,4);	
		ОснованиеДатаТекст = ОснованиеТекстГод + ОснованиеТекстМесяц + ОснованиеТекстДень + "00" + "00" + "01";
		Попытка 
			ОД = Дата(ОснованиеДатаТекст);
			Если ТипЗнч(ОД) = ТипЗнч("Дата") Тогда
				ОбъектДанных.ОснованиеДата = Дата(ОснованиеДатаТекст);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		ОснованиеНомерНачало = СтрНайти(деф.ОснованиеТекст, " ",,1,1);
		ОснованиеНомерКонец = СтрНайти(деф.ОснованиеТекст, " ",,1,2);
		ОбъектДанных.ОснованиеНомер = Сред(деф.ОснованиеТекст,ОснованиеНомерНачало,ОснованиеНомерКонец - ОснованиеНомерНачало);
	КонецЕсли;
	
	// ЕНС пока не заполняем. Нужно изучить поведение документов в режиме отладки
	//ОбъектДанных.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;
	
	//ОбъектДанных.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ОбъектДанных.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	
	Если деф.ОтпускПроизвел.Свойство("Ref") Тогда
		ОбъектДанных.Отпустил = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(деф.ОтпускПроизвел));
	КонецЕсли;
	
	////------------------------------------------------------     ТЧ Товары
	//Если деф.ТЧТовары.Количество() > 1 Тогда //Сарычев
	//	ОбъектДанных.Товары.Очистить();
	//	
	//	Для счТовары = 0 По деф.ТЧТовары.Количество()-1 Цикл
	//		стрк = деф.ТЧТовары[счТовары];
	//		СтрокаТЧ = ОбъектДанных.Товары.Добавить();
	//		
	//		СтрокаТЧ.Номенклатура = ксп_ИмпортСлужебный.НайтиНоменклатуру(стрк.Номенклатура);
	//		СтрокаТЧ.Количество = стрк.Количество;
	//		СтрокаТЧ.КоличествоУпаковок = стрк.Количество;
	//		СтрокаТЧ.Характеристика = ксп_ИмпортСлужебный.НайтиХарактеристику(стрк.ХарактеристикаНоменклатуры);
	//		СтрокаТЧ.ЗаказКлиента = ЗаказКлиентаОбъект.Ссылка;
	//		
	//		СтрокаТЧ.СтавкаНДС = ксп_ИмпортСлужебный.ОпределитьСтавкуНДСПоПеречислениюУПП(стрк.СтавкаНДС);
	//		СтрокаТЧ.Цена = стрк.Цена;
	//		СтрокаТЧ.СуммаНДС = стрк.СуммаНДС;
	//		СтрокаТЧ.Сумма = стрк.Сумма;      
	//		СтрокаТЧ.СуммаСНДС = стрк.Сумма + стрк.СуммаНДС;
	//		
	//		//СтрокаТЧ.ДатаОтгрузки = ОбъектДанных.Дата;
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	ОбъектДанных.Товары.Очистить();
	
	Для каждого стрк Из ЗаказКлиентаОбъект.Товары Цикл
		СтрокаТЧ = ОбъектДанных.Товары.Добавить();
		
		СтрокаТЧ.Номенклатура = стрк.Номенклатура;
		СтрокаТЧ.Количество = стрк.Количество;
		СтрокаТЧ.КоличествоУпаковок = стрк.Количество;
		СтрокаТЧ.Характеристика = стрк.Характеристика;
		СтрокаТЧ.ЗаказКлиента = ЗаказКлиентаОбъект.Ссылка;
		
		СтрокаТЧ.СтавкаНДС = стрк.СтавкаНДС;
		СтрокаТЧ.Цена = стрк.Цена;
		СтрокаТЧ.СуммаНДС = стрк.СуммаНДС;
		СтрокаТЧ.Сумма = стрк.Сумма;      
		СтрокаТЧ.СуммаСНДС = стрк.СуммаСНДС;
		
		СтрокаТЧ.КодСтроки = стрк.КодСтроки;
	КонецЦикла;
	
	
	//------------------------------------------------------ ФИНАЛ
	
	Попытка
		
		ОбъектДанных.ОбменДанными.Загрузка = Ложь;
		ОбъектДанных.ДополнительныеСвойства.Вставить("НеРегистрироватьКОбменуRabbitMQ", Истина);
		Если ОбъектДанных.Проведен Тогда
			ОбъектДанных.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе 
			ОбъектДанных.Записать();
		КонецЕсли;
		
		// Документ будет помещен в Отложенное проведение
		jsonText = "";
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_01(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_02(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_03(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_04(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		ксп_ИмпортСлужебный.Документы_ПослеИмпорта_05(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ЭтотОбъект);
		
	Исключение
		
		СообщениеОбОшибке=ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,
			"Объект не загружен! Ошибка в процессе загрузки документа "+ПредставлениеДокументаИзУПП+".
			|Подробности: "+СообщениеОбОшибке);
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		мЛоггер.ерр("Ошибка загрузки документа (УПП): %1.
			|Подробности: %2", ПредставлениеДокументаИзУПП, СообщениеОбОшибке);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат ОбъектДанных;
	
КонецФункции


#КонецОбласти


#Область Тестирование

// вызывается из формы
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ЗагрузитьИзJsonНаСервере(JsonText) export
	
	мЧтениеJSON = Новый ЧтениеJSON;
	мЧтениеJSON.УстановитьСтроку(JsonText);	
	СтруктураОбъекта = ПрочитатьJSON(мЧтениеJSON,,,,"ФункцияВосстановленияJSON",ЭтотОбъект);//структура
	
	//Если ТипЗнч(СтруктураОбъекта) = Тип("Массив") Тогда  //Сарычев
	Если ТипЗнч(СтруктураОбъекта) = Тип("Структура") Тогда //Сарычев
		
		НеНайденнаяНоменклатураМассив = Новый Массив;
		
		//Для Каждого эл из СтруктураОбъекта Цикл
		//	ЗагрузитьОбъект(эл);
		//КонецЦикла;
		
		Рез = Новый Структура;		
		Рез = ЗагрузитьОбъект(СтруктураОбъекта); //Сарычев
		Рез.Вставить("НеНайденнаяНоменклатураМассив", НеНайденнаяНоменклатураМассив);
		Возврат Рез; 
		
	Иначе       
		Рез = Новый Структура;
		Рез = ЗагрузитьОбъект(СтруктураОбъекта);
		Возврат Рез;
	КонецЕсли;
	
	
КонецФункции 

Функция ФункцияВосстановленияJSON(Свойство, Значение, ДопПараметры) Экспорт
	
	Если Свойство = "Date"Тогда
		Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
	КонецЕсли;
	Если Свойство = "Период"Тогда
		Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
	КонецЕсли;
	Если Свойство = "Сумма" Тогда
		Если ТипЗнч(Значение) = Тип("Число") Тогда
			Возврат Значение;
		Иначе
			Возврат XMLЗначение(Тип("Число"),Значение);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

// Описание_метода
//
// Параметры:
//	ГУИД 	- строка - 36 симв
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция СоздатьПолучитьСсылкуДокумента(ГУИД, ВидОбъекта)
	
	СуществующийОбъект = Документы[ВидОбъекта].ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	
	Если ЗначениеЗаполнено(СуществующийОбъект.ВерсияДанных) Тогда
		Возврат СуществующийОбъект;
	Иначе 
		
		ОбъектДанных = Документы[ВидОбъекта].СоздатьДокумент();
		СсылкаНового = Документы[ВидОбъекта].ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
		ОбъектДанных.УстановитьСсылкуНового(СсылкаНового);
		
		Возврат ОбъектДанных.Ссылка;
	КонецЕсли;	
	
КонецФункции

// Используется в  ксп_ИмпортСлужебный.ПроверитьКачествоДанных()
//
// Параметры:
//  ДокументОбъект  - ДокументСсылка - <описание параметра>
//
// Возвращаемое значение:
//  ТЗ, Колонки:
//   * ИмяТЧ
//   * ИмяКолонки
//
Функция ТабличныеЧастиДляПроверки(ДокументСсылка = Неопределено) Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ИмяТЧ");
	ТЗ.Колонки.Добавить("ИмяКолонки");
	
	Если ДокументСсылка = Неопределено 
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказКлиента")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		НовСтр = ТЗ.Добавить();
		НовСтр.ИмяТЧ = "Товары";
		НовСтр.ИмяКолонки = "Номенклатура";
		НовСтр = ТЗ.Добавить();
		НовСтр.ИмяТЧ = "Товары";
		НовСтр.ИмяКолонки = "Характеристика";
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
		
		НовСтр = ТЗ.Добавить();
		НовСтр.ИмяТЧ = "ТоварыПоРаспоряжениям";
		НовСтр.ИмяКолонки = "Номенклатура";
		НовСтр = ТЗ.Добавить();
		НовСтр.ИмяТЧ = "ТоварыПоРаспоряжениям";
		НовСтр.ИмяКолонки = "Характеристика";
		
		НовСтр = ТЗ.Добавить();
		НовСтр.ИмяТЧ = "ОтгружаемыеТовары";
		НовСтр.ИмяКолонки = "Номенклатура";
		НовСтр = ТЗ.Добавить();
		НовСтр.ИмяТЧ = "ОтгружаемыеТовары";
		НовСтр.ИмяКолонки = "Характеристика";
		
	КонецЕсли;
	
	Возврат ТЗ;
	
КонецФункции

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция МассивРеквизитовШапкиДляПроверки() Экспорт
	
	мРеквизиты = Новый Массив;
	//мРеквизиты.Добавить("Склад");
	//мРеквизиты.Добавить("Организация");
	Возврат мРеквизиты;
	
КонецФункции

Функция сетИдВызова(пИдВызова) Экспорт
	
	мИдВызова = пИдВызова;
	Возврат ЭтотОбъект;
	
КонецФункции


мВнешняяСистема = "upp";
ИмяСобытияЖР = "Импорт_из_RabbitMQ_УПП";

СобиратьНенайденнуюНоменклатуру = Истина;
НеНайденнаяНоменклатураМассив = Новый Массив;

НЕ_ЗАГРУЖАТЬ = 1;
СОЗДАТЬ = 2;
ОБНОВИТЬ = 3;
ОТМЕНИТЬ_ПРОВЕДЕНИЕ = 4;
ПОМЕТИТЬ = 5;
