&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НадписьВерсия = РеквизитФормыВЗначение("Объект").СведенияОВнешнейОбработке().Версия;
	идВызова = мис_логгерСервер.СоздатьИдВызова(Неопределено, "Импорт физлиц из файлов интерактивно",
	ТекущаяДата(),
	"Внеш обработка Плагин УПП",Неопределено, Неопределено);

КонецПроцедуры




// ТОЧКА ВХОДА
&НаКлиенте
Асинх Процедура ЗагрузитьИзJson(Команда)   
	
		
	Если ИмяКаталога = "" Тогда        
		
		ЗагрузитьИзJsonНаСервере();
		
		Возврат;
		
	КонецЕсли;
	
	
	///////    АСИНХ
	
	
	
	массивФайлов = НайтиФайлы(ИмяКаталога, "*.json", Ложь);   
	
	Если массивФайлов.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Файлы закончились!");
		Возврат;		
	КонецЕсли;  
	
	ВсегоФайлов = массивФайлов.Количество();
	Загружено = 0;
	
	ОписанияПередаваемыхФайлов = Новый Массив;   
	Для сч = -массивФайлов.Количество() + 1 по 0 Цикл
		одинФайл = массивФайлов [-сч];
		ОдноОписание = Новый ОписаниеПередаваемогоФайла(одинФайл.ПолноеИмя);
		ОписанияПередаваемыхФайлов.Добавить(ОдноОписание);
		массивФайлов.Удалить(-сч);
		
		Попытка
			Если ОписанияПередаваемыхФайлов.Количество() = РазмерПорцииФайлов ИЛИ массивФайлов.Количество() = 0 Тогда
				ОписаниеОповещенияПередНачалом = Неопределено;
				ОписаниеОповещенияОХодеВыполнения = Неопределено;
				
				//Результат выполнения обещания - массив объектов типа ОписаниеПомещенногоФайла, либо Неопределено, если помещение файлов было отменено.
				Обещание = ПоместитьФайлыНаСерверАсинх(
					ОписаниеОповещенияОХодеВыполнения, 
					ОписаниеОповещенияПередНачалом, 
					ОписанияПередаваемыхФайлов, 
					ЭтаФорма.УникальныйИдентификатор);
					
				МассивФайловПомещенных = Ждать Обещание;
				
				Если МассивФайловПомещенных = Неопределено Тогда
					Возврат;
				КонецЕсли;    

				//ОписаниеПомещенногоФайла.Адрес
				//ОписаниеПомещенногоФайла.СсылкаНаФайл
				//	ИдентификаторФайла (FileID)
				//	Имя (Name)
				//	Расширение (Extension)
				//	Файл (File)

				МассивАдресов = Новый Массив;
				Для каждого ОписаниеПомещенногоФайла Из МассивФайловПомещенных Цикл	
					МассивАдресов.Добавить(ОписаниеПомещенногоФайла.Адрес);
				КонецЦикла;        
				
				ЗагрузитьИзJsonНаСервереИзКаталога(МассивАдресов);
				
				ПереместитьФайлыВПапкуОбработанных(МассивФайловПомещенных);
				
				Загружено = Загружено + ОписанияПередаваемыхФайлов.Количество();
				сообщить("загрузили  файлов: "+строка(Загружено)+" из "+строка(ВсегоФайлов));

				ОписанияПередаваемыхФайлов.Очистить();
				
			КонецЕсли;
		Исключение
		    Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
			ОписанияПередаваемыхФайлов = Новый Массив;
		КонецПопытки;
		
	КонецЦикла;

	ПредупреждениеАсинх("Загрузка физлиц завершена!");
		
КонецПроцедуры   



&НаСервере
Процедура ЗагрузитьИзJsonНаСервереИзКаталога(МассивАдресов)
	
	ПараметрыВызова = Неопределено;
	_идВызова = мис_ЛоггерСервер.СоздатьИдВызова(ИдВызова, "Импорт физлиц. Интерактивный", ТекущаяДатаСеанса(),"Плагин", , Неопределено);
	обк=РеквизитФормыВЗначение("Объект");	
	Попытка
		обк.сетИдВызова(_идВызова);
	Исключение
	    //Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	КонецПопытки;
	

	//Для каждого Адрес Из МассивАдресов Цикл
	//	обк.ЗагрузитьИзJsonНаСервереИзФайла(Адрес, ВидНоменклатуры, Обновлять);
	//КонецЦикла;
	
	обк.ЗагрузитьИзJsonНаСервереИзМассиваАдресов(МассивАдресов, ВидНоменклатуры, Обновлять);
	

КонецПроцедуры

// Описание_метода
//
// Параметры:
//	МассивФайлов 	- массив -  массив объектов Новый ОписаниеПередаваемогоФайла(одинФайл.ПолноеИмя);
//
&НаКлиенте
Процедура ПереместитьФайлыВПапкуОбработанных(МассивФайлов)
//ОписаниеПомещенногоФайла.Адрес
//ОписаниеПомещенногоФайла.СсылкаНаФайл
//	ИдентификаторФайла (FileID)
//	Имя (Name)
//	Расширение (Extension)
//	Файл (File)

	Для каждого ОписаниеПомещенногоФайла Из МассивФайлов Цикл	
		//МассивАдресов.Добавить(ОписаниеПомещенногоФайла.Адрес);
		Источник = ИмяКаталога + "\"+ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
		Приемник = ИмяКаталога + "\processed\"+ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
		ПереместитьФайл(Источник, Приемник);
	КонецЦикла;        

		
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьИзJsonНаСервере()

	Ссылка = РеквизитФормыВЗначение("Объект").ЗагрузитьИзJsonНаСервере(JsonText, ВидНоменклатуры);
	

КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ИмяФайла = "C:\1C\НоменклатураИзУПП.json";
	ИмяКаталога = "c:\1C\УПП_Выгрузка_Один_Вид_Справ";
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЛог(Команда)
	мис_логгерКлиент.ОткрытьОтчетПоЛогу(ИдВызова, Ложь, ЭтотОбъект);
КонецПроцедуры






