Перем мCоединение;
Перем мКоннектор;

&НаСервере
Процедура ПроверитьПодключениеНаСервере() 
	
	ПодключениеКБазе1С(ПутьКБазе, Пользователь, Пароль = "", Сервер, БазаДанных)    ;     
	
	Запрос = мCоединение.NewObject("Запрос"); 
	
	Запрос.Текст = "Выбрать ПЕРВЫЕ 10 Код, Наименование из Справочник.Номенклатура ГДЕ ЭТоГруппа = ЛОЖЬ";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сообщить(Выборка.Код+", "+Выборка.Наименование);
	КонецЦикла;
	
	Запрос = Неопределено;
	мCоединение = Неопределено;
	мКоннектор = Неопределено;

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ПроверитьПодключениеНаСервере();                                                   
КонецПроцедуры

Функция ПодключениеКБазе1С(ПутьКБазе, Пользователь, Пароль = "", Сервер, БазаДанных)    
        СтрокаПодключения = "";
        Если Не ПустаяСтрока(Сервер)  Тогда
                 СтрокаПодключения = "Srvr=""" + Сервер + """;Ref=""" + БазаДанных + """;Usr=""" + Пользователь + """;Pwd=""" + Пароль + """";
        Иначе    
                  СтрокаПодключения = "File=""" + ПутьКБазе + """;Usr=""" + Пользователь + """;Pwd=""" + Пароль + """";
        КонецЕсли;
       мКоннектор = Новый COMObject("v83.COMConnector");
       мCоединение            = мКоннектор.Connect(СтрокаПодключения);
	   
	   Возврат мCоединение;
КонецФункции