&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДвиженияКМФулфилмент = ПредопределенноеЗначение("Документ.ДвиженияКМФулфилмент.пустаяСсылка");
КонецПроцедуры


&НаСервере
Процедура ОтправитьЗапросВЧестныйЗнакНаСервере()
	
	Сервер = "todo доделать хранение адреса: markirovka.sandbox.crpt.ru";
	ГруппаТоваров = "lp";
	ПричинаСписания = "RETAIL";
	Сертификат = "todo Доделать выбор и хранение отпечатка сертификата";
	
	Токен = "";//ксп_Элис_ОбщегоНазначения.ПолучитьТокенНаСервере(Сервер, Сертификат);
	
	ИННУчастника = "";
	
	ТаблицаКИ = Новый ТаблицаЗначений;
	ТаблицаКИ.Колонки.Добавить("КодМаркировкиСтрока");
	ТаблицаКИ.Колонки.Добавить("ЦенаСНДС");

	Для каждого стрк Из ДвиженияКМФулфилмент.ДвиженияКодовМаркировки Цикл
		новСтр = ТаблицаКИ.Добавить();
		новСтр.КодМаркировкиСтрока = стрк.КодМаркировки;
		Если стрк.Количество = 0 Тогда                         
			новСтр.ЦенаСНДС = 0;
		Иначе 
			новСтр.ЦенаСНДС = стрк.СУммаСНДС / стрк.Количество;
		КонецЕсли;
		
	КонецЦикла;

			ДатаВыбытия = ДвиженияКМФулфилмент.Дата;
			НомерВыбытия = ДвиженияКМФулфилмент.Номер;
			ПричинаВыбытия_Action = "RETAIL";
			
			document_type = "SALES_RECEIPT";
			// 4.2.8 Вывод из оборота
			Документ_JSON = РеквизитФормыВЗначение("Объект")
				.СформироватьВыводИзОборотаJson(ИННУчастника, ТаблицаКИ, ДатаВыбытия, НомерВыбытия, 
				ПричинаВыбытия_Action, document_type);
			
			// 4.1 Единый метод созд. документов
			КодТипаДокумента = "LK_RECEIPT";// Вывод из оборота json
			ДанныеДляЗапроса_JSON = РеквизитФормыВЗначение("Объект")
				.СформироватьДокументДляОтправки(Документ_JSON, Сертификат, КодТипаДокумента);
			
			// Просто выполняем http-запрос
			РеквизитФормыВЗначение("Объект")
				.ВыполнитьЗапросКЧестномуЗнаку(ДанныеДляЗапроса_JSON, Сервер, ГруппаТоваров, Токен)
			
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапросВЧестныйЗнак(Команда)
	ОтправитьЗапросВЧестныйЗнакНаСервере();
КонецПроцедуры

