Функция ConnectionString(ИмяСервера, Порт, ИмяПользователя, Пароль, ИмяБазыДанных, ДрайверMSSQL) Экспорт
	
	Если Врег(ДрайверMSSQL) = "OLEDB" Тогда
		// этот вариант дается на // https://www.connectionstrings.com/sql-server/
		Рез = "Provider=MSOLEDBSQL;Server=%1;Database=%2;UID=%3;PWD=%4;";
		// тоже рабочий вариант, но более старый
		//Рез = "Provider=Microsoft OLE DB Provider for SQL Server;Data Source=%1;Initial Catalog=%2;UID=%3;PWD=%4;";
	ИначеЕсли Врег(ДрайверMSSQL) = "ODBC.17" Тогда
		Рез = "Driver={ODBC Driver 17 for SQL Server};Server=%1;Database=%2;UID=%3;PWD=%4;";
	Иначе
		Рез = "Driver={ODBC Driver 17 for SQL Server};Server=%1;Database=%2;UID=%3;PWD=%4;";
	КонецЕсли; 
	
	Рез = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Рез,
		ИмяСервера,
		ИмяБазыДанных,
		ИмяПользователя,
		Пароль);
		
	Возврат Рез;

КонецФункции


&НаСервере
Процедура ТестПрочитатьПервые10ШКНаСервере()
	// Вставить содержимое обработчика.  
	обк = РеквизитФормыВЗначение("Объект");
	
	adoConnection = Новый COMОбъект("ADODB.Connection");
	ИмяСервера = "1c-dev";
	Порт=1433;
	ИмяПользователя = "eleg8-koderline";
	Пароль="5820ApodPlotPreeExteType";
	ИмяБазыДанных="eleg8-koderline";
	ДрайверMSSQL = "ODBC.17";
	connString = ConnectionString(ИмяСервера, Порт, ИмяПользователя, Пароль, ИмяБазыДанных, ДрайверMSSQL);
	adoConnection.Open(connString);
	
	queryText = "select top 10 * from _InfoRg15498";
	
	_Command 					= Новый COMОбъект("ADODB.Command"); 
	_Command.ActiveConnection 	= adoConnection;
	_Command.CommandTimeout		= 20;
	_Command.CommandText 		= queryText; 
    _Command.CommandType 		= 8;//adCmdUnknown(8)    //adCmdStoredProc(4) 	- хранимая процедура. 

	
	
	recordSet = _Command.execute(); 
	
	while not recordSet.eof() do
		
		сообщить(recordSet.items(0).value);
		recordSet.moveNext();
	enddo;
	
	
	
	adoConnection.disconnect();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестПрочитатьПервые10ШК(Команда)
	ТестПрочитатьПервые10ШКНаСервере();
КонецПроцедуры  






&НаСервере
Процедура ЗагрузитьВсеНаСервере()
	обк = РеквизитФормыВЗначение("Объект"); 
	ИдВызова = мис_логгерСервер.СоздатьИдВызова(Неопределено, "Импорт ШК из УПП через АДО", ТекущаяДата(),"", Неопределено, Неопределено);
	обк.ЗагрузитьВсеНаСервере(ИдВызова, Сервер,ИмяБазы,
		Пользователь,Пароль,РазмерПакета,Обновлять,МестоЗапуска);
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьВсе(Команда)

	ЗагрузитьВсеНаСервере();
	мис_логгерКлиент.ОткрытьОтчетПоЛогу(ИдВызова, Ложь, ЭтаФорма);
	
КонецПроцедуры      





&НаСервере
Процедура Тест01_ОбработатьОдинПакетНаСервере()
	ИдВызова = мис_логгерСервер.СоздатьИдВызова(Неопределено, "Тест01_ОбработатьОдинПакетНаСервере", ТекущаяДата(),"", Неопределено, Неопределено);
	обк = РеквизитФормыВЗначение("Объект"); 
	обк.Тест01_ОбработатьОдинПакет(ИдВызова);
КонецПроцедуры

&НаКлиенте
Процедура Тест01_ОбработатьОдинПакет(Команда)
	Тест01_ОбработатьОдинПакетНаСервере();
	мис_логгерКлиент.ОткрытьОтчетПоЛогу(ИдВызова, Ложь, ЭтаФорма);
КонецПроцедуры






