&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Ссылка = Об.ЗагрузитьИзJsonНаСервере(JsonText);
	СсылочныйТип = Ссылка;
    Возврат Ссылка;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	Ссылка = ЗагрузитьИзJsonНаСервере();
	Сообщить(НСтр("ru = '"+строка(ссылка)+"'"), СтатусСообщения.БезСтатуса);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Версия.Заголовок = "Версия :"+Строка(
		РеквизитФормыВЗначение("Объект").СведенияОВнешнейОбработке().Версия
	);
КонецПроцедуры

