&НаКлиенте
Процедура ЗагрузитьИзJson(Команда)
	тДок = ЗагрузитьИзJsonНаСервере();   
	
	//Сарычев
	Если тДок = Неопределено Тогда  
		Сообщить(НСтр("ru = '"+строка("Загрузка НЕ выполнена! Ошибка в JSON.")+"'"), СтатусСообщения.БезСтатуса);		
		Возврат; 
	ИначеЕсли тДок = 0 Тогда
		
	КонецЕсли;	
	//---
	
	Сообщить(НСтр("ru = '"+строка("Загрузка выполнена! Созданные документы помещены в таблицу на форме.")+"'"), СтатусСообщения.БезСтатуса);
	Если ТипЗнч(тДок) = Тип("ТекстовыйДокумент") Тогда
		тДок.Показать("Ненайденная в ЕРП номенклатура");
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция ЗагрузитьИзJsonНаСервере()
	обк = РеквизитФормыВЗначение("Объект");
	обк.СобиратьНеНайденнуюНоменклатуру = Истина;
	СтруктураОтвета = обк.ЗагрузитьИзJsonНаСервере(JsonText);
	
	//Сарычев
	Если СтруктураОтвета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	
	//---
	
	ТЗДокументов.Очистить();
	
	Если ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда  
		Если СтруктураОтвета.Свойство("ОтчетОРозничныхПродажах") Тогда  
			//Сообщить("Отчет о РП");
			НовСтр = ТЗДокументов.Добавить();
			НовСтр.Документ = СтруктураОтвета.ОтчетОРозничныхПродажах;
		Иначе
			Сообщить("Не тот документ");
			Возврат Неопределено;
		КонецЕсли;    
		
		Если СтруктураОтвета.Свойство ("НеНайденнаяНоменклатураМассив") Тогда   
			НеНайденнаяНоменклатураМассив = СтруктураОтвета.НеНайденнаяНоменклатураМассив;
			Если НеНайденнаяНоменклатураМассив.Количество() > 0 Тогда
				Сообщить("Не найдена Номенклатура");
				тДок = Новый ТекстовыйДокумент;
				Для каждого эл Из НеНайденнаяНоменклатураМассив Цикл
					тДок.ДобавитьСтроку(эл);
				КонецЦикла;
				
				Возврат тДок;
				
			КонецЕсли; 
		Иначе
			Сообщить("Ненайденой Номенклатуры не было");
			Возврат 0;
		КонецЕсли;
		
	КонецЕсли;  
	
КонецФункции


&НаКлиенте
Процедура Тест_Схема_1_ПеремещениеНаФулфилмент(Команда)
	Тест_Схема_1_ПеремещениеНаФулфилментНаСервере();
КонецПроцедуры
&НаСервере
Процедура Тест_Схема_1_ПеремещениеНаФулфилментНаСервере()
	СтруктураОтвета = РеквизитФормыВЗначение("Объект").Тест_Схема_1_ПеремещениеНаФулфилмент(JsonText);
	ТЗДокументов.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура Тест_Схема_2_ПередачаНаКомиссию(Команда)
	Тест_Схема_2_ПередачаНаКомиссиюНаСервере();
КонецПроцедуры
&НаСервере
Процедура Тест_Схема_2_ПередачаНаКомиссиюНаСервере()
	СтруктураОтвета = РеквизитФормыВЗначение("Объект").Тест_Схема_2_ПередачаНаКомиссию(JsonText);
	ТЗДокументов.Очистить();
КонецПроцедуры







