Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Информация = НСтр("ru = 'Создание штрихкодов номенклатуры по кодам маркировки'");
	ПараметрыРегистрации.Вид = "ДополнительнаяОбработка";
	ПараметрыРегистрации.Версия = "1.1";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Создание штрихкодов номенклатуры по кодам маркировки'");
	Команда.Идентификатор = "СозданиеШКпоКМ";
	Команда.Использование = "ОткрытиеФормы";
	Команда.ПоказыватьОповещение = Истина;
		
	Возврат ПараметрыРегистрации;
	
КонецФункции
